In [50]:
# AWS-LINUX

import findspark
findspark.init("/opt/spark")

In [51]:
import pyspark
from pyspark.sql import SparkSession

In [52]:
spark = SparkSession.builder.getOrCreate()
spark

![spark1](images/spark1.png)

## 리스트객체로 RDD 객체 생성하기

### RDD(Resilient Distributed Dataset)
#### read-only 데이터셋으로서 다양한 머신에 데이터셋의 멀티셋(중복을 허용)을 분산해두고 특정한 머신에 문제가 생기더라도 문제없이 읽을수로 있도록 지원한다

- MapReduce 작업
- 분산하여 병렬적 처리
- 빠른 연산
- 불변(Immutable)
- Transformation 과 Action 으로 함수 종류가 나눠지며, Action 함수가 실행됐을 때 실제 연산
- Lineage 를 통해 Fault Tolerant(내고장성) 보장

In [53]:
dataList = [("Java", 20000), ("Python", 100000), ("Scala", 3000)]
rdd=spark.sparkContext.parallelize(dataList)
print(rdd)
print(type(rdd))
print(rdd.collect())

ParallelCollectionRDD[228] at parallelize at PythonRDD.scala:195
<class 'pyspark.rdd.RDD'>
[('Java', 20000), ('Python', 100000), ('Scala', 3000)]

In [54]:
print(spark.version)

2.4.7

## 텍스트 파일 내용 읽어서 RDD 객체 생성하기

In [55]:
rdd = spark.read.text("data/korean_stopwords.txt")
print(type(rdd))
print(rdd.collect())

<class 'pyspark.sql.dataframe.DataFrame'>
[Row(value='아'), Row(value='휴'), Row(value='아이구'), Row(value='아이쿠'), Row(value='아이고'), Row(value='어'), Row(value='나'), Row(value='우리'), Row(value='저희'), Row(value='따라'), Row(value='의해'), Row(value='을'), Row(value='를'), Row(value='에'), Row(value='의'), Row(value='가'), Row(value='으로'), Row(value='로'), Row(value='에게'), Row(value='뿐이다'), Row(value='의거하여'), Row(value='근거하여'), Row(value='입각하여'), Row(value='기준으로'), Row(value='예하면'), Row(value='예를 들면'), Row(value='예를 들자면'), Row(value='저'), Row(value='소인'), Row(value='소생'), Row(value='저희'), Row(value='지말고'), Row(value='하지마'), Row(value='하지마라'), Row(value='다른'), Row(value='물론'), Row(value='또한'), Row(value='그리고'), Row(value='비길수 없다'), Row(value='해서는 안된다'), Row(value='뿐만 아니라'), Row(value='만이 아니다'), Row(value='만은 아니다'), Row(value='막론하고'), Row(value='관계없이'), Row(value='그치지 않다'), Row(value='그러나'), Row(value='그런데'), Row(value='하지만'), Row(value='든간에'), Row(value='논하지 않다'), Row(value='따지지 않다'), Row(value='설사'), Row(value='비록'), Row(value='더라도'), Row(value='아니면'), Row(value='만 못하다'), Row(value='하는 편이 낫다'), Row(value='불문하고'), Row(value='향하여'), Row(value='향해서'), Row(value='향하다'), Row(value='쪽으로'), Row(value='틈타'), Row(value='이용하여'), Row(value='타다'), Row(value='오르다'), Row(value='제외하고'), Row(value='이 외에'), Row(value='이 밖에'), Row(value='하여야'), Row(value='비로소'), Row(value='한다면 몰라도'), Row(value='외에도'), Row(value='이곳'), Row(value='여기'), Row(value='부터'), Row(value='기점으로'), Row(value='따라서'), Row(value='할 생각이다'), Row(value='하려고하다'), Row(value='이리하여'), Row(value='그리하여'), Row(value='그렇게 함으로써'), Row(value='하지만'), Row(value='일때'), Row(value='할때'), Row(value='앞에서'), Row(value='중에서'), Row(value='보는데서'), Row(value='으로써'), Row(value='로써'), Row(value='까지'), Row(value='해야한다'), Row(value='일것이다'), Row(value='반드시'), Row(value='할줄알다'), Row(value='할수있다'), Row(value='할수있어'), Row(value='임에 틀림없다'), Row(value='한다면'), Row(value='등'), Row(value='등등'), Row(value='제'), Row(value='겨우'), Row(value='단지'), Row(value='다만'), Row(value='할뿐'), Row(value='딩동'), Row(value='댕그'), Row(value='대해서'), Row(value='대하여'), Row(value='대하면'), Row(value='훨씬'), Row(value='얼마나'), Row(value='얼마만큼'), Row(value='얼마큼'), Row(value='남짓'), Row(value='여'), Row(value='얼마간'), Row(value='약간'), Row(value='다소'), Row(value='좀'), Row(value='조금'), Row(value='다수'), Row(value='몇'), Row(value='얼마'), Row(value='지만'), Row(value='하물며'), Row(value='또한'), Row(value='그러나'), Row(value='그렇지만'), Row(value='하지만'), Row(value='이외에도'), Row(value='대해 말하자면'), Row(value='뿐이다'), Row(value='다음에'), Row(value='반대로'), Row(value='반대로 말하자면'), Row(value='이와 반대로'), Row(value='바꾸어서 말하면'), Row(value='바꾸어서 한다면'), Row(value='만약'), Row(value='그렇지않으면'), Row(value='까악'), Row(value='툭'), Row(value='딱'), Row(value='삐걱거리다'), Row(value='보드득'), Row(value='비걱거리다'), Row(value='꽈당'), Row(value='응당'), Row(value='해야한다'), Row(value='에 가서'), Row(value='각'), Row(value='각각'), Row(value='여러분'), Row(value='각종'), Row(value='각자'), Row(value='제각기'), Row(value='하도록하다'), Row(value='와'), Row(value='과'), Row(value='그러므로'), Row(value='그래서'), Row(value='고로'), Row(value='한 까닭에'), Row(value='하기 때문에'), Row(value='거니와'), Row(value='이지만'), Row(value='대하여'), Row(value='관하여'), Row(value='관한'), Row(value='과연'), Row(value='실로'), Row(value='아니나다를가'), Row(value='생각한대로'), Row(value='진짜로'), Row(value='한적이있다'), Row(value='하곤하였다'), Row(value='하'), Row(value='하하'), Row(value='허허'), Row(value='아하'), Row(value='거바'), Row(value='와'), Row(value='오'), Row(value='왜'), Row(value='어째서'), Row(value='무엇때문에'), Row(value='어찌'), Row(value='하겠는가'), Row(value='무슨'), Row(value='어디'), Row(value='어느곳'), Row(value='더군다나'), Row(value='하물며'), Row(value='더욱이는'), Row(value='어느때'), Row(value='언제'), Row(value='야'), Row(value='이봐'), Row(value='어이'), Row(value='여보시오'), Row(value='흐흐'), Row(value='흥'), Row(value='휴'), Row(value='헉헉'), Row(value='헐떡헐떡'), Row(value='영차'), Row(value='여차'), Row(value='어기여차'), Row(value='끙끙'), Row(value='아야'), Row(value='앗'), Row(value='아야'), Row(value='콸콸'), Row(value='졸졸'), Row(value='좍좍'), Row(value='뚝뚝'), Row(value='주룩주룩'), Row(value='솨'), Row(value='우르르'), Row(value='그래도'), Row(value='또'), Row(value='그리고'), Row(value='바꾸어말하면'), Row(value='바꾸어말하자면'), Row(value='혹은'), Row(value='혹시'), Row(value='답다'), Row(value='및'), Row(value='그에 따르는'), Row(value='때가 되어'), Row(value='즉'), Row(value='지든지'), Row(value='설령'), Row(value='가령'), Row(value='하더라도'), Row(value='할지라도'), Row(value='일지라도'), Row(value='지든지'), Row(value='몇'), Row(value='거의'), Row(value='하마터면'), Row(value='인젠'), Row(value='이젠'), Row(value='된바에야'), Row(value='된이상'), Row(value='만큼\t어찌됏든'), Row(value='그위에'), Row(value='게다가'), Row(value='점에서 보아'), Row(value='비추어 보아'), Row(value='고려하면'), Row(value='하게될것이다'), Row(value='일것이다'), Row(value='비교적'), Row(value='좀'), Row(value='보다더'), Row(value='비하면'), Row(value='시키다'), Row(value='하게하다'), Row(value='할만하다'), Row(value='의해서'), Row(value='연이서'), Row(value='이어서'), Row(value='잇따라'), Row(value='뒤따라'), Row(value='뒤이어'), Row(value='결국'), Row(value='의지하여'), Row(value='기대여'), Row(value='통하여'), Row(value='자마자'), Row(value='더욱더'), Row(value='불구하고'), Row(value='얼마든지'), Row(value='마음대로'), Row(value='주저하지 않고'), Row(value='곧'), Row(value='즉시'), Row(value='바로'), Row(value='당장'), Row(value='하자마자'), Row(value='밖에 안된다'), Row(value='하면된다'), Row(value='그래'), Row(value='그렇지'), Row(value='요컨대'), Row(value='다시 말하자면'), Row(value='바꿔 말하면'), Row(value='즉'), Row(value='구체적으로'), Row(value='말하자면'), Row(value='시작하여'), Row(value='시초에'), Row(value='이상'), Row(value='허'), Row(value='헉'), Row(value='허걱'), Row(value='바와같이'), Row(value='해도좋다'), Row(value='해도된다'), Row(value='게다가'), Row(value='더구나'), Row(value='하물며'), Row(value='와르르'), Row(value='팍'), Row(value='퍽'), Row(value='펄렁'), Row(value='동안'), Row(value='이래'), Row(value='하고있었다'), Row(value='이었다'), Row(value='에서'), Row(value='로부터'), Row(value='까지'), Row(value='예하면'), Row(value='했어요'), Row(value='해요'), Row(value='함께'), Row(value='같이'), Row(value='더불어'), Row(value='마저'), Row(value='마저도'), Row(value='양자'), Row(value='모두'), Row(value='습니다'), Row(value='가까스로'), Row(value='하려고하다'), Row(value='즈음하여'), Row(value='다른'), Row(value='다른 방면으로'), Row(value='해봐요'), Row(value='습니까'), Row(value='했어요'), Row(value='말할것도 없고'), Row(value='무릎쓰고'), Row(value='개의치않고'), Row(value='하는것만 못하다'), Row(value='하는것이 낫다'), Row(value='매'), Row(value='매번'), Row(value='들'), Row(value='모'), Row(value='어느것'), Row(value='어느'), Row(value='로써'), Row(value='갖고말하자면'), Row(value='어디'), Row(value='어느쪽'), Row(value='어느것'), Row(value='어느해'), Row(value='어느 년도'), Row(value='라 해도'), Row(value='언젠가'), Row(value='어떤것'), Row(value='어느것'), Row(value='저기'), Row(value='저쪽'), Row(value='저것'), Row(value='그때'), Row(value='그럼'), Row(value='그러면'), Row(value='요만한걸'), Row(value='그래'), Row(value='그때'), Row(value='저것만큼'), Row(value='그저'), Row(value='이르기까지'), Row(value='할 줄 안다'), Row(value='할 힘이 있다'), Row(value='너'), Row(value='너희'), Row(value='당신'), Row(value='어찌'), Row(value='설마'), Row(value='차라리'), Row(value='할지언정'), Row(value='할지라도'), Row(value='할망정'), Row(value='할지언정'), Row(value='구토하다'), Row(value='게우다'), Row(value='토하다'), Row(value='메쓰겁다'), Row(value='옆사람'), Row(value='퉤'), Row(value='쳇'), Row(value='의거하여'), Row(value='근거하여'), Row(value='의해'), Row(value='따라'), Row(value='힘입어'), Row(value='그'), Row(value='다음'), Row(value='버금'), Row(value='두번째로'), Row(value='기타'), Row(value='첫번째로'), Row(value='나머지는'), Row(value='그중에서'), Row(value='견지에서'), Row(value='형식으로 쓰여'), Row(value='입장에서'), Row(value='위해서'), Row(value='단지'), Row(value='의해되다'), Row(value='하도록시키다'), Row(value='뿐만아니라'), Row(value='반대로'), Row(value='전후'), Row(value='전자'), Row(value='앞의것'), Row(value='잠시'), Row(value='잠깐'), Row(value='하면서'), Row(value='그렇지만'), Row(value='다음에'), Row(value='그러한즉'), Row(value='그런즉'), Row(value='남들'), Row(value='아무거나'), Row(value='어찌하든지'), Row(value='같다'), Row(value='비슷하다'), Row(value='예컨대'), Row(value='이럴정도로'), Row(value='어떻게'), Row(value='만약'), Row(value='만일'), Row(value='위에서 서술한바와같이'), Row(value='인 듯하다'), Row(value='하지 않는다면'), Row(value='만약에'), Row(value='무엇'), Row(value='무슨'), Row(value='어느'), Row(value='어떤'), Row(value='아래윗'), Row(value='조차'), Row(value='한데'), Row(value='그럼에도 불구하고'), Row(value='여전히'), Row(value='심지어'), Row(value='까지도'), Row(value='조차도'), Row(value='하지 않도록'), Row(value='않기 위하여'), Row(value='때'), Row(value='시각'), Row(value='무렵'), Row(value='시간'), Row(value='동안'), Row(value='어때'), Row(value='어떠한'), Row(value='하여금'), Row(value='네'), Row(value='예'), Row(value='우선'), Row(value='누구'), Row(value='누가 알겠는가'), Row(value='아무도'), Row(value='줄은모른다'), Row(value='줄은 몰랏다'), Row(value='하는 김에'), Row(value='겸사겸사'), Row(value='하는바'), Row(value='그런 까닭에'), Row(value='한 이유는'), Row(value='그러니'), Row(value='그러니까'), Row(value='때문에'), Row(value='그'), Row(value='너희'), Row(value='그들'), Row(value='너희들'), Row(value='타인'), Row(value='것'), Row(value='것들'), Row(value='너'), Row(value='위하여'), Row(value='공동으로'), Row(value='동시에'), Row(value='하기 위하여'), Row(value='어찌하여'), Row(value='무엇때문에'), Row(value='붕붕'), Row(value='윙윙'), Row(value='나'), Row(value='우리'), Row(value='엉엉'), Row(value='휘익'), Row(value='윙윙'), Row(value='오호'), Row(value='아하'), Row(value='어쨋든'), Row(value='만 못하다\t하기보다는'), Row(value='차라리'), Row(value='하는 편이 낫다'), Row(value='흐흐'), Row(value='놀라다'), Row(value='상대적으로 말하자면'), Row(value='마치'), Row(value='아니라면'), Row(value='쉿'), Row(value='그렇지 않으면'), Row(value='그렇지 않다면'), Row(value='안 그러면'), Row(value='아니었다면'), Row(value='하든지'), Row(value='아니면'), Row(value='이라면'), Row(value='좋아'), Row(value='알았어'), Row(value='하는것도'), Row(value='그만이다'), Row(value='어쩔수 없다'), Row(value='하나'), Row(value='일'), Row(value='일반적으로'), Row(value='일단'), Row(value='한켠으로는'), Row(value='오자마자'), Row(value='이렇게되면'), Row(value='이와같다면'), Row(value='전부'), Row(value='한마디'), Row(value='한항목'), Row(value='근거로'), Row(value='하기에'), Row(value='아울러'), Row(value='하지 않도록'), Row(value='않기 위해서'), Row(value='이르기까지'), Row(value='이 되다'), Row(value='로 인하여'), Row(value='까닭으로'), Row(value='이유만으로'), Row(value='이로 인하여'), Row(value='그래서'), Row(value='이 때문에'), Row(value='그러므로'), Row(value='그런 까닭에'), Row(value='알 수 있다'), Row(value='결론을 낼 수 있다'), Row(value='으로 인하여'), Row(value='있다'), Row(value='어떤것'), Row(value='관계가 있다'), Row(value='관련이 있다'), Row(value='연관되다'), Row(value='어떤것들'), Row(value='에 대해'), Row(value='이리하여'), Row(value='그리하여'), Row(value='여부'), Row(value='하기보다는'), Row(value='하느니'), Row(value='하면 할수록'), Row(value='운운'), Row(value='이러이러하다'), Row(value='하구나'), Row(value='하도다'), Row(value='다시말하면'), Row(value='다음으로'), Row(value='에 있다'), Row(value='에 달려 있다'), Row(value='우리'), Row(value='우리들'), Row(value='오히려'), Row(value='하기는한데'), Row(value='어떻게'), Row(value='어떻해'), Row(value='어찌됏어'), Row(value='어때'), Row(value='어째서'), Row(value='본대로'), Row(value='자'), Row(value='이'), Row(value='이쪽'), Row(value='여기'), Row(value='이것'), Row(value='이번'), Row(value='이렇게말하자면'), Row(value='이런'), Row(value='이러한'), Row(value='이와 같은'), Row(value='요만큼'), Row(value='요만한 것'), Row(value='얼마 안 되는 것'), Row(value='이만큼'), Row(value='이 정도의'), Row(value='이렇게 많은 것'), Row(value='이와 같다'), Row(value='이때'), Row(value='이렇구나'), Row(value='것과 같이'), Row(value='끼익'), Row(value='삐걱'), Row(value='따위'), Row(value='와 같은 사람들'), Row(value='부류의 사람들'), Row(value='왜냐하면'), Row(value='중의하나'), Row(value='오직'), Row(value='오로지'), Row(value='에 한하다'), Row(value='하기만 하면'), Row(value='도착하다'), Row(value='까지 미치다'), Row(value='도달하다'), Row(value='정도에 이르다'), Row(value='할 지경이다'), Row(value='결과에 이르다'), Row(value='관해서는'), Row(value='여러분'), Row(value='하고 있다'), Row(value='한 후'), Row(value='혼자'), Row(value='자기'), Row(value='자기집'), Row(value='자신'), Row(value='우에 종합한것과같이'), Row(value='총적으로 보면'), Row(value='총적으로 말하면'), Row(value='총적으로'), Row(value='대로 하다'), Row(value='으로서'), Row(value='참'), Row(value='그만이다'), Row(value='할 따름이다'), Row(value='쿵'), Row(value='탕탕'), Row(value='쾅쾅'), Row(value='둥둥'), Row(value='봐'), Row(value='봐라'), Row(value='아이야'), Row(value='아니'), Row(value='와아'), Row(value='응'), Row(value='아이'), Row(value='참나'), Row(value='년'), Row(value='월'), Row(value='일'), Row(value='령'), Row(value='영'), Row(value='일'), Row(value='이'), Row(value='삼'), Row(value='사'), Row(value='오'), Row(value='육'), Row(value='륙'), Row(value='칠'), Row(value='팔'), Row(value='구'), Row(value='이천육'), Row(value='이천칠'), Row(value='이천팔'), Row(value='이천구'), Row(value='하나'), Row(value='둘'), Row(value='셋'), Row(value='넷'), Row(value='다섯'), Row(value='여섯'), Row(value='일곱'), Row(value='여덟'), Row(value='아홉'), Row(value='령'), Row(value='영')]

In [56]:
rdd = spark.sparkContext.textFile("data/korean_stopwords.txt")
print(type(rdd))
print(rdd.collect())

<class 'pyspark.rdd.RDD'>
['아', '휴', '아이구', '아이쿠', '아이고', '어', '나', '우리', '저희', '따라', '의해', '을', '를', '에', '의', '가', '으로', '로', '에게', '뿐이다', '의거하여', '근거하여', '입각하여', '기준으로', '예하면', '예를 들면', '예를 들자면', '저', '소인', '소생', '저희', '지말고', '하지마', '하지마라', '다른', '물론', '또한', '그리고', '비길수 없다', '해서는 안된다', '뿐만 아니라', '만이 아니다', '만은 아니다', '막론하고', '관계없이', '그치지 않다', '그러나', '그런데', '하지만', '든간에', '논하지 않다', '따지지 않다', '설사', '비록', '더라도', '아니면', '만 못하다', '하는 편이 낫다', '불문하고', '향하여', '향해서', '향하다', '쪽으로', '틈타', '이용하여', '타다', '오르다', '제외하고', '이 외에', '이 밖에', '하여야', '비로소', '한다면 몰라도', '외에도', '이곳', '여기', '부터', '기점으로', '따라서', '할 생각이다', '하려고하다', '이리하여', '그리하여', '그렇게 함으로써', '하지만', '일때', '할때', '앞에서', '중에서', '보는데서', '으로써', '로써', '까지', '해야한다', '일것이다', '반드시', '할줄알다', '할수있다', '할수있어', '임에 틀림없다', '한다면', '등', '등등', '제', '겨우', '단지', '다만', '할뿐', '딩동', '댕그', '대해서', '대하여', '대하면', '훨씬', '얼마나', '얼마만큼', '얼마큼', '남짓', '여', '얼마간', '약간', '다소', '좀', '조금', '다수', '몇', '얼마', '지만', '하물며', '또한', '그러나', '그렇지만', '하지만', '이외에도', '대해 말하자면', '뿐이다', '다음에', '반대로', '반대로 말하자면', '이와 반대로', '바꾸어서 말하면', '바꾸어서 한다면', '만약', '그렇지않으면', '까악', '툭', '딱', '삐걱거리다', '보드득', '비걱거리다', '꽈당', '응당', '해야한다', '에 가서', '각', '각각', '여러분', '각종', '각자', '제각기', '하도록하다', '와', '과', '그러므로', '그래서', '고로', '한 까닭에', '하기 때문에', '거니와', '이지만', '대하여', '관하여', '관한', '과연', '실로', '아니나다를가', '생각한대로', '진짜로', '한적이있다', '하곤하였다', '하', '하하', '허허', '아하', '거바', '와', '오', '왜', '어째서', '무엇때문에', '어찌', '하겠는가', '무슨', '어디', '어느곳', '더군다나', '하물며', '더욱이는', '어느때', '언제', '야', '이봐', '어이', '여보시오', '흐흐', '흥', '휴', '헉헉', '헐떡헐떡', '영차', '여차', '어기여차', '끙끙', '아야', '앗', '아야', '콸콸', '졸졸', '좍좍', '뚝뚝', '주룩주룩', '솨', '우르르', '그래도', '또', '그리고', '바꾸어말하면', '바꾸어말하자면', '혹은', '혹시', '답다', '및', '그에 따르는', '때가 되어', '즉', '지든지', '설령', '가령', '하더라도', '할지라도', '일지라도', '지든지', '몇', '거의', '하마터면', '인젠', '이젠', '된바에야', '된이상', '만큼\t어찌됏든', '그위에', '게다가', '점에서 보아', '비추어 보아', '고려하면', '하게될것이다', '일것이다', '비교적', '좀', '보다더', '비하면', '시키다', '하게하다', '할만하다', '의해서', '연이서', '이어서', '잇따라', '뒤따라', '뒤이어', '결국', '의지하여', '기대여', '통하여', '자마자', '더욱더', '불구하고', '얼마든지', '마음대로', '주저하지 않고', '곧', '즉시', '바로', '당장', '하자마자', '밖에 안된다', '하면된다', '그래', '그렇지', '요컨대', '다시 말하자면', '바꿔 말하면', '즉', '구체적으로', '말하자면', '시작하여', '시초에', '이상', '허', '헉', '허걱', '바와같이', '해도좋다', '해도된다', '게다가', '더구나', '하물며', '와르르', '팍', '퍽', '펄렁', '동안', '이래', '하고있었다', '이었다', '에서', '로부터', '까지', '예하면', '했어요', '해요', '함께', '같이', '더불어', '마저', '마저도', '양자', '모두', '습니다', '가까스로', '하려고하다', '즈음하여', '다른', '다른 방면으로', '해봐요', '습니까', '했어요', '말할것도 없고', '무릎쓰고', '개의치않고', '하는것만 못하다', '하는것이 낫다', '매', '매번', '들', '모', '어느것', '어느', '로써', '갖고말하자면', '어디', '어느쪽', '어느것', '어느해', '어느 년도', '라 해도', '언젠가', '어떤것', '어느것', '저기', '저쪽', '저것', '그때', '그럼', '그러면', '요만한걸', '그래', '그때', '저것만큼', '그저', '이르기까지', '할 줄 안다', '할 힘이 있다', '너', '너희', '당신', '어찌', '설마', '차라리', '할지언정', '할지라도', '할망정', '할지언정', '구토하다', '게우다', '토하다', '메쓰겁다', '옆사람', '퉤', '쳇', '의거하여', '근거하여', '의해', '따라', '힘입어', '그', '다음', '버금', '두번째로', '기타', '첫번째로', '나머지는', '그중에서', '견지에서', '형식으로 쓰여', '입장에서', '위해서', '단지', '의해되다', '하도록시키다', '뿐만아니라', '반대로', '전후', '전자', '앞의것', '잠시', '잠깐', '하면서', '그렇지만', '다음에', '그러한즉', '그런즉', '남들', '아무거나', '어찌하든지', '같다', '비슷하다', '예컨대', '이럴정도로', '어떻게', '만약', '만일', '위에서 서술한바와같이', '인 듯하다', '하지 않는다면', '만약에', '무엇', '무슨', '어느', '어떤', '아래윗', '조차', '한데', '그럼에도 불구하고', '여전히', '심지어', '까지도', '조차도', '하지 않도록', '않기 위하여', '때', '시각', '무렵', '시간', '동안', '어때', '어떠한', '하여금', '네', '예', '우선', '누구', '누가 알겠는가', '아무도', '줄은모른다', '줄은 몰랏다', '하는 김에', '겸사겸사', '하는바', '그런 까닭에', '한 이유는', '그러니', '그러니까', '때문에', '그', '너희', '그들', '너희들', '타인', '것', '것들', '너', '위하여', '공동으로', '동시에', '하기 위하여', '어찌하여', '무엇때문에', '붕붕', '윙윙', '나', '우리', '엉엉', '휘익', '윙윙', '오호', '아하', '어쨋든', '만 못하다\t하기보다는', '차라리', '하는 편이 낫다', '흐흐', '놀라다', '상대적으로 말하자면', '마치', '아니라면', '쉿', '그렇지 않으면', '그렇지 않다면', '안 그러면', '아니었다면', '하든지', '아니면', '이라면', '좋아', '알았어', '하는것도', '그만이다', '어쩔수 없다', '하나', '일', '일반적으로', '일단', '한켠으로는', '오자마자', '이렇게되면', '이와같다면', '전부', '한마디', '한항목', '근거로', '하기에', '아울러', '하지 않도록', '않기 위해서', '이르기까지', '이 되다', '로 인하여', '까닭으로', '이유만으로', '이로 인하여', '그래서', '이 때문에', '그러므로', '그런 까닭에', '알 수 있다', '결론을 낼 수 있다', '으로 인하여', '있다', '어떤것', '관계가 있다', '관련이 있다', '연관되다', '어떤것들', '에 대해', '이리하여', '그리하여', '여부', '하기보다는', '하느니', '하면 할수록', '운운', '이러이러하다', '하구나', '하도다', '다시말하면', '다음으로', '에 있다', '에 달려 있다', '우리', '우리들', '오히려', '하기는한데', '어떻게', '어떻해', '어찌됏어', '어때', '어째서', '본대로', '자', '이', '이쪽', '여기', '이것', '이번', '이렇게말하자면', '이런', '이러한', '이와 같은', '요만큼', '요만한 것', '얼마 안 되는 것', '이만큼', '이 정도의', '이렇게 많은 것', '이와 같다', '이때', '이렇구나', '것과 같이', '끼익', '삐걱', '따위', '와 같은 사람들', '부류의 사람들', '왜냐하면', '중의하나', '오직', '오로지', '에 한하다', '하기만 하면', '도착하다', '까지 미치다', '도달하다', '정도에 이르다', '할 지경이다', '결과에 이르다', '관해서는', '여러분', '하고 있다', '한 후', '혼자', '자기', '자기집', '자신', '우에 종합한것과같이', '총적으로 보면', '총적으로 말하면', '총적으로', '대로 하다', '으로서', '참', '그만이다', '할 따름이다', '쿵', '탕탕', '쾅쾅', '둥둥', '봐', '봐라', '아이야', '아니', '와아', '응', '아이', '참나', '년', '월', '일', '령', '영', '일', '이', '삼', '사', '오', '육', '륙', '칠', '팔', '구', '이천육', '이천칠', '이천팔', '이천구', '하나', '둘', '셋', '넷', '다섯', '여섯', '일곱', '여덟', '아홉', '령', '영']

## 생성한 RDD 객체 Spark DataFrame 으로 변환하기

### Spark DataFrame
- DataFrame은 명명 된 열로 구성된 데이터 세트 
- 개념적으로는 관계형 데이터베이스의 테이블 또는 R / Python의 데이터 프레임과 동일하지만 내부적으로 더욱  최적화가 있음
- RDB Table처럼 Schema를 가지고 있고 RDB의 Table 연산이 가능
- 구조화 된 데이터 파일, Hive의 테이블, 외부 데이터베이스 또는 기존 RDD와 같은 다양한 소스 에서 구성 할 수 있늠 
- DataFrame API는 Scala, Java, Python 및 R 에서 사용할 수 있음
- SparkSQL을 통해 사용 가능

In [57]:
dept = [("Finance",10), 
        ("Marketing",20), 
        ("Sales",30), 
        ("IT",40) 
      ]
rdd = spark.sparkContext.parallelize(dept)
print(rdd.collect())

[('Finance', 10), ('Marketing', 20), ('Sales', 30), ('IT', 40)]

In [58]:
df = rdd.toDF()
df.printSchema()
df.show()

root
 |-- _1: string (nullable = true)
 |-- _2: long (nullable = true)

+---------+---+
|       _1| _2|
+---------+---+
|  Finance| 10|
|Marketing| 20|
|    Sales| 30|
|       IT| 40|
+---------+---+

In [59]:
deptColumns = ["dept_name","dept_id"]
df2 = rdd.toDF(deptColumns)
df2.printSchema()
df2.show(truncate=False)

root
 |-- dept_name: string (nullable = true)
 |-- dept_id: long (nullable = true)

+---------+-------+
|dept_name|dept_id|
+---------+-------+
|Finance  |10     |
|Marketing|20     |
|Sales    |30     |
|IT       |40     |
+---------+-------+

In [60]:
data = [('James','','Smith','1991-04-01','M',3000),
  ('Michael','Rose','','2000-05-19','M',4000),
  ('Robert','','Williams','1978-09-05','M',4000),
  ('Maria','Anne','Jones','1967-12-01','F',4000),
  ('Jen','Mary','Brown','1980-02-17','F',-1)
]

columns = ["firstname","middlename","lastname","dob","gender","salary"]
df = spark.createDataFrame(data=data, schema = columns)
print(type(df))
print(df)
df.printSchema()
df.show()

<class 'pyspark.sql.dataframe.DataFrame'>
DataFrame[firstname: string, middlename: string, lastname: string, dob: string, gender: string, salary: bigint]
root
 |-- firstname: string (nullable = true)
 |-- middlename: string (nullable = true)
 |-- lastname: string (nullable = true)
 |-- dob: string (nullable = true)
 |-- gender: string (nullable = true)
 |-- salary: long (nullable = true)

+---------+----------+--------+----------+------+------+
|firstname|middlename|lastname|       dob|gender|salary|
+---------+----------+--------+----------+------+------+
|    James|          |   Smith|1991-04-01|     M|  3000|
|  Michael|      Rose|        |2000-05-19|     M|  4000|
|   Robert|          |Williams|1978-09-05|     M|  4000|
|    Maria|      Anne|   Jones|1967-12-01|     F|  4000|
|      Jen|      Mary|   Brown|1980-02-17|     F|    -1|
+---------+----------+--------+----------+------+------+

In [61]:
from pyspark.sql.types import StructType,StructField, StringType, IntegerType
data2 = [("James","","Smith","36636","M",3000),
    ("Michael","Rose","","40288","M",4000),
    ("Robert","","Williams","42114","M",4000),
    ("Maria","Anne","Jones","39192","F",4000),
    ("Jen","Mary","Brown","","F",-1)
  ]

schema = StructType([ \
    StructField("firstname",StringType(),True), \
    StructField("middlename",StringType(),True), \
    StructField("lastname",StringType(),True), \
    StructField("id", StringType(), True), \
    StructField("gender", StringType(), True), \
    StructField("salary", IntegerType(), True) \
  ])
 
df = spark.createDataFrame(data=data2,schema=schema)
df.printSchema()
df.show(truncate=False)

root
 |-- firstname: string (nullable = true)
 |-- middlename: string (nullable = true)
 |-- lastname: string (nullable = true)
 |-- id: string (nullable = true)
 |-- gender: string (nullable = true)
 |-- salary: integer (nullable = true)

+---------+----------+--------+-----+------+------+
|firstname|middlename|lastname|id   |gender|salary|
+---------+----------+--------+-----+------+------+
|James    |          |Smith   |36636|M     |3000  |
|Michael  |Rose      |        |40288|M     |4000  |
|Robert   |          |Williams|42114|M     |4000  |
|Maria    |Anne      |Jones   |39192|F     |4000  |
|Jen      |Mary      |Brown   |     |F     |-1    |
+---------+----------+--------+-----+------+------+

## CSV 파일 내용 읽어서 DataFrame 객체 생성하기

In [62]:
df = spark.read.csv("data/emp.csv")
df.printSchema()
df.show()

root
 |-- _c0: string (nullable = true)
 |-- _c1: string (nullable = true)
 |-- _c2: string (nullable = true)
 |-- _c3: string (nullable = true)
 |-- _c4: string (nullable = true)
 |-- _c5: string (nullable = true)
 |-- _c6: string (nullable = true)
 |-- _c7: string (nullable = true)

+-----+------+---------+----+----------+----+----+------+
|  _c0|   _c1|      _c2| _c3|       _c4| _c5| _c6|   _c7|
+-----+------+---------+----+----------+----+----+------+
|empno| ename|      job| mgr|  hiredate| sal|comm|deptno|
| 7369| SMITH|    CLERK|7902|1980-12-17| 800|null|    20|
| 7499| ALLEN| SALESMAN|7698|1981-02-20|1600| 300|    30|
| 7521|  WARD| SALESMAN|7698|1981-02-03|1250| 500|    30|
| 7566| JONES|  MANAGER|7839|1981-03-02|2975|null|    20|
| 7654|MARTIN| SALESMAN|7698|1981-10-22|1250|1400|    30|
| 7698| BLAKE|  MANAGER|7839|1981-05-01|2850|null|    30|
| 7782| CLARK|  MANAGER|7839|1981-09-06|2450|null|    10|
| 7788| SCOTT|  ANALYST|7566|1982-12-08|3000|null|    20|
| 7839|  KING|PRESIDENT|null|1981-11-17|5000|null|    10|
| 7844|TURNER| SALESMAN|7698|1984-10-08|1500|null|    30|
| 7876| ADAMS|    CLERK|7788|1983-01-12|1100|null|    20|
| 7900| JAMES|    CLERK|7698|1981-12-03| 950|null|    30|
| 7902|  FORD|  ANALYST|7566|1981-12-13|3000|null|    20|
| 7934|MILLER|    CLERK|7782|1982-01-25|1300|null|    10|
+-----+------+---------+----+----------+----+----+------+

In [63]:
emp = spark.read.csv("data/emp.csv", header=True)
emp.printSchema()
emp.show()

root
 |-- empno: string (nullable = true)
 |-- ename: string (nullable = true)
 |-- job: string (nullable = true)
 |-- mgr: string (nullable = true)
 |-- hiredate: string (nullable = true)
 |-- sal: string (nullable = true)
 |-- comm: string (nullable = true)
 |-- deptno: string (nullable = true)

+-----+------+---------+----+----------+----+----+------+
|empno| ename|      job| mgr|  hiredate| sal|comm|deptno|
+-----+------+---------+----+----------+----+----+------+
| 7369| SMITH|    CLERK|7902|1980-12-17| 800|null|    20|
| 7499| ALLEN| SALESMAN|7698|1981-02-20|1600| 300|    30|
| 7521|  WARD| SALESMAN|7698|1981-02-03|1250| 500|    30|
| 7566| JONES|  MANAGER|7839|1981-03-02|2975|null|    20|
| 7654|MARTIN| SALESMAN|7698|1981-10-22|1250|1400|    30|
| 7698| BLAKE|  MANAGER|7839|1981-05-01|2850|null|    30|
| 7782| CLARK|  MANAGER|7839|1981-09-06|2450|null|    10|
| 7788| SCOTT|  ANALYST|7566|1982-12-08|3000|null|    20|
| 7839|  KING|PRESIDENT|null|1981-11-17|5000|null|    10|
| 7844|TURNER| SALESMAN|7698|1984-10-08|1500|null|    30|
| 7876| ADAMS|    CLERK|7788|1983-01-12|1100|null|    20|
| 7900| JAMES|    CLERK|7698|1981-12-03| 950|null|    30|
| 7902|  FORD|  ANALYST|7566|1981-12-13|3000|null|    20|
| 7934|MILLER|    CLERK|7782|1982-01-25|1300|null|    10|
+-----+------+---------+----+----------+----+----+------+

In [64]:
emp = spark.read.csv("data/emp.csv", header=True, inferSchema=True)
emp.printSchema()
emp.show()

root
 |-- empno: integer (nullable = true)
 |-- ename: string (nullable = true)
 |-- job: string (nullable = true)
 |-- mgr: integer (nullable = true)
 |-- hiredate: timestamp (nullable = true)
 |-- sal: integer (nullable = true)
 |-- comm: integer (nullable = true)
 |-- deptno: integer (nullable = true)

+-----+------+---------+----+-------------------+----+----+------+
|empno| ename|      job| mgr|           hiredate| sal|comm|deptno|
+-----+------+---------+----+-------------------+----+----+------+
| 7369| SMITH|    CLERK|7902|1980-12-17 00:00:00| 800|null|    20|
| 7499| ALLEN| SALESMAN|7698|1981-02-20 00:00:00|1600| 300|    30|
| 7521|  WARD| SALESMAN|7698|1981-02-03 00:00:00|1250| 500|    30|
| 7566| JONES|  MANAGER|7839|1981-03-02 00:00:00|2975|null|    20|
| 7654|MARTIN| SALESMAN|7698|1981-10-22 00:00:00|1250|1400|    30|
| 7698| BLAKE|  MANAGER|7839|1981-05-01 00:00:00|2850|null|    30|
| 7782| CLARK|  MANAGER|7839|1981-09-06 00:00:00|2450|null|    10|
| 7788| SCOTT|  ANALYST|7566|1982-12-08 00:00:00|3000|null|    20|
| 7839|  KING|PRESIDENT|null|1981-11-17 00:00:00|5000|null|    10|
| 7844|TURNER| SALESMAN|7698|1984-10-08 00:00:00|1500|null|    30|
| 7876| ADAMS|    CLERK|7788|1983-01-12 00:00:00|1100|null|    20|
| 7900| JAMES|    CLERK|7698|1981-12-03 00:00:00| 950|null|    30|
| 7902|  FORD|  ANALYST|7566|1981-12-13 00:00:00|3000|null|    20|
| 7934|MILLER|    CLERK|7782|1982-01-25 00:00:00|1300|null|    10|
+-----+------+---------+----+-------------------+----+----+------+

In [65]:
df = spark.read.csv("data/mpgdata.csv")
df.printSchema()
df.show()

root
 |-- _c0: string (nullable = true)
 |-- _c1: string (nullable = true)
 |-- _c2: string (nullable = true)
 |-- _c3: string (nullable = true)
 |-- _c4: string (nullable = true)
 |-- _c5: string (nullable = true)
 |-- _c6: string (nullable = true)

+---+---------+------------+----------+------+------------+----------+
|_c0|      _c1|         _c2|       _c3|   _c4|         _c5|       _c6|
+---+---------+------------+----------+------+------------+----------+
|mpg|cylinders|displacement|horsepower|weight|acceleration|model-year|
| 18|        8|         307|       130|  3504|          12|        70|
| 15|        8|         350|       165|  3693|        11.5|        70|
| 18|        8|         318|       150|  3436|          11|        70|
| 16|        8|         304|       150|  3433|          12|        70|
| 17|        8|         302|       140|  3449|        10.5|        70|
| 15|        8|         429|       198|  4341|          10|        70|
| 14|        8|         454|       220|  4354|           9|        70|
| 14|        8|         440|       215|  4312|         8.5|        70|
| 14|        8|         455|       225|  4425|          10|        70|
| 15|        8|         390|       190|  3850|         8.5|        70|
| 15|        8|         383|       170|  3563|          10|        70|
| 14|        8|         340|       160|  3609|           8|        70|
| 15|        8|         400|       150|  3761|         9.5|        70|
| 14|        8|         455|       225|  3086|          10|        70|
| 24|        4|         113|        95|  2372|          15|        70|
| 22|        6|         198|        95|  2833|        15.5|        70|
| 18|        6|         199|        97|  2774|        15.5|        70|
| 21|        6|         200|        85|  2587|          16|        70|
| 27|        4|          97|        88|  2130|        14.5|        70|
+---+---------+------------+----------+------+------------+----------+
only showing top 20 rows

In [66]:
df = spark.read.load("data/iris.csv",
                     format="csv", sep=",", inferSchema=True, header=True)
df.printSchema()
df.show()

root
 |-- sepal.length: double (nullable = true)
 |-- sepal.width: double (nullable = true)
 |-- petal.length: double (nullable = true)
 |-- petal.width: double (nullable = true)
 |-- variety: string (nullable = true)

+------------+-----------+------------+-----------+-------+
|sepal.length|sepal.width|petal.length|petal.width|variety|
+------------+-----------+------------+-----------+-------+
|         5.1|        3.5|         1.4|        0.2| Setosa|
|         4.9|        3.0|         1.4|        0.2| Setosa|
|         4.7|        3.2|         1.3|        0.2| Setosa|
|         4.6|        3.1|         1.5|        0.2| Setosa|
|         5.0|        3.6|         1.4|        0.2| Setosa|
|         5.4|        3.9|         1.7|        0.4| Setosa|
|         4.6|        3.4|         1.4|        0.3| Setosa|
|         5.0|        3.4|         1.5|        0.2| Setosa|
|         4.4|        2.9|         1.4|        0.2| Setosa|
|         4.9|        3.1|         1.5|        0.1| Setosa|
|         5.4|        3.7|         1.5|        0.2| Setosa|
|         4.8|        3.4|         1.6|        0.2| Setosa|
|         4.8|        3.0|         1.4|        0.1| Setosa|
|         4.3|        3.0|         1.1|        0.1| Setosa|
|         5.8|        4.0|         1.2|        0.2| Setosa|
|         5.7|        4.4|         1.5|        0.4| Setosa|
|         5.4|        3.9|         1.3|        0.4| Setosa|
|         5.1|        3.5|         1.4|        0.3| Setosa|
|         5.7|        3.8|         1.7|        0.3| Setosa|
|         5.1|        3.8|         1.5|        0.3| Setosa|
+------------+-----------+------------+-----------+-------+
only showing top 20 rows

## JSON 파일 내용 읽어서 DataFrame 객체 생성하기

In [67]:
df = spark.read.json("data/seoul_geo.json")
df.show()

+--------------------+--------------------+-----------------------+-------+
|     _corrupt_record|            geometry|             properties|   type|
+--------------------+--------------------+-----------------------+-------+
|                   {|                null|                   null|   null|
|"type": "FeatureC...|                null|                   null|   null|
|       "features": [|                null|                   null|   null|
|                null|[[[[127.115195849...|[2013, 11250, 강동구...|Feature|
|                null|[[[[127.069069813...|[2013, 11240, 송파구...|Feature|
|                null|[[[[127.058673592...|[2013, 11230, 강남구...|Feature|
|                null|[[[[127.013971196...|[2013, 11220, 서초구...|Feature|
|                null|[[[[126.961089890...|[2013, 11210, 관악구...|Feature|
|                null|[[[[126.982238079...|[2013, 11200, 동작구...|Feature|
|                null|[[[[126.891846638...|[2013, 11190, 영등포...|Feature|
|                null|[[[[126.901560941...|[2013, 11180, 금천구...|Feature|
|                null|[[[[126.826880815...|[2013, 11170, 구로구...|Feature|
|                null|[[[[126.795757686...|[2013, 11160, 강서구...|Feature|
|                null|[[[[126.824233142...|[2013, 11150, 양천구...|Feature|
|                null|[[[[126.905220658...|[2013, 11140, 마포구...|Feature|
|                null|[[[[126.952475203...|[2013, 11130, 서대문...|Feature|
|                null|[[[[126.954675858...|[2013, 11120, 은평구...|Feature|
|                null|[[[[127.083875270...|[2013, 11110, 노원구...|Feature|
|                null|[[[[127.052884797...|[2013, 11100, 도봉구...|Feature|
|                null|[[[[126.993839034...|[2013, 11090, 강북구...|Feature|
+--------------------+--------------------+-----------------------+-------+
only showing top 20 rows

In [68]:
df = spark.read.load("data/seoul_geo.json", format="json")
df.show()

+--------------------+--------------------+-----------------------+-------+
|     _corrupt_record|            geometry|             properties|   type|
+--------------------+--------------------+-----------------------+-------+
|                   {|                null|                   null|   null|
|"type": "FeatureC...|                null|                   null|   null|
|       "features": [|                null|                   null|   null|
|                null|[[[[127.115195849...|[2013, 11250, 강동구...|Feature|
|                null|[[[[127.069069813...|[2013, 11240, 송파구...|Feature|
|                null|[[[[127.058673592...|[2013, 11230, 강남구...|Feature|
|                null|[[[[127.013971196...|[2013, 11220, 서초구...|Feature|
|                null|[[[[126.961089890...|[2013, 11210, 관악구...|Feature|
|                null|[[[[126.982238079...|[2013, 11200, 동작구...|Feature|
|                null|[[[[126.891846638...|[2013, 11190, 영등포...|Feature|
|                null|[[[[126.901560941...|[2013, 11180, 금천구...|Feature|
|                null|[[[[126.826880815...|[2013, 11170, 구로구...|Feature|
|                null|[[[[126.795757686...|[2013, 11160, 강서구...|Feature|
|                null|[[[[126.824233142...|[2013, 11150, 양천구...|Feature|
|                null|[[[[126.905220658...|[2013, 11140, 마포구...|Feature|
|                null|[[[[126.952475203...|[2013, 11130, 서대문...|Feature|
|                null|[[[[126.954675858...|[2013, 11120, 은평구...|Feature|
|                null|[[[[127.083875270...|[2013, 11110, 노원구...|Feature|
|                null|[[[[127.052884797...|[2013, 11100, 도봉구...|Feature|
|                null|[[[[126.993839034...|[2013, 11090, 강북구...|Feature|
+--------------------+--------------------+-----------------------+-------+
only showing top 20 rows

## 파케이 파일 내용 읽어서 DataFrame 객체 생성하기

In [69]:
df = spark.read.load("data/userdata1.parquet")
df = df.select("first_name", "last_name", "email")
df.show()

+----------+---------+--------------------+
|first_name|last_name|               email|
+----------+---------+--------------------+
|    Amanda|   Jordan|    ajordan0@com.com|
|    Albert|  Freeman|     afreeman1@is.gd|
|    Evelyn|   Morgan|emorgan2@altervis...|
|    Denise|    Riley|    driley3@gmpg.org|
|    Carlos|    Burns|cburns4@miitbeian...|
|   Kathryn|    White|  kwhite5@google.com|
|    Samuel|   Holmes|sholmes6@foxnews.com|
|     Harry|   Howell| hhowell7@eepurl.com|
|      Jose|   Foster|   jfoster8@yelp.com|
|     Emily|  Stewart|estewart9@opensou...|
|     Susan|  Perkins| sperkinsa@patch.com|
|     Alice|    Berry|aberryb@wikipedia...|
|    Justin|    Berry|jberryc@usatoday.com|
|     Kathy| Reynolds|kreynoldsd@redcro...|
|   Dorothy|   Hudson|dhudsone@blogger.com|
|     Bruce|   Willis|bwillisf@bluehost...|
|     Emily|  Andrews|eandrewsg@cornell...|
|   Stephen|  Wallace|swallaceh@netvibe...|
|  Clarence|   Lawson|clawsoni@vkontakt...|
|   Rebecca|     Bell| rbellj@bandcamp.com|
+----------+---------+--------------------+
only showing top 20 rows

## 직접 만든 DataFrame 객체 생성하여 정보 출력하기

In [70]:
data = [("James","","Smith","36636","M",60000),
        ("Michael","Rose","","40288","M",70000),
        ("Robert","","Williams","42114","",400000),
        ("Maria","Anne","Jones","39192","F",500000),
        ("Jen","Mary","Brown","","F",0)]

columns = ["first_name","middle_name","last_name","dob","gender","salary"]
pysparkDF = spark.createDataFrame(data = data, schema = columns)
pysparkDF.printSchema()
pysparkDF.show(truncate=False)

root
 |-- first_name: string (nullable = true)
 |-- middle_name: string (nullable = true)
 |-- last_name: string (nullable = true)
 |-- dob: string (nullable = true)
 |-- gender: string (nullable = true)
 |-- salary: long (nullable = true)

+----------+-----------+---------+-----+------+------+
|first_name|middle_name|last_name|dob  |gender|salary|
+----------+-----------+---------+-----+------+------+
|James     |           |Smith    |36636|M     |60000 |
|Michael   |Rose       |         |40288|M     |70000 |
|Robert    |           |Williams |42114|      |400000|
|Maria     |Anne       |Jones    |39192|F     |500000|
|Jen       |Mary       |Brown    |     |F     |0     |
+----------+-----------+---------+-----+------+------+

## Spark의 DataFrame 객체를 Pandas의 DataFrame 객체로 변환하기

In [71]:
pandasDF = pysparkDF.toPandas()
print(type(pandasDF))
print(pandasDF)

<class 'pandas.core.frame.DataFrame'>
  first_name middle_name last_name    dob gender  salary
0      James                 Smith  36636      M   60000
1    Michael        Rose            40288      M   70000
2     Robert              Williams  42114         400000
3      Maria        Anne     Jones  39192      F  500000
4        Jen        Mary     Brown             F       0

## select()

In [72]:
emp1 = emp.select("empno", "ename", "hiredate", "sal")
print(type(emp1))
emp1.show()

<class 'pyspark.sql.dataframe.DataFrame'>
+-----+------+-------------------+----+
|empno| ename|           hiredate| sal|
+-----+------+-------------------+----+
| 7369| SMITH|1980-12-17 00:00:00| 800|
| 7499| ALLEN|1981-02-20 00:00:00|1600|
| 7521|  WARD|1981-02-03 00:00:00|1250|
| 7566| JONES|1981-03-02 00:00:00|2975|
| 7654|MARTIN|1981-10-22 00:00:00|1250|
| 7698| BLAKE|1981-05-01 00:00:00|2850|
| 7782| CLARK|1981-09-06 00:00:00|2450|
| 7788| SCOTT|1982-12-08 00:00:00|3000|
| 7839|  KING|1981-11-17 00:00:00|5000|
| 7844|TURNER|1984-10-08 00:00:00|1500|
| 7876| ADAMS|1983-01-12 00:00:00|1100|
| 7900| JAMES|1981-12-03 00:00:00| 950|
| 7902|  FORD|1981-12-13 00:00:00|3000|
| 7934|MILLER|1982-01-25 00:00:00|1300|
+-----+------+-------------------+----+

In [73]:
emp.select(emp.empno,emp.ename,emp.hiredate, emp.sal).show()

+-----+------+-------------------+----+
|empno| ename|           hiredate| sal|
+-----+------+-------------------+----+
| 7369| SMITH|1980-12-17 00:00:00| 800|
| 7499| ALLEN|1981-02-20 00:00:00|1600|
| 7521|  WARD|1981-02-03 00:00:00|1250|
| 7566| JONES|1981-03-02 00:00:00|2975|
| 7654|MARTIN|1981-10-22 00:00:00|1250|
| 7698| BLAKE|1981-05-01 00:00:00|2850|
| 7782| CLARK|1981-09-06 00:00:00|2450|
| 7788| SCOTT|1982-12-08 00:00:00|3000|
| 7839|  KING|1981-11-17 00:00:00|5000|
| 7844|TURNER|1984-10-08 00:00:00|1500|
| 7876| ADAMS|1983-01-12 00:00:00|1100|
| 7900| JAMES|1981-12-03 00:00:00| 950|
| 7902|  FORD|1981-12-13 00:00:00|3000|
| 7934|MILLER|1982-01-25 00:00:00|1300|
+-----+------+-------------------+----+

In [74]:
from pyspark.sql.functions import col
emp.select(col("empno"),col("ename"),col("hiredate"),col("sal")).show()

+-----+------+-------------------+----+
|empno| ename|           hiredate| sal|
+-----+------+-------------------+----+
| 7369| SMITH|1980-12-17 00:00:00| 800|
| 7499| ALLEN|1981-02-20 00:00:00|1600|
| 7521|  WARD|1981-02-03 00:00:00|1250|
| 7566| JONES|1981-03-02 00:00:00|2975|
| 7654|MARTIN|1981-10-22 00:00:00|1250|
| 7698| BLAKE|1981-05-01 00:00:00|2850|
| 7782| CLARK|1981-09-06 00:00:00|2450|
| 7788| SCOTT|1982-12-08 00:00:00|3000|
| 7839|  KING|1981-11-17 00:00:00|5000|
| 7844|TURNER|1984-10-08 00:00:00|1500|
| 7876| ADAMS|1983-01-12 00:00:00|1100|
| 7900| JAMES|1981-12-03 00:00:00| 950|
| 7902|  FORD|1981-12-13 00:00:00|3000|
| 7934|MILLER|1982-01-25 00:00:00|1300|
+-----+------+-------------------+----+

## collect()

In [75]:
dataCollect = emp.collect()
print(type(dataCollect))
print("----------------------------")
print(dataCollect)
print("----------------------------")
display(dataCollect)

<class 'list'>
----------------------------
[Row(empno=7369, ename='SMITH', job='CLERK', mgr=7902, hiredate=datetime.datetime(1980, 12, 17, 0, 0), sal=800, comm=None, deptno=20), Row(empno=7499, ename='ALLEN', job='SALESMAN', mgr=7698, hiredate=datetime.datetime(1981, 2, 20, 0, 0), sal=1600, comm=300, deptno=30), Row(empno=7521, ename='WARD', job='SALESMAN', mgr=7698, hiredate=datetime.datetime(1981, 2, 3, 0, 0), sal=1250, comm=500, deptno=30), Row(empno=7566, ename='JONES', job='MANAGER', mgr=7839, hiredate=datetime.datetime(1981, 3, 2, 0, 0), sal=2975, comm=None, deptno=20), Row(empno=7654, ename='MARTIN', job='SALESMAN', mgr=7698, hiredate=datetime.datetime(1981, 10, 22, 0, 0), sal=1250, comm=1400, deptno=30), Row(empno=7698, ename='BLAKE', job='MANAGER', mgr=7839, hiredate=datetime.datetime(1981, 5, 1, 0, 0), sal=2850, comm=None, deptno=30), Row(empno=7782, ename='CLARK', job='MANAGER', mgr=7839, hiredate=datetime.datetime(1981, 9, 6, 0, 0), sal=2450, comm=None, deptno=10), Row(empno=7788, ename='SCOTT', job='ANALYST', mgr=7566, hiredate=datetime.datetime(1982, 12, 8, 0, 0), sal=3000, comm=None, deptno=20), Row(empno=7839, ename='KING', job='PRESIDENT', mgr=None, hiredate=datetime.datetime(1981, 11, 17, 0, 0), sal=5000, comm=None, deptno=10), Row(empno=7844, ename='TURNER', job='SALESMAN', mgr=7698, hiredate=datetime.datetime(1984, 10, 8, 0, 0), sal=1500, comm=None, deptno=30), Row(empno=7876, ename='ADAMS', job='CLERK', mgr=7788, hiredate=datetime.datetime(1983, 1, 12, 0, 0), sal=1100, comm=None, deptno=20), Row(empno=7900, ename='JAMES', job='CLERK', mgr=7698, hiredate=datetime.datetime(1981, 12, 3, 0, 0), sal=950, comm=None, deptno=30), Row(empno=7902, ename='FORD', job='ANALYST', mgr=7566, hiredate=datetime.datetime(1981, 12, 13, 0, 0), sal=3000, comm=None, deptno=20), Row(empno=7934, ename='MILLER', job='CLERK', mgr=7782, hiredate=datetime.datetime(1982, 1, 25, 0, 0), sal=1300, comm=None, deptno=10)]
----------------------------

[Row(empno=7369, ename='SMITH', job='CLERK', mgr=7902, hiredate=datetime.datetime(1980, 12, 17, 0, 0), sal=800, comm=None, deptno=20),
 Row(empno=7499, ename='ALLEN', job='SALESMAN', mgr=7698, hiredate=datetime.datetime(1981, 2, 20, 0, 0), sal=1600, comm=300, deptno=30),
 Row(empno=7521, ename='WARD', job='SALESMAN', mgr=7698, hiredate=datetime.datetime(1981, 2, 3, 0, 0), sal=1250, comm=500, deptno=30),
 Row(empno=7566, ename='JONES', job='MANAGER', mgr=7839, hiredate=datetime.datetime(1981, 3, 2, 0, 0), sal=2975, comm=None, deptno=20),
 Row(empno=7654, ename='MARTIN', job='SALESMAN', mgr=7698, hiredate=datetime.datetime(1981, 10, 22, 0, 0), sal=1250, comm=1400, deptno=30),
 Row(empno=7698, ename='BLAKE', job='MANAGER', mgr=7839, hiredate=datetime.datetime(1981, 5, 1, 0, 0), sal=2850, comm=None, deptno=30),
 Row(empno=7782, ename='CLARK', job='MANAGER', mgr=7839, hiredate=datetime.datetime(1981, 9, 6, 0, 0), sal=2450, comm=None, deptno=10),
 Row(empno=7788, ename='SCOTT', job='ANALYST', mgr=7566, hiredate=datetime.datetime(1982, 12, 8, 0, 0), sal=3000, comm=None, deptno=20),
 Row(empno=7839, ename='KING', job='PRESIDENT', mgr=None, hiredate=datetime.datetime(1981, 11, 17, 0, 0), sal=5000, comm=None, deptno=10),
 Row(empno=7844, ename='TURNER', job='SALESMAN', mgr=7698, hiredate=datetime.datetime(1984, 10, 8, 0, 0), sal=1500, comm=None, deptno=30),
 Row(empno=7876, ename='ADAMS', job='CLERK', mgr=7788, hiredate=datetime.datetime(1983, 1, 12, 0, 0), sal=1100, comm=None, deptno=20),
 Row(empno=7900, ename='JAMES', job='CLERK', mgr=7698, hiredate=datetime.datetime(1981, 12, 3, 0, 0), sal=950, comm=None, deptno=30),
 Row(empno=7902, ename='FORD', job='ANALYST', mgr=7566, hiredate=datetime.datetime(1981, 12, 13, 0, 0), sal=3000, comm=None, deptno=20),
 Row(empno=7934, ename='MILLER', job='CLERK', mgr=7782, hiredate=datetime.datetime(1982, 1, 25, 0, 0), sal=1300, comm=None, deptno=10)]

In [76]:
emp.printSchema()

root
 |-- empno: integer (nullable = true)
 |-- ename: string (nullable = true)
 |-- job: string (nullable = true)
 |-- mgr: integer (nullable = true)
 |-- hiredate: timestamp (nullable = true)
 |-- sal: integer (nullable = true)
 |-- comm: integer (nullable = true)
 |-- deptno: integer (nullable = true)

## withColumn()

In [77]:
newemp = emp.withColumn("deptno",col("deptno").cast("Integer"))
newemp.printSchema()

root
 |-- empno: integer (nullable = true)
 |-- ename: string (nullable = true)
 |-- job: string (nullable = true)
 |-- mgr: integer (nullable = true)
 |-- hiredate: timestamp (nullable = true)
 |-- sal: integer (nullable = true)
 |-- comm: integer (nullable = true)
 |-- deptno: integer (nullable = true)

In [78]:
newemp = newemp.withColumn("sal",col("sal")*100)
newemp.show()

+-----+------+---------+----+-------------------+------+----+------+
|empno| ename|      job| mgr|           hiredate|   sal|comm|deptno|
+-----+------+---------+----+-------------------+------+----+------+
| 7369| SMITH|    CLERK|7902|1980-12-17 00:00:00| 80000|null|    20|
| 7499| ALLEN| SALESMAN|7698|1981-02-20 00:00:00|160000| 300|    30|
| 7521|  WARD| SALESMAN|7698|1981-02-03 00:00:00|125000| 500|    30|
| 7566| JONES|  MANAGER|7839|1981-03-02 00:00:00|297500|null|    20|
| 7654|MARTIN| SALESMAN|7698|1981-10-22 00:00:00|125000|1400|    30|
| 7698| BLAKE|  MANAGER|7839|1981-05-01 00:00:00|285000|null|    30|
| 7782| CLARK|  MANAGER|7839|1981-09-06 00:00:00|245000|null|    10|
| 7788| SCOTT|  ANALYST|7566|1982-12-08 00:00:00|300000|null|    20|
| 7839|  KING|PRESIDENT|null|1981-11-17 00:00:00|500000|null|    10|
| 7844|TURNER| SALESMAN|7698|1984-10-08 00:00:00|150000|null|    30|
| 7876| ADAMS|    CLERK|7788|1983-01-12 00:00:00|110000|null|    20|
| 7900| JAMES|    CLERK|7698|1981-12-03 00:00:00| 95000|null|    30|
| 7902|  FORD|  ANALYST|7566|1981-12-13 00:00:00|300000|null|    20|
| 7934|MILLER|    CLERK|7782|1982-01-25 00:00:00|130000|null|    10|
+-----+------+---------+----+-------------------+------+----+------+

## withColumnRenamed()

In [79]:
newemp = newemp.withColumnRenamed("sal","salary")
newemp.show()

+-----+------+---------+----+-------------------+------+----+------+
|empno| ename|      job| mgr|           hiredate|salary|comm|deptno|
+-----+------+---------+----+-------------------+------+----+------+
| 7369| SMITH|    CLERK|7902|1980-12-17 00:00:00| 80000|null|    20|
| 7499| ALLEN| SALESMAN|7698|1981-02-20 00:00:00|160000| 300|    30|
| 7521|  WARD| SALESMAN|7698|1981-02-03 00:00:00|125000| 500|    30|
| 7566| JONES|  MANAGER|7839|1981-03-02 00:00:00|297500|null|    20|
| 7654|MARTIN| SALESMAN|7698|1981-10-22 00:00:00|125000|1400|    30|
| 7698| BLAKE|  MANAGER|7839|1981-05-01 00:00:00|285000|null|    30|
| 7782| CLARK|  MANAGER|7839|1981-09-06 00:00:00|245000|null|    10|
| 7788| SCOTT|  ANALYST|7566|1982-12-08 00:00:00|300000|null|    20|
| 7839|  KING|PRESIDENT|null|1981-11-17 00:00:00|500000|null|    10|
| 7844|TURNER| SALESMAN|7698|1984-10-08 00:00:00|150000|null|    30|
| 7876| ADAMS|    CLERK|7788|1983-01-12 00:00:00|110000|null|    20|
| 7900| JAMES|    CLERK|7698|1981-12-03 00:00:00| 95000|null|    30|
| 7902|  FORD|  ANALYST|7566|1981-12-13 00:00:00|300000|null|    20|
| 7934|MILLER|    CLERK|7782|1982-01-25 00:00:00|130000|null|    10|
+-----+------+---------+----+-------------------+------+----+------+

In [80]:
newemp = newemp.withColumnRenamed("mgr","manager") \
    .withColumnRenamed("ename","empname")
newemp.show()

+-----+-------+---------+-------+-------------------+------+----+------+
|empno|empname|      job|manager|           hiredate|salary|comm|deptno|
+-----+-------+---------+-------+-------------------+------+----+------+
| 7369|  SMITH|    CLERK|   7902|1980-12-17 00:00:00| 80000|null|    20|
| 7499|  ALLEN| SALESMAN|   7698|1981-02-20 00:00:00|160000| 300|    30|
| 7521|   WARD| SALESMAN|   7698|1981-02-03 00:00:00|125000| 500|    30|
| 7566|  JONES|  MANAGER|   7839|1981-03-02 00:00:00|297500|null|    20|
| 7654| MARTIN| SALESMAN|   7698|1981-10-22 00:00:00|125000|1400|    30|
| 7698|  BLAKE|  MANAGER|   7839|1981-05-01 00:00:00|285000|null|    30|
| 7782|  CLARK|  MANAGER|   7839|1981-09-06 00:00:00|245000|null|    10|
| 7788|  SCOTT|  ANALYST|   7566|1982-12-08 00:00:00|300000|null|    20|
| 7839|   KING|PRESIDENT|   null|1981-11-17 00:00:00|500000|null|    10|
| 7844| TURNER| SALESMAN|   7698|1984-10-08 00:00:00|150000|null|    30|
| 7876|  ADAMS|    CLERK|   7788|1983-01-12 00:00:00|110000|null|    20|
| 7900|  JAMES|    CLERK|   7698|1981-12-03 00:00:00| 95000|null|    30|
| 7902|   FORD|  ANALYST|   7566|1981-12-13 00:00:00|300000|null|    20|
| 7934| MILLER|    CLERK|   7782|1982-01-25 00:00:00|130000|null|    10|
+-----+-------+---------+-------+-------------------+------+----+------+

## filter() - where() 와 동일

In [81]:
emp.filter(emp.ename == "KING").show(truncate=False)

+-----+-----+---------+----+-------------------+----+----+------+
|empno|ename|job      |mgr |hiredate           |sal |comm|deptno|
+-----+-----+---------+----+-------------------+----+----+------+
|7839 |KING |PRESIDENT|null|1981-11-17 00:00:00|5000|null|10    |
+-----+-----+---------+----+-------------------+----+----+------+

In [82]:
emp.filter('ename == "KING"').show(truncate=False)

+-----+-----+---------+----+-------------------+----+----+------+
|empno|ename|job      |mgr |hiredate           |sal |comm|deptno|
+-----+-----+---------+----+-------------------+----+----+------+
|7839 |KING |PRESIDENT|null|1981-11-17 00:00:00|5000|null|10    |
+-----+-----+---------+----+-------------------+----+----+------+

In [83]:
emp.filter((emp.deptno == 30) & (emp.sal >= 1500)).show(truncate=False)

+-----+------+--------+----+-------------------+----+----+------+
|empno|ename |job     |mgr |hiredate           |sal |comm|deptno|
+-----+------+--------+----+-------------------+----+----+------+
|7499 |ALLEN |SALESMAN|7698|1981-02-20 00:00:00|1600|300 |30    |
|7698 |BLAKE |MANAGER |7839|1981-05-01 00:00:00|2850|null|30    |
|7844 |TURNER|SALESMAN|7698|1984-10-08 00:00:00|1500|null|30    |
+-----+------+--------+----+-------------------+----+----+------+

In [84]:
emp.where((emp.deptno == 30) & (emp.sal >= 1500)).show(truncate=False)

+-----+------+--------+----+-------------------+----+----+------+
|empno|ename |job     |mgr |hiredate           |sal |comm|deptno|
+-----+------+--------+----+-------------------+----+----+------+
|7499 |ALLEN |SALESMAN|7698|1981-02-20 00:00:00|1600|300 |30    |
|7698 |BLAKE |MANAGER |7839|1981-05-01 00:00:00|2850|null|30    |
|7844 |TURNER|SALESMAN|7698|1984-10-08 00:00:00|1500|null|30    |
+-----+------+--------+----+-------------------+----+----+------+

## distinct(), drop (), dropDuplicates ()

In [85]:
empnew = emp.select("job", "deptno")
empnew.show()

+---------+------+
|      job|deptno|
+---------+------+
|    CLERK|    20|
| SALESMAN|    30|
| SALESMAN|    30|
|  MANAGER|    20|
| SALESMAN|    30|
|  MANAGER|    30|
|  MANAGER|    10|
|  ANALYST|    20|
|PRESIDENT|    10|
| SALESMAN|    30|
|    CLERK|    20|
|    CLERK|    30|
|  ANALYST|    20|
|    CLERK|    10|
+---------+------+

In [86]:
empnew.distinct().show()

+---------+------+
|      job|deptno|
+---------+------+
|  ANALYST|    20|
|  MANAGER|    10|
|  MANAGER|    30|
|PRESIDENT|    10|
|    CLERK|    20|
| SALESMAN|    30|
|    CLERK|    10|
|  MANAGER|    20|
|    CLERK|    30|
+---------+------+

In [87]:
empnew.dropDuplicates().show()

+---------+------+
|      job|deptno|
+---------+------+
|  ANALYST|    20|
|  MANAGER|    10|
|  MANAGER|    30|
|PRESIDENT|    10|
|    CLERK|    20|
| SALESMAN|    30|
|    CLERK|    10|
|  MANAGER|    20|
|    CLERK|    30|
+---------+------+

In [88]:
empnew.drop("deptno").show()

+---------+
|      job|
+---------+
|    CLERK|
| SALESMAN|
| SALESMAN|
|  MANAGER|
| SALESMAN|
|  MANAGER|
|  MANAGER|
|  ANALYST|
|PRESIDENT|
| SALESMAN|
|    CLERK|
|    CLERK|
|  ANALYST|
|    CLERK|
+---------+

## orderBy(), sort()

In [89]:
emp.sort("sal").show(truncate=False)

+-----+------+---------+----+-------------------+----+----+------+
|empno|ename |job      |mgr |hiredate           |sal |comm|deptno|
+-----+------+---------+----+-------------------+----+----+------+
|7369 |SMITH |CLERK    |7902|1980-12-17 00:00:00|800 |null|20    |
|7900 |JAMES |CLERK    |7698|1981-12-03 00:00:00|950 |null|30    |
|7876 |ADAMS |CLERK    |7788|1983-01-12 00:00:00|1100|null|20    |
|7654 |MARTIN|SALESMAN |7698|1981-10-22 00:00:00|1250|1400|30    |
|7521 |WARD  |SALESMAN |7698|1981-02-03 00:00:00|1250|500 |30    |
|7934 |MILLER|CLERK    |7782|1982-01-25 00:00:00|1300|null|10    |
|7844 |TURNER|SALESMAN |7698|1984-10-08 00:00:00|1500|null|30    |
|7499 |ALLEN |SALESMAN |7698|1981-02-20 00:00:00|1600|300 |30    |
|7782 |CLARK |MANAGER  |7839|1981-09-06 00:00:00|2450|null|10    |
|7698 |BLAKE |MANAGER  |7839|1981-05-01 00:00:00|2850|null|30    |
|7566 |JONES |MANAGER  |7839|1981-03-02 00:00:00|2975|null|20    |
|7788 |SCOTT |ANALYST  |7566|1982-12-08 00:00:00|3000|null|20    |
|7902 |FORD  |ANALYST  |7566|1981-12-13 00:00:00|3000|null|20    |
|7839 |KING  |PRESIDENT|null|1981-11-17 00:00:00|5000|null|10    |
+-----+------+---------+----+-------------------+----+----+------+

In [90]:
emp.sort(emp.sal.desc()).show(truncate=False)

+-----+------+---------+----+-------------------+----+----+------+
|empno|ename |job      |mgr |hiredate           |sal |comm|deptno|
+-----+------+---------+----+-------------------+----+----+------+
|7839 |KING  |PRESIDENT|null|1981-11-17 00:00:00|5000|null|10    |
|7788 |SCOTT |ANALYST  |7566|1982-12-08 00:00:00|3000|null|20    |
|7902 |FORD  |ANALYST  |7566|1981-12-13 00:00:00|3000|null|20    |
|7566 |JONES |MANAGER  |7839|1981-03-02 00:00:00|2975|null|20    |
|7698 |BLAKE |MANAGER  |7839|1981-05-01 00:00:00|2850|null|30    |
|7782 |CLARK |MANAGER  |7839|1981-09-06 00:00:00|2450|null|10    |
|7499 |ALLEN |SALESMAN |7698|1981-02-20 00:00:00|1600|300 |30    |
|7844 |TURNER|SALESMAN |7698|1984-10-08 00:00:00|1500|null|30    |
|7934 |MILLER|CLERK    |7782|1982-01-25 00:00:00|1300|null|10    |
|7654 |MARTIN|SALESMAN |7698|1981-10-22 00:00:00|1250|1400|30    |
|7521 |WARD  |SALESMAN |7698|1981-02-03 00:00:00|1250|500 |30    |
|7876 |ADAMS |CLERK    |7788|1983-01-12 00:00:00|1100|null|20    |
|7900 |JAMES |CLERK    |7698|1981-12-03 00:00:00|950 |null|30    |
|7369 |SMITH |CLERK    |7902|1980-12-17 00:00:00|800 |null|20    |
+-----+------+---------+----+-------------------+----+----+------+

In [91]:
emp.sort("deptno", "sal").show(truncate=False)

+-----+------+---------+----+-------------------+----+----+------+
|empno|ename |job      |mgr |hiredate           |sal |comm|deptno|
+-----+------+---------+----+-------------------+----+----+------+
|7934 |MILLER|CLERK    |7782|1982-01-25 00:00:00|1300|null|10    |
|7782 |CLARK |MANAGER  |7839|1981-09-06 00:00:00|2450|null|10    |
|7839 |KING  |PRESIDENT|null|1981-11-17 00:00:00|5000|null|10    |
|7369 |SMITH |CLERK    |7902|1980-12-17 00:00:00|800 |null|20    |
|7876 |ADAMS |CLERK    |7788|1983-01-12 00:00:00|1100|null|20    |
|7566 |JONES |MANAGER  |7839|1981-03-02 00:00:00|2975|null|20    |
|7902 |FORD  |ANALYST  |7566|1981-12-13 00:00:00|3000|null|20    |
|7788 |SCOTT |ANALYST  |7566|1982-12-08 00:00:00|3000|null|20    |
|7900 |JAMES |CLERK    |7698|1981-12-03 00:00:00|950 |null|30    |
|7654 |MARTIN|SALESMAN |7698|1981-10-22 00:00:00|1250|1400|30    |
|7521 |WARD  |SALESMAN |7698|1981-02-03 00:00:00|1250|500 |30    |
|7844 |TURNER|SALESMAN |7698|1984-10-08 00:00:00|1500|null|30    |
|7499 |ALLEN |SALESMAN |7698|1981-02-20 00:00:00|1600|300 |30    |
|7698 |BLAKE |MANAGER  |7839|1981-05-01 00:00:00|2850|null|30    |
+-----+------+---------+----+-------------------+----+----+------+

In [92]:
emp.sort(emp.deptno.desc(), emp.sal.desc()).show(truncate=False)

+-----+------+---------+----+-------------------+----+----+------+
|empno|ename |job      |mgr |hiredate           |sal |comm|deptno|
+-----+------+---------+----+-------------------+----+----+------+
|7698 |BLAKE |MANAGER  |7839|1981-05-01 00:00:00|2850|null|30    |
|7499 |ALLEN |SALESMAN |7698|1981-02-20 00:00:00|1600|300 |30    |
|7844 |TURNER|SALESMAN |7698|1984-10-08 00:00:00|1500|null|30    |
|7654 |MARTIN|SALESMAN |7698|1981-10-22 00:00:00|1250|1400|30    |
|7521 |WARD  |SALESMAN |7698|1981-02-03 00:00:00|1250|500 |30    |
|7900 |JAMES |CLERK    |7698|1981-12-03 00:00:00|950 |null|30    |
|7902 |FORD  |ANALYST  |7566|1981-12-13 00:00:00|3000|null|20    |
|7788 |SCOTT |ANALYST  |7566|1982-12-08 00:00:00|3000|null|20    |
|7566 |JONES |MANAGER  |7839|1981-03-02 00:00:00|2975|null|20    |
|7876 |ADAMS |CLERK    |7788|1983-01-12 00:00:00|1100|null|20    |
|7369 |SMITH |CLERK    |7902|1980-12-17 00:00:00|800 |null|20    |
|7839 |KING  |PRESIDENT|null|1981-11-17 00:00:00|5000|null|10    |
|7782 |CLARK |MANAGER  |7839|1981-09-06 00:00:00|2450|null|10    |
|7934 |MILLER|CLERK    |7782|1982-01-25 00:00:00|1300|null|10    |
+-----+------+---------+----+-------------------+----+----+------+

In [93]:
emp.orderBy(emp.deptno.desc(), emp.sal.desc()).show(truncate=False)

+-----+------+---------+----+-------------------+----+----+------+
|empno|ename |job      |mgr |hiredate           |sal |comm|deptno|
+-----+------+---------+----+-------------------+----+----+------+
|7698 |BLAKE |MANAGER  |7839|1981-05-01 00:00:00|2850|null|30    |
|7499 |ALLEN |SALESMAN |7698|1981-02-20 00:00:00|1600|300 |30    |
|7844 |TURNER|SALESMAN |7698|1984-10-08 00:00:00|1500|null|30    |
|7654 |MARTIN|SALESMAN |7698|1981-10-22 00:00:00|1250|1400|30    |
|7521 |WARD  |SALESMAN |7698|1981-02-03 00:00:00|1250|500 |30    |
|7900 |JAMES |CLERK    |7698|1981-12-03 00:00:00|950 |null|30    |
|7902 |FORD  |ANALYST  |7566|1981-12-13 00:00:00|3000|null|20    |
|7788 |SCOTT |ANALYST  |7566|1982-12-08 00:00:00|3000|null|20    |
|7566 |JONES |MANAGER  |7839|1981-03-02 00:00:00|2975|null|20    |
|7876 |ADAMS |CLERK    |7788|1983-01-12 00:00:00|1100|null|20    |
|7369 |SMITH |CLERK    |7902|1980-12-17 00:00:00|800 |null|20    |
|7839 |KING  |PRESIDENT|null|1981-11-17 00:00:00|5000|null|10    |
|7782 |CLARK |MANAGER  |7839|1981-09-06 00:00:00|2450|null|10    |
|7934 |MILLER|CLERK    |7782|1982-01-25 00:00:00|1300|null|10    |
+-----+------+---------+----+-------------------+----+----+------+

In [94]:
emp.sort(col("hiredate").asc(),col("sal").asc()).show(truncate=False)
emp.orderBy(col("hiredate").asc(),col("sal").asc()).show(truncate=False)

+-----+------+---------+----+-------------------+----+----+------+
|empno|ename |job      |mgr |hiredate           |sal |comm|deptno|
+-----+------+---------+----+-------------------+----+----+------+
|7369 |SMITH |CLERK    |7902|1980-12-17 00:00:00|800 |null|20    |
|7521 |WARD  |SALESMAN |7698|1981-02-03 00:00:00|1250|500 |30    |
|7499 |ALLEN |SALESMAN |7698|1981-02-20 00:00:00|1600|300 |30    |
|7566 |JONES |MANAGER  |7839|1981-03-02 00:00:00|2975|null|20    |
|7698 |BLAKE |MANAGER  |7839|1981-05-01 00:00:00|2850|null|30    |
|7782 |CLARK |MANAGER  |7839|1981-09-06 00:00:00|2450|null|10    |
|7654 |MARTIN|SALESMAN |7698|1981-10-22 00:00:00|1250|1400|30    |
|7839 |KING  |PRESIDENT|null|1981-11-17 00:00:00|5000|null|10    |
|7900 |JAMES |CLERK    |7698|1981-12-03 00:00:00|950 |null|30    |
|7902 |FORD  |ANALYST  |7566|1981-12-13 00:00:00|3000|null|20    |
|7934 |MILLER|CLERK    |7782|1982-01-25 00:00:00|1300|null|10    |
|7788 |SCOTT |ANALYST  |7566|1982-12-08 00:00:00|3000|null|20    |
|7876 |ADAMS |CLERK    |7788|1983-01-12 00:00:00|1100|null|20    |
|7844 |TURNER|SALESMAN |7698|1984-10-08 00:00:00|1500|null|30    |
+-----+------+---------+----+-------------------+----+----+------+

+-----+------+---------+----+-------------------+----+----+------+
|empno|ename |job      |mgr |hiredate           |sal |comm|deptno|
+-----+------+---------+----+-------------------+----+----+------+
|7369 |SMITH |CLERK    |7902|1980-12-17 00:00:00|800 |null|20    |
|7521 |WARD  |SALESMAN |7698|1981-02-03 00:00:00|1250|500 |30    |
|7499 |ALLEN |SALESMAN |7698|1981-02-20 00:00:00|1600|300 |30    |
|7566 |JONES |MANAGER  |7839|1981-03-02 00:00:00|2975|null|20    |
|7698 |BLAKE |MANAGER  |7839|1981-05-01 00:00:00|2850|null|30    |
|7782 |CLARK |MANAGER  |7839|1981-09-06 00:00:00|2450|null|10    |
|7654 |MARTIN|SALESMAN |7698|1981-10-22 00:00:00|1250|1400|30    |
|7839 |KING  |PRESIDENT|null|1981-11-17 00:00:00|5000|null|10    |
|7900 |JAMES |CLERK    |7698|1981-12-03 00:00:00|950 |null|30    |
|7902 |FORD  |ANALYST  |7566|1981-12-13 00:00:00|3000|null|20    |
|7934 |MILLER|CLERK    |7782|1982-01-25 00:00:00|1300|null|10    |
|7788 |SCOTT |ANALYST  |7566|1982-12-08 00:00:00|3000|null|20    |
|7876 |ADAMS |CLERK    |7788|1983-01-12 00:00:00|1100|null|20    |
|7844 |TURNER|SALESMAN |7698|1984-10-08 00:00:00|1500|null|30    |
+-----+------+---------+----+-------------------+----+----+------+

## groupBy()

In [95]:
emp.groupBy("deptno").sum("sal").show(truncate=False)

+------+--------+
|deptno|sum(sal)|
+------+--------+
|20    |10875   |
|10    |8750    |
|30    |9400    |
+------+--------+

In [96]:
emp.groupBy("deptno").min("sal").show(truncate=False)

+------+--------+
|deptno|min(sal)|
+------+--------+
|20    |800     |
|10    |1300    |
|30    |950     |
+------+--------+

In [97]:
emp.groupBy("deptno").max("sal").show(truncate=False)

+------+--------+
|deptno|max(sal)|
+------+--------+
|20    |3000    |
|10    |5000    |
|30    |2850    |
+------+--------+

In [98]:
emp.groupBy("deptno").avg("sal").show(truncate=False)

+------+------------------+
|deptno|avg(sal)          |
+------+------------------+
|20    |2175.0            |
|10    |2916.6666666666665|
|30    |1566.6666666666667|
+------+------------------+

In [99]:
emp.groupBy("deptno", "job").sum("sal").show(truncate=False)

+------+---------+--------+
|deptno|job      |sum(sal)|
+------+---------+--------+
|20    |ANALYST  |6000    |
|20    |MANAGER  |2975    |
|30    |MANAGER  |2850    |
|30    |SALESMAN |5600    |
|30    |CLERK    |950     |
|20    |CLERK    |1900    |
|10    |PRESIDENT|5000    |
|10    |CLERK    |1300    |
|10    |MANAGER  |2450    |
+------+---------+--------+

In [100]:
emp.groupBy("deptno").sum("sal", "comm").show(truncate=False)

+------+--------+---------+
|deptno|sum(sal)|sum(comm)|
+------+--------+---------+
|20    |10875   |null     |
|10    |8750    |null     |
|30    |9400    |2200     |
+------+--------+---------+

In [101]:
from pyspark.sql.functions import sum,avg,max,min,mean,count
emp.groupBy("deptno").agg(sum("sal"), avg("sal"), max("sal"), min("sal"), mean("sal")).show(truncate=False)

+------+--------+------------------+--------+--------+------------------+
|deptno|sum(sal)|avg(sal)          |max(sal)|min(sal)|avg(sal)          |
+------+--------+------------------+--------+--------+------------------+
|20    |10875   |2175.0            |3000    |800     |2175.0            |
|10    |8750    |2916.6666666666665|5000    |1300    |2916.6666666666665|
|30    |9400    |1566.6666666666667|2850    |950     |1566.6666666666667|
+------+--------+------------------+--------+--------+------------------+

In [102]:
emp.groupBy("deptno") \
    .agg(sum("sal").alias("sum_salary"), \
         avg("sal").alias("avg_salary"), \
         max("sal").alias("max_salary"), \
         min("sal").alias("min_salary"), \
         mean("sal").alias("mean_salary"), \
     ) \
    .show(truncate=False)

+------+----------+------------------+----------+----------+------------------+
|deptno|sum_salary|avg_salary        |max_salary|min_salary|mean_salary       |
+------+----------+------------------+----------+----------+------------------+
|20    |10875     |2175.0            |3000      |800       |2175.0            |
|10    |8750      |2916.6666666666665|5000      |1300      |2916.6666666666665|
|30    |9400      |1566.6666666666667|2850      |950       |1566.6666666666667|
+------+----------+------------------+----------+----------+------------------+

In [103]:
emp.groupBy("deptno") \
    .agg(sum("sal").alias("sum_salary"), \
         avg("sal").alias("avg_salary"), \
         max("sal").alias("max_salary"), \
         min("sal").alias("min_salary"), \
         mean("sal").alias("mean_salary"), \
     ) \
    .where(col("sum_salary") > 9000)\
    .show(truncate=False)

+------+----------+------------------+----------+----------+------------------+
|deptno|sum_salary|avg_salary        |max_salary|min_salary|mean_salary       |
+------+----------+------------------+----------+----------+------------------+
|20    |10875     |2175.0            |3000      |800       |2175.0            |
|30    |9400      |1566.6666666666667|2850      |950       |1566.6666666666667|
+------+----------+------------------+----------+----------+------------------+

In [104]:
deptdata = [(10, '영업부', '서울'), (20, '개발부', '대전'), (30, '기획부', '서울'), (40, '마케팅부', '서울')]
deptcolname = ['deptno', 'dname', 'loc']
dept = spark.createDataFrame(data=deptdata, schema=deptcolname)
dept.show(truncate=False)

+------+--------+----+
|deptno|dname   |loc |
+------+--------+----+
|10    |영업부  |서울|
|20    |개발부  |대전|
|30    |기획부  |서울|
|40    |마케팅부|서울|
+------+--------+----+

## join()

In [105]:
emp.join(dept,emp.deptno ==  dept.deptno,"inner") \
     .show(truncate=False)

+-----+------+---------+----+-------------------+----+----+------+------+------+----+
|empno|ename |job      |mgr |hiredate           |sal |comm|deptno|deptno|dname |loc |
+-----+------+---------+----+-------------------+----+----+------+------+------+----+
|7934 |MILLER|CLERK    |7782|1982-01-25 00:00:00|1300|null|10    |10    |영업부|서울|
|7839 |KING  |PRESIDENT|null|1981-11-17 00:00:00|5000|null|10    |10    |영업부|서울|
|7782 |CLARK |MANAGER  |7839|1981-09-06 00:00:00|2450|null|10    |10    |영업부|서울|
|7902 |FORD  |ANALYST  |7566|1981-12-13 00:00:00|3000|null|20    |20    |개발부|대전|
|7876 |ADAMS |CLERK    |7788|1983-01-12 00:00:00|1100|null|20    |20    |개발부|대전|
|7788 |SCOTT |ANALYST  |7566|1982-12-08 00:00:00|3000|null|20    |20    |개발부|대전|
|7566 |JONES |MANAGER  |7839|1981-03-02 00:00:00|2975|null|20    |20    |개발부|대전|
|7369 |SMITH |CLERK    |7902|1980-12-17 00:00:00|800 |null|20    |20    |개발부|대전|
|7900 |JAMES |CLERK    |7698|1981-12-03 00:00:00|950 |null|30    |30    |기획부|서울|
|7844 |TURNER|SALESMAN |7698|1984-10-08 00:00:00|1500|null|30    |30    |기획부|서울|
|7698 |BLAKE |MANAGER  |7839|1981-05-01 00:00:00|2850|null|30    |30    |기획부|서울|
|7654 |MARTIN|SALESMAN |7698|1981-10-22 00:00:00|1250|1400|30    |30    |기획부|서울|
|7521 |WARD  |SALESMAN |7698|1981-02-03 00:00:00|1250|500 |30    |30    |기획부|서울|
|7499 |ALLEN |SALESMAN |7698|1981-02-20 00:00:00|1600|300 |30    |30    |기획부|서울|
+-----+------+---------+----+-------------------+----+----+------+------+------+----+

In [106]:
emp.join(dept,emp.deptno ==  dept.deptno,"right") \
     .show(truncate=False)

+-----+------+---------+----+-------------------+----+----+------+------+--------+----+
|empno|ename |job      |mgr |hiredate           |sal |comm|deptno|deptno|dname   |loc |
+-----+------+---------+----+-------------------+----+----+------+------+--------+----+
|7934 |MILLER|CLERK    |7782|1982-01-25 00:00:00|1300|null|10    |10    |영업부  |서울|
|7839 |KING  |PRESIDENT|null|1981-11-17 00:00:00|5000|null|10    |10    |영업부  |서울|
|7782 |CLARK |MANAGER  |7839|1981-09-06 00:00:00|2450|null|10    |10    |영업부  |서울|
|7902 |FORD  |ANALYST  |7566|1981-12-13 00:00:00|3000|null|20    |20    |개발부  |대전|
|7876 |ADAMS |CLERK    |7788|1983-01-12 00:00:00|1100|null|20    |20    |개발부  |대전|
|7788 |SCOTT |ANALYST  |7566|1982-12-08 00:00:00|3000|null|20    |20    |개발부  |대전|
|7566 |JONES |MANAGER  |7839|1981-03-02 00:00:00|2975|null|20    |20    |개발부  |대전|
|7369 |SMITH |CLERK    |7902|1980-12-17 00:00:00|800 |null|20    |20    |개발부  |대전|
|7900 |JAMES |CLERK    |7698|1981-12-03 00:00:00|950 |null|30    |30    |기획부  |서울|
|7844 |TURNER|SALESMAN |7698|1984-10-08 00:00:00|1500|null|30    |30    |기획부  |서울|
|7698 |BLAKE |MANAGER  |7839|1981-05-01 00:00:00|2850|null|30    |30    |기획부  |서울|
|7654 |MARTIN|SALESMAN |7698|1981-10-22 00:00:00|1250|1400|30    |30    |기획부  |서울|
|7521 |WARD  |SALESMAN |7698|1981-02-03 00:00:00|1250|500 |30    |30    |기획부  |서울|
|7499 |ALLEN |SALESMAN |7698|1981-02-20 00:00:00|1600|300 |30    |30    |기획부  |서울|
|null |null  |null     |null|null               |null|null|null  |40    |마케팅부|서울|
+-----+------+---------+----+-------------------+----+----+------+------+--------+----+

## union()

In [107]:
emp1 = emp.filter("job == 'MANAGER'").select("ename", "sal")
emp2 = emp.filter("deptno == 30").select("ename", "sal")
emp1.show()
emp2.show()
emp1.union(emp2).show()

+-----+----+
|ename| sal|
+-----+----+
|JONES|2975|
|BLAKE|2850|
|CLARK|2450|
+-----+----+

+------+----+
| ename| sal|
+------+----+
| ALLEN|1600|
|  WARD|1250|
|MARTIN|1250|
| BLAKE|2850|
|TURNER|1500|
| JAMES| 950|
+------+----+

+------+----+
| ename| sal|
+------+----+
| JONES|2975|
| BLAKE|2850|
| CLARK|2450|
| ALLEN|1600|
|  WARD|1250|
|MARTIN|1250|
| BLAKE|2850|
|TURNER|1500|
| JAMES| 950|
+------+----+

In [108]:
emp1 = emp.filter("job == 'MANAGER'").select("ename", "sal")
emp2 = emp.filter("deptno == 30").select("ename", "sal")
emp1.show()
emp2.show()
emp1.union(emp2).dropDuplicates().show()

+-----+----+
|ename| sal|
+-----+----+
|JONES|2975|
|BLAKE|2850|
|CLARK|2450|
+-----+----+

+------+----+
| ename| sal|
+------+----+
| ALLEN|1600|
|  WARD|1250|
|MARTIN|1250|
| BLAKE|2850|
|TURNER|1500|
| JAMES| 950|
+------+----+

+------+----+
| ename| sal|
+------+----+
| BLAKE|2850|
|MARTIN|1250|
|TURNER|1500|
| CLARK|2450|
| JAMES| 950|
| ALLEN|1600|
| JONES|2975|
|  WARD|1250|
+------+----+

## **map() 과 flatMap()**

### lines = [['w1',  'w2', 'w3'], ['w4', 'w5', 'w6']]
### lines를 map/flatmap을 이용하여 split하게 되면 아래와 같다.
### map: one2one mapping
###	Array(Array('w1', 'w2', 'w3'), Array('w4', 'w5', 'w6'))

### flatmap: one example → one result(flatten)
### Array('w1', 'w2', 'w3', 'w4', 'w5', 'w6')

![spark2](images/spark2.png)

In [109]:
data = ["둘리 또치 도우너 희동이 고길동 마이콜",
        "피카츄 꼬부기 잠만보",
        "듀크 턱시",
        "프로도 간달프 스미골",
        "코코"]
rdd=spark.sparkContext.parallelize(data)
for element in rdd.collect():
    print(element)

둘리 또치 도우너 희동이 고길동 마이콜
피카츄 꼬부기 잠만보
듀크 턱시
프로도 간달프 스미골
코코

In [110]:
rdd2=rdd.map(lambda x: x.split(" "))
rdd2.collect()

[['둘리', '또치', '도우너', '희동이', '고길동', '마이콜'],
 ['피카츄', '꼬부기', '잠만보'],
 ['듀크', '턱시'],
 ['프로도', '간달프', '스미골'],
 ['코코']]

In [111]:
rdd2=rdd.flatMap(lambda x: x.split(" "))
rdd2.collect()

['둘리',
 '또치',
 '도우너',
 '희동이',
 '고길동',
 '마이콜',
 '피카츄',
 '꼬부기',
 '잠만보',
 '듀크',
 '턱시',
 '프로도',
 '간달프',
 '스미골',
 '코코']

In [112]:
spark.sparkContext.parallelize([3,4,5]).map(lambda x: range(1,x)).collect()

[range(1, 3), range(1, 4), range(1, 5)]

In [113]:
spark.sparkContext.parallelize([3,4,5]).flatMap(lambda x: range(1,x)).collect()

[1, 2, 1, 2, 3, 1, 2, 3, 4]

In [114]:
spark.sparkContext.parallelize([3,4,5]).map(lambda x: [x,  x*x]).collect()

[[3, 9], [4, 16], [5, 25]]

In [115]:
spark.sparkContext.parallelize([3,4,5]).flatMap(lambda x: [x,  x*x]).collect()

[3, 9, 4, 16, 5, 25]

In [116]:
lines = spark.sparkContext.textFile("data/greeting.txt")
sorted(lines.flatMap(lambda line: line.split()).map(lambda w: (w,1)).reduceByKey(lambda v1, v2: v1+v2).collect())

[('Birthday', 1),
 ('Day', 1),
 ('Evening', 1),
 ('Good', 3),
 ('Happy', 2),
 ('Morning', 1),
 ('New', 1),
 ('Year', 1)]

In [117]:
rdd1 = spark.sparkContext.textFile("data/greeting.txt")
print(type(rdd1))
print(rdd1)
print(rdd1.collect())
print("------------------------------------------------------------------------------")
rdd2 = rdd1.flatMap(lambda line: line.split())
print(type(rdd2))
print(rdd2)
print(rdd2.collect())
print("------------------------------------------------------------------------------")
rdd3 = rdd2.map(lambda w: (w,1))
print(type(rdd3))
print(rdd3)      
print(rdd3.collect())
print("------------------------------------------------------------------------------")
rdd4 = rdd3.reduceByKey(lambda v1, v2: v1+v2)
print(type(rdd4))
print(rdd4)
print(rdd4.collect())
print("------------------------------------------------------------------------------")
result = rdd4.collect()
print(type(result))
print(result)

<class 'pyspark.rdd.RDD'>
data/greeting.txt MapPartitionsRDD[608] at textFile at NativeMethodAccessorImpl.java:0
['Good Morning', 'Good Evening', 'Good Day', 'Happy Birthday', 'Happy New Year']
------------------------------------------------------------------------------
<class 'pyspark.rdd.PipelinedRDD'>
PythonRDD[609] at RDD at PythonRDD.scala:53
['Good', 'Morning', 'Good', 'Evening', 'Good', 'Day', 'Happy', 'Birthday', 'Happy', 'New', 'Year']
------------------------------------------------------------------------------
<class 'pyspark.rdd.PipelinedRDD'>
PythonRDD[610] at RDD at PythonRDD.scala:53
[('Good', 1), ('Morning', 1), ('Good', 1), ('Evening', 1), ('Good', 1), ('Day', 1), ('Happy', 1), ('Birthday', 1), ('Happy', 1), ('New', 1), ('Year', 1)]
------------------------------------------------------------------------------
<class 'pyspark.rdd.PipelinedRDD'>
PythonRDD[615] at RDD at PythonRDD.scala:53
[('Good', 3), ('Morning', 1), ('Evening', 1), ('Birthday', 1), ('New', 1), ('Year', 1), ('Day', 1), ('Happy', 2)]
------------------------------------------------------------------------------
<class 'list'>
[('Good', 3), ('Morning', 1), ('Evening', 1), ('Birthday', 1), ('New', 1), ('Year', 1), ('Day', 1), ('Happy', 2)]

### [PySpark API 도큐먼트](https://spark.apache.org/docs/latest/api/python/index.html)

## <span style='color:red'>**RDD**</span>
### Resilient Distributed Dataset의 약자(탄력 분산 데이터셋)
### 분산되어 존재하는 데이터들의 모임, 즉 클러스터에 분배되어 있는 데이터들을 하나로 관리하는 개념
### 스파크의 모든 데이터 타입들은 RDD를 기반으로 만들어지고 데이터끼리의 연산들은 RDD의 연산으로 이루어져 있음

In [118]:
greetRDD = spark.sparkContext.textFile('data/greeting.txt')
print(greetRDD)
greetRDD.collect()

data/greeting.txt MapPartitionsRDD[617] at textFile at NativeMethodAccessorImpl.java:0

['Good Morning',
 'Good Evening',
 'Good Day',
 'Happy Birthday',
 'Happy New Year']

In [119]:
goodLines = greetRDD.filter(lambda x : "Good" in x)
goodLines.collect()

['Good Morning', 'Good Evening', 'Good Day']

In [120]:
goodLines.count()

3

In [121]:
numbers = spark.sparkContext.parallelize(list(range(5)))
squared = numbers.map(lambda x : x * x).collect()
squared

[0, 1, 4, 9, 16]

In [122]:
strings = spark.sparkContext.parallelize(["hello spark", "hi python"])
splitted = strings.flatMap(lambda x : x.split(" ")).collect()
splitted

['hello', 'spark', 'hi', 'python']

In [123]:
numbers = spark.sparkContext.parallelize(list(range(1, 30, 3)))
result = numbers.filter(lambda x : x % 2 == 0).collect()
result

[4, 10, 16, 22, 28]

In [124]:
linesRDD = spark.sparkContext.parallelize(["test", "this is a test rdd"])
linesRDD

ParallelCollectionRDD[626] at parallelize at PythonRDD.scala:195

## <span style='color:red'>**페어 RDD**</span>
### 페어 RDD란 key-value쌍으로 이루어진 RDD
### 파이썬에서는 Tuple로 이뤄진 RDD가 곧 페어 RDD가 됨

In [125]:
examplePairRDD = spark.sparkContext.parallelize([(1, 3), (1, 5), (2, 4), (3, 3), (4, 8), (4, 2), (3, 1)])
print(examplePairRDD)
examplePairRDD.collect()

ParallelCollectionRDD[627] at parallelize at PythonRDD.scala:195

[(1, 3), (1, 5), (2, 4), (3, 3), (4, 8), (4, 2), (3, 1)]

- reduceByKey(func) : 동일 키에 대한 값들을 reduce(예 : rdd.reduceByKey(lambda x, y: x + y))
- mapValues(func) : 각 키에 대해 연산을 적용(예 : rdd.mapValues(lambda x : x + 1))
- sortByKey() : 키로 정렬한 RDD 리턴(예 : rdd.sortByKey())
- keys() : 키값들을 리턴(예 : rdd.keys())
- values() : value값들을 리턴(예 : rdd.values())

In [126]:
examplePairRDD.reduceByKey(lambda x, y : x + y).collect()

[(1, 8), (2, 4), (3, 4), (4, 10)]

In [127]:
examplePairRDD.mapValues(lambda x: x**2).collect()

[(1, 9), (1, 25), (2, 16), (3, 9), (4, 64), (4, 4), (3, 1)]

In [128]:
customerLines = spark.sparkContext.textFile("data/name-customers.csv")
print(customerLines)
customerLines.first()

data/name-customers.csv MapPartitionsRDD[635] at textFile at NativeMethodAccessorImpl.java:0

'Alfreds Futterkiste,Germany'

In [129]:
customerPairs = customerLines.map(lambda x: (x.split(",")[1], x.split(",")[0]))
print(customerPairs)
customerPairs.collect()

PythonRDD[637] at RDD at PythonRDD.scala:53

[('Germany', 'Alfreds Futterkiste'),
 ('Mexico', 'Ana Trujillo Emparedados y helados'),
 ('Mexico', 'Antonio Moreno Taqueria'),
 ('UK', 'Around the Horn'),
 ('Sweden', 'Berglunds snabbkop'),
 ('Germany', 'Blauer See Delikatessen'),
 ('France', 'Blondel pere et fils'),
 ('Spain', 'Bolido Comidas preparadas'),
 ('France', "Bon app'"),
 ('Canada', 'Bottom-Dollar Marketse'),
 ('UK', "B's Beverages"),
 ('Argentina', 'Cactus Comidas para llevar'),
 ('Mexico', 'Centro comercial Moctezuma'),
 ('Switzerland', 'Chop-suey Chinese'),
 ('Brazil', 'Comercio Mineiro'),
 ('UK', 'Consolidated Holdings'),
 ('Germany', 'Drachenblut Delikatessend'),
 ('France', 'Du monde entier'),
 ('UK', 'Eastern Connection'),
 ('Austria', 'Ernst Handel'),
 ('Brazil', 'Familia Arquibaldo'),
 ('Spain', 'FISSA Fabrica Inter. Salchichas S.A.'),
 ('France', 'Folies gourmandes'),
 ('Sweden', 'Folk och fa HB'),
 ('Germany', 'Frankenversand'),
 ('France', 'France restauration'),
 ('Italy', 'Franchi S.p.A.'),
 ('Portugal', 'Furia Bacalhau e Frutos do Mar'),
 ('Spain', 'Galeria del gastronomo'),
 ('Spain', 'Godos Cocina Tipica'),
 ('Brazil', 'Gourmet Lanchonetes'),
 ('USA', 'Great Lakes Food Market'),
 ('Venezuela', 'GROSELLA-Restaurante'),
 ('Brazil', 'Hanari Carnes'),
 ('Venezuela', 'HILARIoN-Abastos'),
 ('USA', 'Hungry Coyote Import Store'),
 ('Ireland', 'Hungry Owl All-Night Grocers'),
 ('UK', 'Island Trading'),
 ('Germany', 'Koniglich Essen'),
 ('France', "La corne d'abondance"),
 ('France', "La maison d'Asie"),
 ('Canada', 'Laughing Bacchus Wine Cellars'),
 ('USA', 'Lazy K Kountry Store'),
 ('Germany', 'Lehmanns Marktstand'),
 ('USA', "Let's Stop N Shop"),
 ('Venezuela', 'LILA-Supermercado'),
 ('Venezuela', 'LINO-Delicateses'),
 ('USA', 'Lonesome Pine Restaurant'),
 ('Italy', 'Magazzini Alimentari Riuniti'),
 ('Belgium', 'Maison Dewey'),
 ('Canada', 'Mere Paillarde'),
 ('Germany', 'Morgenstern Gesundkost'),
 ('UK', 'North/South'),
 ('Argentina', 'Oceano Atlantico Ltda.'),
 ('USA', 'Old World Delicatessen'),
 ('Germany', 'Ottilies Kaseladen'),
 ('France', 'Paris specialites'),
 ('Mexico', 'Pericles Comidas clasicas'),
 ('Austria', 'Piccolo und mehr'),
 ('Portugal', 'Princesa Isabel Vinhoss'),
 ('Brazil', 'Que Delicia'),
 ('Brazil', 'Queen Cozinha'),
 ('Germany', 'QUICK-Stop'),
 ('Argentina', 'Rancho grande'),
 ('USA', 'Rattlesnake Canyon Grocery'),
 ('Italy', 'Reggiani Caseifici'),
 ('Brazil', 'Ricardo Adocicados'),
 ('Switzerland', 'Richter Supermarkt'),
 ('Spain', 'Romero y tomillo'),
 ('Norway', 'Sante Gourmet'),
 ('USA', 'Save-a-lot Markets'),
 ('UK', 'Seven Seas Imports'),
 ('Denmark', 'Simons bistro'),
 ('France', 'Specialites du monde'),
 ('USA', 'Split Rail Beer & Ale'),
 ('Belgium', 'Supremes delices'),
 ('USA', 'The Big Cheese'),
 ('USA', 'The Cracker Box'),
 ('Germany', 'Toms Spezialitaten'),
 ('Mexico', 'Tortuga Restaurante'),
 ('Brazil', 'Tradicao Hipermercados'),
 ('USA', "Trail's Head Gourmet Provisioners"),
 ('Denmark', 'Vaffeljernet'),
 ('France', 'Victuailles en stock'),
 ('France', 'Vins et alcools Chevalier'),
 ('Germany', 'Die Wandernde Kuh'),
 ('Finland', 'Wartian Herkku'),
 ('Brazil', 'Wellington Importadora'),
 ('USA', 'White Clover Markets'),
 ('Finland', 'Wilman Kala'),
 ('Poland', 'Wolski')]

In [130]:
customerPairCollected = customerPairs.groupByKey().collect()
customerDict = {
    country : [c for c in customers]
    for country, customers in customerPairCollected
}
customerDict['UK']

['Around the Horn',
 "B's Beverages",
 'Consolidated Holdings',
 'Eastern Connection',
 'Island Trading',
 'North/South',
 'Seven Seas Imports']

In [131]:
[k for k in customerPairs.sortByKey().keys().collect()][:10]

['Argentina',
 'Argentina',
 'Argentina',
 'Austria',
 'Austria',
 'Belgium',
 'Belgium',
 'Brazil',
 'Brazil',
 'Brazil']

In [132]:
mapReduced = customerPairs.mapValues(lambda x : 1).reduceByKey(lambda x, y: x + y)
{
    i:j for i, j in mapReduced.collect()
}

{'Mexico': 5,
 'France': 11,
 'Argentina': 3,
 'Switzerland': 2,
 'Brazil': 9,
 'Austria': 2,
 'Portugal': 2,
 'USA': 13,
 'Venezuela': 4,
 'Ireland': 1,
 'Belgium': 2,
 'Norway': 1,
 'Denmark': 2,
 'Finland': 2,
 'Poland': 1,
 'Germany': 11,
 'UK': 7,
 'Sweden': 2,
 'Spain': 5,
 'Canada': 3,
 'Italy': 3}

## RDD를 가지고 워드카운팅하는 예제

In [133]:
lines = spark.sparkContext.textFile("data/greeting.txt")
sorted(lines.flatMap(lambda line: line.split()).map(lambda w: (w,1)).reduceByKey(lambda v1, v2: v1+v2).collect())

[('Birthday', 1),
 ('Day', 1),
 ('Evening', 1),
 ('Good', 3),
 ('Happy', 2),
 ('Morning', 1),
 ('New', 1),
 ('Year', 1)]

In [134]:
rdd1 = spark.sparkContext.textFile("data/greeting.txt")
print(type(rdd1))
print(rdd1)
print(rdd1.collect())
print("------------------------------------------------------------------------------")
rdd2 = rdd1.flatMap(lambda line: line.split())
print(type(rdd2))
print(rdd2)
print(rdd2.collect())
print("------------------------------------------------------------------------------")
rdd3 = rdd2.map(lambda w: (w,1))
print(type(rdd3))
print(rdd3)      
print(rdd3.collect())
print("------------------------------------------------------------------------------")
rdd4 = rdd3.reduceByKey(lambda v1, v2: v1+v2)
print(type(rdd4))
print(rdd4)
print(rdd4.collect())
print("------------------------------------------------------------------------------")
result = rdd4.collect()
print(type(result))
print(result)
print("------------------------------------------------------------------------------")
print(sorted(result))

<class 'pyspark.rdd.RDD'>
data/greeting.txt MapPartitionsRDD[663] at textFile at NativeMethodAccessorImpl.java:0
['Good Morning', 'Good Evening', 'Good Day', 'Happy Birthday', 'Happy New Year']
------------------------------------------------------------------------------
<class 'pyspark.rdd.PipelinedRDD'>
PythonRDD[664] at RDD at PythonRDD.scala:53
['Good', 'Morning', 'Good', 'Evening', 'Good', 'Day', 'Happy', 'Birthday', 'Happy', 'New', 'Year']
------------------------------------------------------------------------------
<class 'pyspark.rdd.PipelinedRDD'>
PythonRDD[665] at RDD at PythonRDD.scala:53
[('Good', 1), ('Morning', 1), ('Good', 1), ('Evening', 1), ('Good', 1), ('Day', 1), ('Happy', 1), ('Birthday', 1), ('Happy', 1), ('New', 1), ('Year', 1)]
------------------------------------------------------------------------------
<class 'pyspark.rdd.PipelinedRDD'>
PythonRDD[670] at RDD at PythonRDD.scala:53
[('Good', 3), ('Morning', 1), ('Evening', 1), ('Birthday', 1), ('New', 1), ('Year', 1), ('Day', 1), ('Happy', 2)]
------------------------------------------------------------------------------
<class 'list'>
[('Good', 3), ('Morning', 1), ('Evening', 1), ('Birthday', 1), ('New', 1), ('Year', 1), ('Day', 1), ('Happy', 2)]
------------------------------------------------------------------------------
[('Birthday', 1), ('Day', 1), ('Evening', 1), ('Good', 3), ('Happy', 2), ('Morning', 1), ('New', 1), ('Year', 1)]

## 파일 로딩(JSON, CSV)

In [135]:
import json
carsJson = spark.sparkContext.textFile("./data/cars.json")\
              .map(lambda x: json.loads(x))
carsJson

PythonRDD[673] at RDD at PythonRDD.scala:53

In [136]:
carsJson.first()

{'brand': 'Ford', 'models': {'name': 'Fiesta', 'price': '14260'}}

In [137]:
carsJson.collect()

[{'brand': 'Ford', 'models': {'name': 'Fiesta', 'price': '14260'}},
 {'brand': 'Ford', 'models': {'name': 'Focus', 'price': '18825'}},
 {'brand': 'Ford', 'models': {'name': 'Mustang', 'price': '26670'}},
 {'brand': 'BMW', 'models': {'name': '320', 'price': '40250'}},
 {'brand': 'BMW', 'models': {'name': 'X3', 'price': '41000'}},
 {'brand': 'BMW', 'models': {'name': 'X5', 'price': '60700'}},
 {'brand': 'Fiat', 'models': {'name': '500', 'price': '16495'}}]

## RDD를 가지고 Hive가상테이블 생성 ~> SQL을 사용해서 데이터 처리

In [138]:
emp = spark.read.csv("data/emp.csv", header=True, inferSchema=True)
emp

DataFrame[empno: int, ename: string, job: string, mgr: int, hiredate: timestamp, sal: int, comm: int, deptno: int]

In [139]:
from pyspark.sql import HiveContext
hiveCtx = HiveContext(spark.sparkContext)

In [140]:
emp.registerTempTable("hiveemp")
emp

DataFrame[empno: int, ename: string, job: string, mgr: int, hiredate: timestamp, sal: int, comm: int, deptno: int]

In [141]:
empResult = hiveCtx.sql("SELECT ename, sal FROM hiveemp")
empResult.collect()[:5]

[Row(ename='SMITH', sal=800),
 Row(ename='ALLEN', sal=1600),
 Row(ename='WARD', sal=1250),
 Row(ename='JONES', sal=2975),
 Row(ename='MARTIN', sal=1250)]

In [142]:
empResult = hiveCtx.sql("SELECT * FROM hiveemp order by sal")
empResult.collect()

[Row(empno=7369, ename='SMITH', job='CLERK', mgr=7902, hiredate=datetime.datetime(1980, 12, 17, 0, 0), sal=800, comm=None, deptno=20),
 Row(empno=7900, ename='JAMES', job='CLERK', mgr=7698, hiredate=datetime.datetime(1981, 12, 3, 0, 0), sal=950, comm=None, deptno=30),
 Row(empno=7876, ename='ADAMS', job='CLERK', mgr=7788, hiredate=datetime.datetime(1983, 1, 12, 0, 0), sal=1100, comm=None, deptno=20),
 Row(empno=7521, ename='WARD', job='SALESMAN', mgr=7698, hiredate=datetime.datetime(1981, 2, 3, 0, 0), sal=1250, comm=500, deptno=30),
 Row(empno=7654, ename='MARTIN', job='SALESMAN', mgr=7698, hiredate=datetime.datetime(1981, 10, 22, 0, 0), sal=1250, comm=1400, deptno=30),
 Row(empno=7934, ename='MILLER', job='CLERK', mgr=7782, hiredate=datetime.datetime(1982, 1, 25, 0, 0), sal=1300, comm=None, deptno=10),
 Row(empno=7844, ename='TURNER', job='SALESMAN', mgr=7698, hiredate=datetime.datetime(1984, 10, 8, 0, 0), sal=1500, comm=None, deptno=30),
 Row(empno=7499, ename='ALLEN', job='SALESMAN', mgr=7698, hiredate=datetime.datetime(1981, 2, 20, 0, 0), sal=1600, comm=300, deptno=30),
 Row(empno=7782, ename='CLARK', job='MANAGER', mgr=7839, hiredate=datetime.datetime(1981, 9, 6, 0, 0), sal=2450, comm=None, deptno=10),
 Row(empno=7698, ename='BLAKE', job='MANAGER', mgr=7839, hiredate=datetime.datetime(1981, 5, 1, 0, 0), sal=2850, comm=None, deptno=30),
 Row(empno=7566, ename='JONES', job='MANAGER', mgr=7839, hiredate=datetime.datetime(1981, 3, 2, 0, 0), sal=2975, comm=None, deptno=20),
 Row(empno=7788, ename='SCOTT', job='ANALYST', mgr=7566, hiredate=datetime.datetime(1982, 12, 8, 0, 0), sal=3000, comm=None, deptno=20),
 Row(empno=7902, ename='FORD', job='ANALYST', mgr=7566, hiredate=datetime.datetime(1981, 12, 13, 0, 0), sal=3000, comm=None, deptno=20),
 Row(empno=7839, ename='KING', job='PRESIDENT', mgr=None, hiredate=datetime.datetime(1981, 11, 17, 0, 0), sal=5000, comm=None, deptno=10)]

## RDD를 가지고 임시뷰 생성 ~> SQL을 사용해서 데이터 처리

In [143]:
emp.createOrReplaceTempView("empview")

In [144]:
sparkdf = spark.sql("select * from empview")
print(type(sparkdf))
sparkdf.show()

<class 'pyspark.sql.dataframe.DataFrame'>
+-----+------+---------+----+-------------------+----+----+------+
|empno| ename|      job| mgr|           hiredate| sal|comm|deptno|
+-----+------+---------+----+-------------------+----+----+------+
| 7369| SMITH|    CLERK|7902|1980-12-17 00:00:00| 800|null|    20|
| 7499| ALLEN| SALESMAN|7698|1981-02-20 00:00:00|1600| 300|    30|
| 7521|  WARD| SALESMAN|7698|1981-02-03 00:00:00|1250| 500|    30|
| 7566| JONES|  MANAGER|7839|1981-03-02 00:00:00|2975|null|    20|
| 7654|MARTIN| SALESMAN|7698|1981-10-22 00:00:00|1250|1400|    30|
| 7698| BLAKE|  MANAGER|7839|1981-05-01 00:00:00|2850|null|    30|
| 7782| CLARK|  MANAGER|7839|1981-09-06 00:00:00|2450|null|    10|
| 7788| SCOTT|  ANALYST|7566|1982-12-08 00:00:00|3000|null|    20|
| 7839|  KING|PRESIDENT|null|1981-11-17 00:00:00|5000|null|    10|
| 7844|TURNER| SALESMAN|7698|1984-10-08 00:00:00|1500|null|    30|
| 7876| ADAMS|    CLERK|7788|1983-01-12 00:00:00|1100|null|    20|
| 7900| JAMES|    CLERK|7698|1981-12-03 00:00:00| 950|null|    30|
| 7902|  FORD|  ANALYST|7566|1981-12-13 00:00:00|3000|null|    20|
| 7934|MILLER|    CLERK|7782|1982-01-25 00:00:00|1300|null|    10|
+-----+------+---------+----+-------------------+----+----+------+

In [145]:
spark.sql("select * from empview where sal > 2000").show()

+-----+-----+---------+----+-------------------+----+----+------+
|empno|ename|      job| mgr|           hiredate| sal|comm|deptno|
+-----+-----+---------+----+-------------------+----+----+------+
| 7566|JONES|  MANAGER|7839|1981-03-02 00:00:00|2975|null|    20|
| 7698|BLAKE|  MANAGER|7839|1981-05-01 00:00:00|2850|null|    30|
| 7782|CLARK|  MANAGER|7839|1981-09-06 00:00:00|2450|null|    10|
| 7788|SCOTT|  ANALYST|7566|1982-12-08 00:00:00|3000|null|    20|
| 7839| KING|PRESIDENT|null|1981-11-17 00:00:00|5000|null|    10|
| 7902| FORD|  ANALYST|7566|1981-12-13 00:00:00|3000|null|    20|
+-----+-----+---------+----+-------------------+----+----+------+

In [146]:
spark.sql("select deptno, sum(sal), max(sal) from empview group by deptno").show()

+------+--------+--------+
|deptno|sum(sal)|max(sal)|
+------+--------+--------+
|    20|   10875|    3000|
|    10|    8750|    5000|
|    30|    9400|    2850|
+------+--------+--------+

In [147]:
spark.sql("select * from empview order by sal desc").show()

+-----+------+---------+----+-------------------+----+----+------+
|empno| ename|      job| mgr|           hiredate| sal|comm|deptno|
+-----+------+---------+----+-------------------+----+----+------+
| 7839|  KING|PRESIDENT|null|1981-11-17 00:00:00|5000|null|    10|
| 7788| SCOTT|  ANALYST|7566|1982-12-08 00:00:00|3000|null|    20|
| 7902|  FORD|  ANALYST|7566|1981-12-13 00:00:00|3000|null|    20|
| 7566| JONES|  MANAGER|7839|1981-03-02 00:00:00|2975|null|    20|
| 7698| BLAKE|  MANAGER|7839|1981-05-01 00:00:00|2850|null|    30|
| 7782| CLARK|  MANAGER|7839|1981-09-06 00:00:00|2450|null|    10|
| 7499| ALLEN| SALESMAN|7698|1981-02-20 00:00:00|1600| 300|    30|
| 7844|TURNER| SALESMAN|7698|1984-10-08 00:00:00|1500|null|    30|
| 7934|MILLER|    CLERK|7782|1982-01-25 00:00:00|1300|null|    10|
| 7654|MARTIN| SALESMAN|7698|1981-10-22 00:00:00|1250|1400|    30|
| 7521|  WARD| SALESMAN|7698|1981-02-03 00:00:00|1250| 500|    30|
| 7876| ADAMS|    CLERK|7788|1983-01-12 00:00:00|1100|null|    20|
| 7900| JAMES|    CLERK|7698|1981-12-03 00:00:00| 950|null|    30|
| 7369| SMITH|    CLERK|7902|1980-12-17 00:00:00| 800|null|    20|
+-----+------+---------+----+-------------------+----+----+------+

In [148]:
spark.sql("select * from empview order by sal desc").take(1)

[Row(empno=7839, ename='KING', job='PRESIDENT', mgr=None, hiredate=datetime.datetime(1981, 11, 17, 0, 0), sal=5000, comm=None, deptno=10)]

In [149]:
spark.sql("select * from empview order by sal desc").take(1)[0][1]

'KING'

In [150]:
spark.sql("select * from empview order by sal desc").take(1)[0][4]

datetime.datetime(1981, 11, 17, 0, 0)

![이미지](images/spark_df.png)

## Row 객체

In [151]:
from pyspark.sql import Row
row=Row("James",40)
print(row[0] +","+str(row[1]))

James,40

In [152]:
row=Row(name="Alice", age=11)
print(row.name)

Alice

In [153]:
Person = Row("name", "age")
p1=Person("James", 40)
p2=Person("Alice", 35)
print(p1.name +","+p2.name)

James,Alice

In [154]:
from pyspark.sql import Row

data = [Row(name="James,,Smith",lang=["Java","Scala","C++"],state="CA"), 
    Row(name="Michael,Rose,",lang=["Spark","Java","C++"],state="NJ"),
    Row(name="Robert,,Williams",lang=["CSharp","VB"],state="NV")]
rdd=spark.sparkContext.parallelize(data)
print(rdd.collect())

[Row(lang=['Java', 'Scala', 'C++'], name='James,,Smith', state='CA'), Row(lang=['Spark', 'Java', 'C++'], name='Michael,Rose,', state='NJ'), Row(lang=['CSharp', 'VB'], name='Robert,,Williams', state='NV')]

In [155]:
collData=rdd.collect()
for row in collData:
    print(row.name + "," +str(row.lang))

James,,Smith,['Java', 'Scala', 'C++']
Michael,Rose,,['Spark', 'Java', 'C++']
Robert,,Williams,['CSharp', 'VB']

## 날짜데이터를 처리하자

In [156]:
import pyspark.sql.functions as f

In [157]:
l1 = [('2019-05-22',342),('2020-06-02',334),('2019-09-30',269),('2020-10-10',342),('2020-12-25',342)]
dfl1 =  spark.createDataFrame(l1).toDF("dates","sum")
dfl1.show()

+----------+---+
|     dates|sum|
+----------+---+
|2019-05-22|342|
|2020-06-02|334|
|2019-09-30|269|
|2020-10-10|342|
|2020-12-25|342|
+----------+---+

In [158]:
from pyspark.sql.functions import col
dfl2 = dfl1.withColumn('years',f.year(f.to_timestamp('dates', 'yyyy-MM-dd')))
dfl2 = dfl2.withColumn("month",f.month(f.to_timestamp('dates', 'yyyy-MM-dd')))
dfl2 = dfl2.withColumn("dayofmonth",f.dayofmonth(f.to_timestamp('dates', 'yyyy-MM-dd')))
dfl2.show()

+----------+---+-----+-----+----------+
|     dates|sum|years|month|dayofmonth|
+----------+---+-----+-----+----------+
|2019-05-22|342| 2019|    5|        22|
|2020-06-02|334| 2020|    6|         2|
|2019-09-30|269| 2019|    9|        30|
|2020-10-10|342| 2020|   10|        10|
|2020-12-25|342| 2020|   12|        25|
+----------+---+-----+-----+----------+

In [159]:
dfl2 = dfl1.withColumn('years',f.year(f.to_timestamp('dates')))
dfl2 = dfl2.withColumn("month",f.month(f.to_timestamp('dates')))
dfl2 = dfl2.withColumn("dayofmonth",f.dayofmonth(f.to_timestamp('dates')))
dfl2.show()

+----------+---+-----+-----+----------+
|     dates|sum|years|month|dayofmonth|
+----------+---+-----+-----+----------+
|2019-05-22|342| 2019|    5|        22|
|2020-06-02|334| 2020|    6|         2|
|2019-09-30|269| 2019|    9|        30|
|2020-10-10|342| 2020|   10|        10|
|2020-12-25|342| 2020|   12|        25|
+----------+---+-----+-----+----------+

In [160]:
dfl2.groupBy('years').sum('sum').show()

+-----+--------+
|years|sum(sum)|
+-----+--------+
| 2019|     611|
| 2020|    1018|
+-----+--------+

## NoneType 필터링
### pyspark에서 drop method는 NULL을 가진 행을 제거하는데 가장 간단한 함수다. 

### [drop 메소드에 인수]
### any: 모든 행의 컬럼값 중 하나라도 NULL의 값을 가지면 해당 행을 제거
### all: 모든 컬럼 값이 NULL이거나 NaN인 경우에만 해당 행을 제거

In [161]:
import pyspark.sql.functions as f

In [162]:
df = spark.createDataFrame([
    (1,'A','X1'),(2,None,'X2'),(2,'B','X2'),(2,'','X1'),(None,'','X3'),(1,'C','X1'),(2,None,'X1'),(2,'D',None),(None,None,None)
], ["ID", "TYPE", "CODE"])
df.show()

+----+----+----+
|  ID|TYPE|CODE|
+----+----+----+
|   1|   A|  X1|
|   2|null|  X2|
|   2|   B|  X2|
|   2|    |  X1|
|null|    |  X3|
|   1|   C|  X1|
|   2|null|  X1|
|   2|   D|null|
|null|null|null|
+----+----+----+

In [163]:
df.na.drop('any').show()

+---+----+----+
| ID|TYPE|CODE|
+---+----+----+
|  1|   A|  X1|
|  2|   B|  X2|
|  2|    |  X1|
|  1|   C|  X1|
+---+----+----+

In [164]:
df.na.drop('all').show()

+----+----+----+
|  ID|TYPE|CODE|
+----+----+----+
|   1|   A|  X1|
|   2|null|  X2|
|   2|   B|  X2|
|   2|    |  X1|
|null|    |  X3|
|   1|   C|  X1|
|   2|null|  X1|
|   2|   D|null|
+----+----+----+

In [165]:
df.na.drop('all', subset=['TYPE', 'CODE']).show()

+----+----+----+
|  ID|TYPE|CODE|
+----+----+----+
|   1|   A|  X1|
|   2|null|  X2|
|   2|   B|  X2|
|   2|    |  X1|
|null|    |  X3|
|   1|   C|  X1|
|   2|null|  X1|
|   2|   D|null|
+----+----+----+

In [166]:
df.na.drop('any', subset=['TYPE', 'CODE']).show()

+----+----+----+
|  ID|TYPE|CODE|
+----+----+----+
|   1|   A|  X1|
|   2|   B|  X2|
|   2|    |  X1|
|null|    |  X3|
|   1|   C|  X1|
+----+----+----+

In [167]:
df.show()

+----+----+----+
|  ID|TYPE|CODE|
+----+----+----+
|   1|   A|  X1|
|   2|null|  X2|
|   2|   B|  X2|
|   2|    |  X1|
|null|    |  X3|
|   1|   C|  X1|
|   2|null|  X1|
|   2|   D|null|
|null|null|null|
+----+----+----+

In [168]:
from decimal import Decimal

data = [{"Category": 'Category A', "ID": 1, "Value": Decimal(12.40)},
        {"Category": 'Category B', "ID": 2, "Value": Decimal(30.10)},
        {"Category": 'Category C', "ID": 3, "Value": None},
        {"Category": 'Category D', "ID": 4, "Value": Decimal(1.0)},
        ]

# Create data frame
df = spark.createDataFrame(data)
df.show()

+----------+---+--------------------+
|  Category| ID|               Value|
+----------+---+--------------------+
|Category A|  1|12.40000000000000...|
|Category B|  2|30.10000000000000...|
|Category C|  3|                null|
|Category D|  4|1.000000000000000000|
+----------+---+--------------------+

/opt/spark/python/pyspark/sql/session.py:346: UserWarning: inferring schema from dict is deprecated,please use pyspark.sql.Row instead
  warnings.warn("inferring schema from dict is deprecated,"

In [169]:
from decimal import Decimal

data = [Row(Category='Category A', ID=1, Value= Decimal(12.40)),
        Row(Category='Category B', ID=2, Value= Decimal(30.10)),
        Row(Category='Category C', ID=3, Value= None),
        Row(Category='Category D', ID=4, Value= Decimal(1.0)),
        ]

# Create data frame
df = spark.createDataFrame(data)
df.show()

+----------+---+--------------------+
|  Category| ID|               Value|
+----------+---+--------------------+
|Category A|  1|12.40000000000000...|
|Category B|  2|30.10000000000000...|
|Category C|  3|                null|
|Category D|  4|1.000000000000000000|
+----------+---+--------------------+

In [170]:
df.filter("Value is not null").show()

+----------+---+--------------------+
|  Category| ID|               Value|
+----------+---+--------------------+
|Category A|  1|12.40000000000000...|
|Category B|  2|30.10000000000000...|
|Category D|  4|1.000000000000000000|
+----------+---+--------------------+

In [171]:
df.where("Value is null").show()

+----------+---+-----+
|  Category| ID|Value|
+----------+---+-----+
|Category C|  3| null|
+----------+---+-----+

In [172]:
df.filter(df['Value'].isNull()).show()

+----------+---+-----+
|  Category| ID|Value|
+----------+---+-----+
|Category C|  3| null|
+----------+---+-----+

In [173]:
df.where(df.Value.isNotNull()).show()

+----------+---+--------------------+
|  Category| ID|               Value|
+----------+---+--------------------+
|Category A|  1|12.40000000000000...|
|Category B|  2|30.10000000000000...|
|Category D|  4|1.000000000000000000|
+----------+---+--------------------+

## 날짜타입 데이터 처리

In [174]:
emp = spark.read.csv("data/emp.csv", header=True, inferSchema=True)

In [175]:
emp.columns

['empno', 'ename', 'job', 'mgr', 'hiredate', 'sal', 'comm', 'deptno']

In [176]:
emp.dtypes

[('empno', 'int'),
 ('ename', 'string'),
 ('job', 'string'),
 ('mgr', 'int'),
 ('hiredate', 'timestamp'),
 ('sal', 'int'),
 ('comm', 'int'),
 ('deptno', 'int')]

In [177]:
from pyspark.sql.functions import col
newemp = emp.withColumn("hiredate",col("hiredate").cast("Date"))
newemp.printSchema()

root
 |-- empno: integer (nullable = true)
 |-- ename: string (nullable = true)
 |-- job: string (nullable = true)
 |-- mgr: integer (nullable = true)
 |-- hiredate: date (nullable = true)
 |-- sal: integer (nullable = true)
 |-- comm: integer (nullable = true)
 |-- deptno: integer (nullable = true)

In [178]:
newemp.select(f.year(newemp["hiredate"])).show()

+--------------+
|year(hiredate)|
+--------------+
|          1980|
|          1981|
|          1981|
|          1981|
|          1981|
|          1981|
|          1981|
|          1982|
|          1981|
|          1984|
|          1983|
|          1981|
|          1981|
|          1982|
+--------------+

In [179]:
newemp.select(f.month(newemp["hiredate"])).show()

+---------------+
|month(hiredate)|
+---------------+
|             12|
|              2|
|              2|
|              3|
|             10|
|              5|
|              9|
|             12|
|             11|
|             10|
|              1|
|             12|
|             12|
|              1|
+---------------+

In [180]:
newemp.select(f.dayofmonth(newemp["hiredate"])).show()

+--------------------+
|dayofmonth(hiredate)|
+--------------------+
|                  17|
|                  20|
|                   3|
|                   2|
|                  22|
|                   1|
|                   6|
|                   8|
|                  17|
|                   8|
|                  12|
|                   3|
|                  13|
|                  25|
+--------------------+

## 날짜타입 데이터 처리

In [182]:
flightData2015 = spark\
  .read\
  .option("inferSchema", "true")\
  .option("header", "true")\
  .csv("data/flight-data/csv/2015-summary.csv")

In [183]:
flightData2015.createOrReplaceTempView("flight_data_2015")

In [184]:
sqlWay = spark.sql("""
SELECT DEST_COUNTRY_NAME, count(1)
FROM flight_data_2015
GROUP BY DEST_COUNTRY_NAME
""")
sqlWay.show()

+--------------------+--------+
|   DEST_COUNTRY_NAME|count(1)|
+--------------------+--------+
|            Anguilla|       1|
|              Russia|       1|
|            Paraguay|       1|
|             Senegal|       1|
|              Sweden|       1|
|            Kiribati|       1|
|              Guyana|       1|
|         Philippines|       1|
|            Djibouti|       1|
|            Malaysia|       1|
|           Singapore|       1|
|                Fiji|       1|
|              Turkey|       1|
|                Iraq|       1|
|             Germany|       1|
|              Jordan|       1|
|               Palau|       1|
|Turks and Caicos ...|       1|
|              France|       1|
|              Greece|       1|
+--------------------+--------+
only showing top 20 rows

In [185]:
dataFrameWay = flightData2015\
  .groupBy("DEST_COUNTRY_NAME")\
  .count()
dataFrameWay.show()

+--------------------+-----+
|   DEST_COUNTRY_NAME|count|
+--------------------+-----+
|            Anguilla|    1|
|              Russia|    1|
|            Paraguay|    1|
|             Senegal|    1|
|              Sweden|    1|
|            Kiribati|    1|
|              Guyana|    1|
|         Philippines|    1|
|            Djibouti|    1|
|            Malaysia|    1|
|           Singapore|    1|
|                Fiji|    1|
|              Turkey|    1|
|                Iraq|    1|
|             Germany|    1|
|              Jordan|    1|
|               Palau|    1|
|Turks and Caicos ...|    1|
|              France|    1|
|              Greece|    1|
+--------------------+-----+
only showing top 20 rows

In [186]:
from pyspark.sql.functions import max

flightData2015.select(max("count")).take(1)

[Row(max(count)=370002)]

In [187]:
maxSql = spark.sql("""
SELECT DEST_COUNTRY_NAME, sum(count) as destination_total
FROM flight_data_2015
GROUP BY DEST_COUNTRY_NAME
ORDER BY sum(count) DESC
LIMIT 5
""")

maxSql.show()

+-----------------+-----------------+
|DEST_COUNTRY_NAME|destination_total|
+-----------------+-----------------+
|    United States|           411352|
|           Canada|             8399|
|           Mexico|             7140|
|   United Kingdom|             2025|
|            Japan|             1548|
+-----------------+-----------------+

In [188]:
from pyspark.sql.functions import desc

flightData2015\
  .groupBy("DEST_COUNTRY_NAME")\
  .sum("count")\
  .withColumnRenamed("sum(count)", "destination_total")\
  .sort(desc("destination_total"))\
  .limit(5)\
  .show()

+-----------------+-----------------+
|DEST_COUNTRY_NAME|destination_total|
+-----------------+-----------------+
|    United States|           411352|
|           Canada|             8399|
|           Mexico|             7140|
|   United Kingdom|             2025|
|            Japan|             1548|
+-----------------+-----------------+

## 다중 파일도 한방에 읽을 수 있지요...

In [190]:
staticDataFrame = spark.read.format("csv")\
  .option("header", "true")\
  .option("inferSchema", "true")\
  .load("data/retail-data/by-day/*.csv")

staticDataFrame.createOrReplaceTempView("retail_data")
staticSchema = staticDataFrame.schema

In [191]:
staticSchema

StructType(List(StructField(InvoiceNo,StringType,true),StructField(StockCode,StringType,true),StructField(Description,StringType,true),StructField(Quantity,IntegerType,true),StructField(InvoiceDate,TimestampType,true),StructField(UnitPrice,DoubleType,true),StructField(CustomerID,DoubleType,true),StructField(Country,StringType,true)))

In [192]:
staticDataFrame.count()

541909

In [193]:
spark.sql("select * from retail_data").show()

+---------+---------+--------------------+--------+-------------------+---------+----------+--------------+
|InvoiceNo|StockCode|         Description|Quantity|        InvoiceDate|UnitPrice|CustomerID|       Country|
+---------+---------+--------------------+--------+-------------------+---------+----------+--------------+
|   580538|    23084|  RABBIT NIGHT LIGHT|      48|2011-12-05 08:38:00|     1.79|   14075.0|United Kingdom|
|   580538|    23077| DOUGHNUT LIP GLOSS |      20|2011-12-05 08:38:00|     1.25|   14075.0|United Kingdom|
|   580538|    22906|12 MESSAGE CARDS ...|      24|2011-12-05 08:38:00|     1.65|   14075.0|United Kingdom|
|   580538|    21914|BLUE HARMONICA IN...|      24|2011-12-05 08:38:00|     1.25|   14075.0|United Kingdom|
|   580538|    22467|   GUMBALL COAT RACK|       6|2011-12-05 08:38:00|     2.55|   14075.0|United Kingdom|
|   580538|    21544|SKULLS  WATER TRA...|      48|2011-12-05 08:38:00|     0.85|   14075.0|United Kingdom|
|   580538|    23126|FELTCRAFT GIRL AM...|       8|2011-12-05 08:38:00|     4.95|   14075.0|United Kingdom|
|   580538|    21833|CAMOUFLAGE LED TORCH|      24|2011-12-05 08:38:00|     1.69|   14075.0|United Kingdom|
|   580539|    21479|WHITE SKULL HOT W...|       4|2011-12-05 08:39:00|     4.25|   18180.0|United Kingdom|
|   580539|   84030E|ENGLISH ROSE HOT ...|       4|2011-12-05 08:39:00|     4.25|   18180.0|United Kingdom|
|   580539|    23355|HOT WATER BOTTLE ...|       4|2011-12-05 08:39:00|     4.95|   18180.0|United Kingdom|
|   580539|    22111|SCOTTIE DOG HOT W...|       3|2011-12-05 08:39:00|     4.95|   18180.0|United Kingdom|
|   580539|    21115|ROSE CARAVAN DOOR...|       8|2011-12-05 08:39:00|     1.95|   18180.0|United Kingdom|
|   580539|    21411|GINGHAM HEART  DO...|       8|2011-12-05 08:39:00|     1.95|   18180.0|United Kingdom|
|   580539|    23235|STORAGE TIN VINTA...|      12|2011-12-05 08:39:00|     1.25|   18180.0|United Kingdom|
|   580539|    23239|SET OF 4 KNICK KN...|       6|2011-12-05 08:39:00|     1.65|   18180.0|United Kingdom|
|   580539|    22197|      POPCORN HOLDER|      36|2011-12-05 08:39:00|     0.85|   18180.0|United Kingdom|
|   580539|    22693|GROW A FLYTRAP OR...|      24|2011-12-05 08:39:00|     1.25|   18180.0|United Kingdom|
|   580539|    22372|AIRLINE BAG VINTA...|       4|2011-12-05 08:39:00|     4.25|   18180.0|United Kingdom|
|   580539|    22375|AIRLINE BAG VINTA...|       4|2011-12-05 08:39:00|     4.25|   18180.0|United Kingdom|
+---------+---------+--------------------+--------+-------------------+---------+----------+--------------+
only showing top 20 rows

In [194]:
spark.sql("select * from retail_data where InvoiceDate > ''").show()

+---------+---------+--------------------+--------+-------------------+---------+----------+--------------+
|InvoiceNo|StockCode|         Description|Quantity|        InvoiceDate|UnitPrice|CustomerID|       Country|
+---------+---------+--------------------+--------+-------------------+---------+----------+--------------+
|   580538|    23084|  RABBIT NIGHT LIGHT|      48|2011-12-05 08:38:00|     1.79|   14075.0|United Kingdom|
|   580538|    23077| DOUGHNUT LIP GLOSS |      20|2011-12-05 08:38:00|     1.25|   14075.0|United Kingdom|
|   580538|    22906|12 MESSAGE CARDS ...|      24|2011-12-05 08:38:00|     1.65|   14075.0|United Kingdom|
|   580538|    21914|BLUE HARMONICA IN...|      24|2011-12-05 08:38:00|     1.25|   14075.0|United Kingdom|
|   580538|    22467|   GUMBALL COAT RACK|       6|2011-12-05 08:38:00|     2.55|   14075.0|United Kingdom|
|   580538|    21544|SKULLS  WATER TRA...|      48|2011-12-05 08:38:00|     0.85|   14075.0|United Kingdom|
|   580538|    23126|FELTCRAFT GIRL AM...|       8|2011-12-05 08:38:00|     4.95|   14075.0|United Kingdom|
|   580538|    21833|CAMOUFLAGE LED TORCH|      24|2011-12-05 08:38:00|     1.69|   14075.0|United Kingdom|
|   580539|    21479|WHITE SKULL HOT W...|       4|2011-12-05 08:39:00|     4.25|   18180.0|United Kingdom|
|   580539|   84030E|ENGLISH ROSE HOT ...|       4|2011-12-05 08:39:00|     4.25|   18180.0|United Kingdom|
|   580539|    23355|HOT WATER BOTTLE ...|       4|2011-12-05 08:39:00|     4.95|   18180.0|United Kingdom|
|   580539|    22111|SCOTTIE DOG HOT W...|       3|2011-12-05 08:39:00|     4.95|   18180.0|United Kingdom|
|   580539|    21115|ROSE CARAVAN DOOR...|       8|2011-12-05 08:39:00|     1.95|   18180.0|United Kingdom|
|   580539|    21411|GINGHAM HEART  DO...|       8|2011-12-05 08:39:00|     1.95|   18180.0|United Kingdom|
|   580539|    23235|STORAGE TIN VINTA...|      12|2011-12-05 08:39:00|     1.25|   18180.0|United Kingdom|
|   580539|    23239|SET OF 4 KNICK KN...|       6|2011-12-05 08:39:00|     1.65|   18180.0|United Kingdom|
|   580539|    22197|      POPCORN HOLDER|      36|2011-12-05 08:39:00|     0.85|   18180.0|United Kingdom|
|   580539|    22693|GROW A FLYTRAP OR...|      24|2011-12-05 08:39:00|     1.25|   18180.0|United Kingdom|
|   580539|    22372|AIRLINE BAG VINTA...|       4|2011-12-05 08:39:00|     4.25|   18180.0|United Kingdom|
|   580539|    22375|AIRLINE BAG VINTA...|       4|2011-12-05 08:39:00|     4.25|   18180.0|United Kingdom|
+---------+---------+--------------------+--------+-------------------+---------+----------+--------------+
only showing top 20 rows

## 윈도우함수(랭킹함수) 활용

In [195]:
simpleData = (("James", "Sales", 3000), \
    ("Michael", "Sales", 4600),  \
    ("Robert", "Sales", 4100),   \
    ("Maria", "Finance", 3000),  \
    ("Scott", "Finance", 3300),  \
    ("Jen", "Finance", 3900),    \
    ("Jeff", "Marketing", 3000), \
    ("Kumar", "Marketing", 2000),\
    ("Saif", "Sales", 4100) \
  )
 
columns= ["employee_name", "department", "salary"]
df = spark.createDataFrame(data = simpleData, schema = columns)
df.printSchema()
df.show(truncate=False)

root
 |-- employee_name: string (nullable = true)
 |-- department: string (nullable = true)
 |-- salary: long (nullable = true)

+-------------+----------+------+
|employee_name|department|salary|
+-------------+----------+------+
|James        |Sales     |3000  |
|Michael      |Sales     |4600  |
|Robert       |Sales     |4100  |
|Maria        |Finance   |3000  |
|Scott        |Finance   |3300  |
|Jen          |Finance   |3900  |
|Jeff         |Marketing |3000  |
|Kumar        |Marketing |2000  |
|Saif         |Sales     |4100  |
+-------------+----------+------+

In [196]:
from pyspark.sql.window import Window
from pyspark.sql.functions import row_number
windowSpec  = Window.partitionBy("department").orderBy("salary")

df.withColumn("row_number",row_number().over(windowSpec)) \
    .show(truncate=False)

+-------------+----------+------+----------+
|employee_name|department|salary|row_number|
+-------------+----------+------+----------+
|James        |Sales     |3000  |1         |
|Robert       |Sales     |4100  |2         |
|Saif         |Sales     |4100  |3         |
|Michael      |Sales     |4600  |4         |
|Maria        |Finance   |3000  |1         |
|Scott        |Finance   |3300  |2         |
|Jen          |Finance   |3900  |3         |
|Kumar        |Marketing |2000  |1         |
|Jeff         |Marketing |3000  |2         |
+-------------+----------+------+----------+

In [197]:
from pyspark.sql.functions import rank
df.withColumn("rank",rank().over(windowSpec)) \
    .show()

+-------------+----------+------+----+
|employee_name|department|salary|rank|
+-------------+----------+------+----+
|        James|     Sales|  3000|   1|
|       Robert|     Sales|  4100|   2|
|         Saif|     Sales|  4100|   2|
|      Michael|     Sales|  4600|   4|
|        Maria|   Finance|  3000|   1|
|        Scott|   Finance|  3300|   2|
|          Jen|   Finance|  3900|   3|
|        Kumar| Marketing|  2000|   1|
|         Jeff| Marketing|  3000|   2|
+-------------+----------+------+----+

In [198]:
from pyspark.sql.functions import dense_rank
df.withColumn("dense_rank",dense_rank().over(windowSpec)) \
    .show()

+-------------+----------+------+----------+
|employee_name|department|salary|dense_rank|
+-------------+----------+------+----------+
|        James|     Sales|  3000|         1|
|       Robert|     Sales|  4100|         2|
|         Saif|     Sales|  4100|         2|
|      Michael|     Sales|  4600|         3|
|        Maria|   Finance|  3000|         1|
|        Scott|   Finance|  3300|         2|
|          Jen|   Finance|  3900|         3|
|        Kumar| Marketing|  2000|         1|
|         Jeff| Marketing|  3000|         2|
+-------------+----------+------+----------+

## 웹사이트에서 데이터 읽어오기

In [199]:
from pyspark import SparkFiles

spark.sparkContext.addFile("https://raw.githubusercontent.com/guru99-edu/R-Programming/master/adult_data.csv")
df = spark.read.csv(SparkFiles.get("adult_data.csv"), header=True, inferSchema=True)

In [200]:
df.printSchema ()

root
 |-- x: integer (nullable = true)
 |-- age: integer (nullable = true)
 |-- workclass: string (nullable = true)
 |-- fnlwgt: integer (nullable = true)
 |-- education: string (nullable = true)
 |-- educational-num: integer (nullable = true)
 |-- marital-status: string (nullable = true)
 |-- occupation: string (nullable = true)
 |-- relationship: string (nullable = true)
 |-- race: string (nullable = true)
 |-- gender: string (nullable = true)
 |-- capital-gain: integer (nullable = true)
 |-- capital-loss: integer (nullable = true)
 |-- hours-per-week: integer (nullable = true)
 |-- native-country: string (nullable = true)
 |-- income: string (nullable = true)

In [201]:
df.show(5, truncate = False)

+---+---+---------+------+------------+---------------+------------------+-----------------+------------+-----+------+------------+------------+--------------+--------------+------+
|x  |age|workclass|fnlwgt|education   |educational-num|marital-status    |occupation       |relationship|race |gender|capital-gain|capital-loss|hours-per-week|native-country|income|
+---+---+---------+------+------------+---------------+------------------+-----------------+------------+-----+------+------------+------------+--------------+--------------+------+
|1  |25 |Private  |226802|11th        |7              |Never-married     |Machine-op-inspct|Own-child   |Black|Male  |0           |0           |40            |United-States |<=50K |
|2  |38 |Private  |89814 |HS-grad     |9              |Married-civ-spouse|Farming-fishing  |Husband     |White|Male  |0           |0           |50            |United-States |<=50K |
|3  |28 |Local-gov|336951|Assoc-acdm  |12             |Married-civ-spouse|Protective-serv  |Husband     |White|Male  |0           |0           |40            |United-States |>50K  |
|4  |44 |Private  |160323|Some-college|10             |Married-civ-spouse|Machine-op-inspct|Husband     |Black|Male  |7688        |0           |40            |United-States |>50K  |
|5  |18 |?        |103497|Some-college|10             |Never-married     |?                |Own-child   |White|Female|0           |0           |30            |United-States |<=50K |
+---+---+---------+------+------------+---------------+------------------+-----------------+------------+-----+------+------------+------------+--------------+--------------+------+
only showing top 5 rows

In [202]:
df.select('age','fnlwgt').show(5)

+---+------+
|age|fnlwgt|
+---+------+
| 25|226802|
| 38| 89814|
| 28|336951|
| 44|160323|
| 18|103497|
+---+------+
only showing top 5 rows

In [203]:
df.groupBy("education").count().sort("count",ascending=True).show()

+------------+-----+
|   education|count|
+------------+-----+
|   Preschool|   83|
|     1st-4th|  247|
|     5th-6th|  509|
|   Doctorate|  594|
|        12th|  657|
|         9th|  756|
| Prof-school|  834|
|     7th-8th|  955|
|        10th| 1389|
|  Assoc-acdm| 1601|
|        11th| 1812|
|   Assoc-voc| 2061|
|     Masters| 2657|
|   Bachelors| 8025|
|Some-college|10878|
|     HS-grad|15784|
+------------+-----+

In [204]:
df.describe().show()

+-------+------------------+------------------+-----------+------------------+------------+------------------+--------------+----------------+------------+------------------+------+------------------+-----------------+------------------+--------------+------+
|summary|                 x|               age|  workclass|            fnlwgt|   education|   educational-num|marital-status|      occupation|relationship|              race|gender|      capital-gain|     capital-loss|    hours-per-week|native-country|income|
+-------+------------------+------------------+-----------+------------------+------------+------------------+--------------+----------------+------------+------------------+------+------------------+-----------------+------------------+--------------+------+
|  count|             48842|             48842|      48842|             48842|       48842|             48842|         48842|           48842|       48842|             48842| 48842|             48842|            48842|             48842|         48842| 48842|
|   mean|           24421.5| 38.64358543876172|       null|189664.13459727284|        null|10.078088530363212|          null|            null|        null|              null|  null|1079.0676262233324|87.50231358257237|40.422382375824085|          null|  null|
| stddev|14099.615260708357|13.710509934443525|       null|105604.02542315757|        null| 2.570972755592259|          null|            null|        null|              null|  null| 7452.019057655418| 403.004552124359|12.391444024252312|          null|  null|
|    min|                 1|                17|          ?|             12285|        10th|                 1|      Divorced|               ?|     Husband|Amer-Indian-Eskimo|Female|                 0|                0|                 1|             ?| <=50K|
|    max|             48842|                90|Without-pay|           1490400|Some-college|                16|       Widowed|Transport-moving|        Wife|             White|  Male|             99999|             4356|                99|    Yugoslavia|  >50K|
+-------+------------------+------------------+-----------+------------------+------------+------------------+--------------+----------------+------------+------------------+------+------------------+-----------------+------------------+--------------+------+

In [205]:
df.describe('capital-gain').show()

+-------+------------------+
|summary|      capital-gain|
+-------+------------------+
|  count|             48842|
|   mean|1079.0676262233324|
| stddev| 7452.019057655418|
|    min|                 0|
|    max|             99999|
+-------+------------------+

In [206]:
df.filter(df.age > 40).count()

20211

## 다양한 집계(aggregation) 함수들

In [207]:
import pyspark
from pyspark.sql import SparkSession
from pyspark.sql.functions import approx_count_distinct,collect_list
from pyspark.sql.functions import collect_set,sum,avg,max,countDistinct,count
from pyspark.sql.functions import first, last, kurtosis, min, mean, skewness 
from pyspark.sql.functions import stddev, stddev_samp, stddev_pop, sumDistinct
from pyspark.sql.functions import variance,var_samp,  var_pop

simpleData = [
    ("Michael", "Sales", 4600),
    ("Robert", "Sales", 4100),
    ("Maria", "Finance", 3000),
    ("James", "Sales", 3000),
    ("Scott", "Finance", 3300),
    ("Jen", "Finance", 3900),
    ("Jeff", "Marketing", 3000),
    ("Kumar", "Marketing", 2000),
    ("Saif", "Sales", 4100)
  ]
schema = ["employee_name", "department", "salary"]
  
df = spark.createDataFrame(data=simpleData, schema = schema)
df.printSchema()
df.show(truncate=False)

print("approx_count_distinct: " + \
      str(df.select(approx_count_distinct("salary")).collect()[0][0]))

print("avg: " + str(df.select(avg("salary")).collect()[0][0]))

df.select(collect_list("salary")).show(truncate=False)

df.select(collect_set("salary")).show(truncate=False)

df2 = df.select(countDistinct("department", "salary"))
df2.show(truncate=False)
print("Distinct Count of Department & Salary: "+str(df2.collect()[0][0]))

print("count: "+str(df.select(count("salary")).collect()[0]))
df.select(first("salary")).show(truncate=False)
df.select(last("salary")).show(truncate=False)
df.select(kurtosis("salary")).show(truncate=False)
df.select(max("salary")).show(truncate=False)
df.select(min("salary")).show(truncate=False)
df.select(mean("salary")).show(truncate=False)
df.select(skewness("salary")).show(truncate=False)
df.select(stddev("salary"), stddev_samp("salary"), \
    stddev_pop("salary")).show(truncate=False)
df.select(sum("salary")).show(truncate=False)
df.select(sumDistinct("salary")).show(truncate=False)
df.select(variance("salary"),var_samp("salary"),var_pop("salary")) \
  .show(truncate=False)

root
 |-- employee_name: string (nullable = true)
 |-- department: string (nullable = true)
 |-- salary: long (nullable = true)

+-------------+----------+------+
|employee_name|department|salary|
+-------------+----------+------+
|Michael      |Sales     |4600  |
|Robert       |Sales     |4100  |
|Maria        |Finance   |3000  |
|James        |Sales     |3000  |
|Scott        |Finance   |3300  |
|Jen          |Finance   |3900  |
|Jeff         |Marketing |3000  |
|Kumar        |Marketing |2000  |
|Saif         |Sales     |4100  |
+-------------+----------+------+

approx_count_distinct: 6
avg: 3444.4444444444443
+------------------------------------------------------+
|collect_list(salary)                                  |
+------------------------------------------------------+
|[4600, 4100, 3000, 3000, 3300, 3900, 3000, 2000, 4100]|
+------------------------------------------------------+

+------------------------------------+
|collect_set(salary)                 |
+------------------------------------+
|[4600, 3000, 3900, 4100, 3300, 2000]|
+------------------------------------+

+----------------------------------+
|count(DISTINCT department, salary)|
+----------------------------------+
|8                                 |
+----------------------------------+

Distinct Count of Department & Salary: 8
count: Row(count(salary)=9)
+-------------+
|first(salary)|
+-------------+
|4600         |
+-------------+

+------------+
|last(salary)|
+------------+
|4100        |
+------------+

+-------------------+
|kurtosis(salary)   |
+-------------------+
|-0.6953888522988017|
+-------------------+

+-----------+
|max(salary)|
+-----------+
|4600       |
+-----------+

+-----------+
|min(salary)|
+-----------+
|2000       |
+-----------+

+------------------+
|avg(salary)       |
+------------------+
|3444.4444444444443|
+------------------+

+--------------------+
|skewness(salary)    |
+--------------------+
|-0.28089138971711725|
+--------------------+

+-------------------+-------------------+------------------+
|stddev_samp(salary)|stddev_samp(salary)|stddev_pop(salary)|
+-------------------+-------------------+------------------+
|798.6099033807294  |798.6099033807294  |752.9366376043297 |
+-------------------+-------------------+------------------+

+-----------+
|sum(salary)|
+-----------+
|31000      |
+-----------+

+--------------------+
|sum(DISTINCT salary)|
+--------------------+
|20900               |
+--------------------+

+-----------------+-----------------+-----------------+
|var_samp(salary) |var_samp(salary) |var_pop(salary)  |
+-----------------+-----------------+-----------------+
|637777.7777777779|637777.7777777779|566913.5802469137|
+-----------------+-----------------+-----------------+

## UDF(User Defined Function) 활용

In [208]:
emp

DataFrame[empno: int, ename: string, job: string, mgr: int, hiredate: timestamp, sal: int, comm: int, deptno: int]

In [209]:
def detGrade(sal):
    Q = 'E'
    if(sal > 4000):
        Q = 'A'
    elif(sal > 3000):
        Q = 'B'
    elif(sal > 2000):
        Q = 'C'
    elif(sal > 1000):
        Q = 'D'
    return Q

In [210]:
from pyspark.sql.functions import udf
from pyspark.sql.types import StringType

grade = udf(detGrade, StringType())

In [211]:
newemp = emp.withColumn("grade", grade('sal'))
newemp.show()

+-----+------+---------+----+-------------------+----+----+------+-----+
|empno| ename|      job| mgr|           hiredate| sal|comm|deptno|grade|
+-----+------+---------+----+-------------------+----+----+------+-----+
| 7369| SMITH|    CLERK|7902|1980-12-17 00:00:00| 800|null|    20|    E|
| 7499| ALLEN| SALESMAN|7698|1981-02-20 00:00:00|1600| 300|    30|    D|
| 7521|  WARD| SALESMAN|7698|1981-02-03 00:00:00|1250| 500|    30|    D|
| 7566| JONES|  MANAGER|7839|1981-03-02 00:00:00|2975|null|    20|    C|
| 7654|MARTIN| SALESMAN|7698|1981-10-22 00:00:00|1250|1400|    30|    D|
| 7698| BLAKE|  MANAGER|7839|1981-05-01 00:00:00|2850|null|    30|    C|
| 7782| CLARK|  MANAGER|7839|1981-09-06 00:00:00|2450|null|    10|    C|
| 7788| SCOTT|  ANALYST|7566|1982-12-08 00:00:00|3000|null|    20|    C|
| 7839|  KING|PRESIDENT|null|1981-11-17 00:00:00|5000|null|    10|    A|
| 7844|TURNER| SALESMAN|7698|1984-10-08 00:00:00|1500|null|    30|    D|
| 7876| ADAMS|    CLERK|7788|1983-01-12 00:00:00|1100|null|    20|    D|
| 7900| JAMES|    CLERK|7698|1981-12-03 00:00:00| 950|null|    30|    E|
| 7902|  FORD|  ANALYST|7566|1981-12-13 00:00:00|3000|null|    20|    C|
| 7934|MILLER|    CLERK|7782|1982-01-25 00:00:00|1300|null|    10|    D|
+-----+------+---------+----+-------------------+----+----+------+-----+

In [212]:
columns = ["Seqno","Name"]
data = [("1", "john jones"),
    ("2", "tracey smith"),
    ("3", "amy sanders")]

df = spark.createDataFrame(data=data,schema=columns)

df.show(truncate=False)

+-----+------------+
|Seqno|Name        |
+-----+------------+
|1    |john jones  |
|2    |tracey smith|
|3    |amy sanders |
+-----+------------+

In [213]:
def convertCase(str):
    resStr=""
    arr = str.split(" ")
    for x in arr:
       resStr= resStr + x[0:1].upper() + x[1:len(x)] + " "
    return resStr 

convertUDF = udf(lambda z: convertCase(z))

df.select(col("Seqno"), \
    convertUDF(col("Name")).alias("Name") ) \
.show(truncate=False)

+-----+-------------+
|Seqno|Name         |
+-----+-------------+
|1    |John Jones   |
|2    |Tracey Smith |
|3    |Amy Sanders  |
+-----+-------------+

In [214]:
# AWS-LINUX

import findspark
findspark.init("/opt/spark")

In [215]:
import pyspark
from pyspark.sql import SparkSession

In [216]:
spark = SparkSession.builder.getOrCreate()
spark

### Spark을 사용하여 hotel.txt파일의 내용으로 텍스트 마이닝을 해보자~
#### hotel.txt 파일에서 가장 많이 등장한 명사들을 많이 등장한 순으로 30개를 출력해 본다.

In [217]:
hoteldf = spark.read.text("data/hotel.txt") 
hoteldf.show(3)

+-----------------------------------+
|                              value|
+-----------------------------------+
|대중교통을 이용한다면 비추입니다...|
|  위치는 좋았는데, 가격대비 방이...|
|           만족하고 나왔습니다 ㅎㅎ|
+-----------------------------------+
only showing top 3 rows

In [218]:
print(hoteldf.take(3))

[Row(value='대중교통을 이용한다면 비추입니다. 역과 애매한 거리입니다. 시설은 너무 좋았어요 어메니티도 만족해요'), Row(value='위치는 좋았는데, 가격대비 방이 너무 작았던것 같아요 ㅜ 청결이라던지, 직원들 응대는 좋았지만 강남에서 이가격이면 그냥 쏘쏘한것 같긴 하네요'), Row(value='만족하고 나왔습니다 ㅎㅎ')]

In [219]:
imsi = hoteldf.collect()
print(imsi[:3])

[Row(value='대중교통을 이용한다면 비추입니다. 역과 애매한 거리입니다. 시설은 너무 좋았어요 어메니티도 만족해요'), Row(value='위치는 좋았는데, 가격대비 방이 너무 작았던것 같아요 ㅜ 청결이라던지, 직원들 응대는 좋았지만 강남에서 이가격이면 그냥 쏘쏘한것 같긴 하네요'), Row(value='만족하고 나왔습니다 ㅎㅎ')]

In [220]:
hotellist = [ x[0] for x in imsi ]
print(hotellist[:3])

['대중교통을 이용한다면 비추입니다. 역과 애매한 거리입니다. 시설은 너무 좋았어요 어메니티도 만족해요', '위치는 좋았는데, 가격대비 방이 너무 작았던것 같아요 ㅜ 청결이라던지, 직원들 응대는 좋았지만 강남에서 이가격이면 그냥 쏘쏘한것 같긴 하네요', '만족하고 나왔습니다 ㅎㅎ']

In [221]:
hotelstr = ' '.join(hotellist)
print(hotelstr[:50])

대중교통을 이용한다면 비추입니다. 역과 애매한 거리입니다. 시설은 너무 좋았어요 어메니티도

In [222]:
import re

hangul = re.compile('[^ ㄱ-ㅣ가-힣]+') 
hangul.sub('', hotelstr) # 한글과 띄어쓰기를 제외한 모든 부분을 제거

'대중교통을 이용한다면 비추입니다 역과 애매한 거리입니다 시설은 너무 좋았어요 어메니티도 만족해요 위치는 좋았는데 가격대비 방이 너무 작았던것 같아요 ㅜ 청결이라던지 직원들 응대는 좋았지만 강남에서 이가격이면 그냥 쏘쏘한것 같긴 하네요 만족하고 나왔습니다 ㅎㅎ 위치는 두개의 역 중간즈음이라 좋지 않음 짐이 없고 날씨가 좋으면 다닐만 함 화장실에서 하수구냄새 가 난다는 후기를 많이 봐서 예약시 냄새안나는 방으로 요청했고 체크인시 물어봤더니 더블체크했다고 함 막상 사용해보니 냄새는 괜찮았는데 화장실쪽에서 자꾸 이상한 소리가 남 아마도 다른방 환풍기 같은게 돌아가는 소리같은데 박하는동안 밤마다 소리가 나서 좀 신경쓰였음 층 후문쪽에 바로 세븐일레븐 편의점이 있어서 편했고 점심에 먹은 호텔 부페가 맛있었음 투숙객  정도 할인되었던듯 층에 수라선이라는 식당 아주 맛있음 수라선 옆에 빌리엔젤도 있으니 식사후 후식먹기 딱 좋음 방도 생각보다 넓고 창문이 일단 커서 너무 좋았어요 그리고 역시 소문대로 침구는 정말 편했습니다모든게 다 좋았지만 지하철역과 멀어서 교통 부분이 조금 아쉬웠어요 그리고 방에 들어가서 베개를 보는데 얼룩과 먼지가 조금 있어 청소는 조금 아쉬웠지만 그거 빼고는 다 너무 만족스러웠습니다 깔끔하고 조용해서 좋았어요 지하철 역이 약간 먼게 흠 주차타워가 아닌 지하 주차장 이라서 체크아웃 시간에 한참 기다릴 일도 없고 시설도 깔끔하고 관리가 잘 되고 있는 것 같습니다 직원분의 친절도는 너무 최상등급 이라서 기분까지 좋았습니다 근처에 있는 서초나 콧대높은 구로는 비교가 안됩니다 신라스테이 서울 원탑은 역삼서대문서초 외구로 인 것 같습니다 위치도 지하철이 가까이 있어서 너무 좋았고 숙소도 방은 작지만 아늑하고 깨끗했어요 다만 엘레베이터가 세대인데 층수가 높아 한참 기다려야하는게 살짝 불편했고 방음도 쪼끔 안되는것 같았어요 다행히 옆방에혹은 위아래층에 있는 아기가 일찍 잠드는 듯해서 저희도 잘 쉬다 왔어요 위치도 서비스도 청결도 너무 좋았어요 전철을 타는경우만 말고 다 좋았습니다 감사합니다 기대를 많이 해서 그런지가격대비 실망감이 컸음 어메니티는 아베다 제품이고 그외에 칫솔과 헤어캡 화장솜 면봉헤어 드라이어가 구비되어있어요 면도기와 샤워볼은 없으니 챙겨가세요 생수병이 무료로 제공되고 커피팩개와 티백 몇가지가 구비되어 있습니다 조식뷔페가 좋다는 평이 많으나 출장 일정이 빡빡해서 이용해보진 못했어요 헬스장 유료로 이용가능하고 따로 회의가능한 비지니스 라운지도 마련되어 있습니다 인원수대로 사용가능하게 수건은 충분했습니다 샤워가운은 인실이다 보니 개가 있었고 타월 형태의 두꺼운 재질이라 물기는 잘흡수해요 회용 슬리퍼가 부직포같은 재질인데 좀 별로였어요신고 벗기가 불편했네요 엘리베이터에서 객실로 올라가려면 카드키를 찍어야 버튼을 누를수있기 때문에 보안성은 좋은편이예요 로비가 층이예요 당황하지 마시고 엘리베이터 타고 층올라와서 안쪽으로 들어오면 프론트가 있습니다 직원이 솔직히 불친절했어요 체크아웃할때 남직원 분은 친절하셨는데 체크인 할때 여직원 분은 불친절했네요 출장이나 여행 때문에 여기저기 호텔 많이 다녀왔지만 불친절하다고 느낀건 여기가 처음이였어요 첫 체크인부터 그러니 솔직히 별로 다시 가고 싶지 않은 기분이네요 룸은 다소 작은 편이지만 그래도 충분히 공간 활용이 가능하고 문이 특이했어요 침대쪽에 미닫이 문이있는데 현관 안보이게 닫으면 샤워실이 보입니다 ㅇㅅㅇ 마지막으로 방음 안됩니다 룸안에 있는데 지나가는 다른 투숙객들 얘기하는 소리가 다들려요 바로 앞에 버스정류장이 있어서 버스이동은 편하지만 지하철이동시 역삼역에서 분 걸어올라와야해요 영어와 한국어 지원합니다 층입구에서 나와서 왼쪽으로 돌아들어가면 편의점 있어요  위생  보이는 곳만 청소가 되어 있음 바닥에 먼지는 당연하고 이전 사용자의 쓰레기들까지 치워지지 않음  위치  웨딩홀과 붙어 있어 주말에는 엘레베이터 타는 게 짜증이 나는 수준 대부분 차를 가지고 올텐데 주차는 편리하나 들락날락 하기가 보통 일이 아님  서비스  직원들은 친절함 다만 호실 수 대비 가습기나 공기청정기가 지나치게 부족한 게 아닌지요  가성비  웨딩홀 때문에 항상 일정 수요가 있는 곳이라 그런지 가격이 저렴하지도 않은데 얻는 불편함은 상당한 곳 가로수길 청담 쪽 돌아다니기는 편리하지만 어차피 차로 가야 하는 거리라 강남 어디든 큰 차이 없을 듯 직원들이        에 진심으로 감사드립니다 다만 몇명의 청소부 아주머니께서 일을 보여주기 위해서 하는둥 마는둥 하는 경우를 보았습니다 정작 필요한 것은 챙겨놓지 않고 대충 청소를 오후 시에 끝내고 가시는 경우 오전에 한다고 큰소리 치고 일이 너무 많아서 못했다고 진정성 없는 태도와 정작 타월과 물도 하나도  없이 해놓은 을 보고 실망을 종종 하였습니다 매일 요청을 드리면 네 잘 알겠습니다 시원한 대답과 달리 은 전혀  이 되어 있지 않았습니다 잠자리가 참 편합니다 다만 옆방의 소리가 너무 잘 들려서   가 매우 불만족 스럽습니다  이건 점수 빵점입니다 위치 좋고 숙소 위생상태 청결도 매우 좋습니다 다만 매우 아쉬웠던 점은 방음이 전혀 안된다는 사실입니다 옆방에서 이야기하는 소리까지 들리는건 조금 너무 했다 싶습니다 스탠다드 객실쪽은 방음부분에 있어서 완전히 포기하시길 바랍니다 객실과 객실사이가 가벽설치 수준인지라 옆방에 사람이 들어왓는지 나가는지 캐리어를 옮기는지 말을 거는지 모든 소리가 오픈되어있습니다 감성충만하기도하고 비즈니스호텔로도 너무나도 좋은곳입니다 특히 객실상태가 아주 좋아서 편히 자고일어났습니다 신라스테이는 조식먹으러 가는곳 깨끗하고 넓직하니 즐겁게 놀다 감 다만 에어콘이 팡팡 나오는 느낌이 없어서 아쉬움 깔끔한 모텔같았어요 깨끗하고 물품도 좋고 잘쉬었어요 신라호텔 계열사라 친절하고 깨끗했습니다 위치 시설 좋으나 가격이 비쌈 좋았음 외국인 관광객특히 중국인들이 많아서 밤에 시끄럽진 않을까 걱정됐는데 정말 조용하고 쾌적하게 쉬다왔습니다 층에 맛있는 케익파는 카페도 있고 편의점도 있어서 굉장히 편했어요 호캉스 보내기 좋을 것 같아요 굿굿굿굿굿굿굿굿굿굿굿굿굿굿굿굿굿굿굿굿굿굿굿굿굿굿굿굿굿굿굿굿굿굿굿굿굿 굿굿굿굿굿굿굿굿굿굿굿굿굿굿굿굿굿굿굿굿굿 굿굿굿굿굿굿굿굿굿굿굿굿굿굿굿굿굿굿굿굿굿굿굿굿굿굿굿굿굿 시간 일찍 체크인 가능했음 이불이 더러워서 교체해달라구함 바디로션이 개 있었고 린스가 없었음 직원분들이 매우 친절하심 ㅠㅠ 체크인 하고 친구랑 같이 강남쪽에서 밥먹고 밤늦게 들어왔는데요 아니 문이 망가져서 들어가지도 못하고 새벽시에 로비랑 왔다갔다했습니다 관리해주시는 분이 두명이오셔서 겨우 열어주셨는데 함께 따라온 여자 직원분이 저번에도 이랬었는데 하시는 소릴 들었어요 솔직히 화가 났습니다 졸려 죽겠는데 원래도 그랬던 적이 있었는데 시정이 안되어있었고 그런 방을 저희한테 줬다는게요 제가 바꿔줄수 없냐고 하니까 객실이 만실이라 그것도 어렵다며 그제서야 설명해주시더라구요 그런데 죄송하다는 한말씀도 없이 그냥 고치고만 가시고 물론 문이 계속 열리는지 몇번 확인하시고 가셨지만 저희는 아침에 문이 또 안열리면 어쩌나 걱정하고 잠들었습니다 저희가 아침에 약속이 있는데 늦으면 어쩌나 싶었죠 무튼 저는 신라스테이는 좋아하는데 역삼 지점직원분들 대처에 정말 유감이였습니다 위치가 저와는 맞지 않았지만 그래도 괜찮았어요 잠만 자고 나와서 특별히 나빴던 부분은 없었어요 직원의 체크인 실수가 있었지만 지배인님이 잘 처리 해주셨습니다 강남에는 타워 주차 아닌 곳을 찾기 힘든데 여기는 지하 주차장이 있어서 좋습니다 전반적으로 좋았습니다 프런트데스크의 여자분 웃음을 잊어 버리셨나요  일본손님을 모시고 갔는데 왜 단문 영어로 명령하듯이 패스포트와 크레딧카드를 요구하나요 안내한 사람은 뵈지도 않던가요 뭘 물어도 짜증은 왜 그리 내셨나요 당황하던 고객은 보이지도 않던가요 어디서 야단 맞았는지는 몰라도 왜 애꿎은 고객에게 화풀이를 하시나요 이부진부회장이 야심차게 사업을 벌이고 있는 호텔신라 계열사 맞나요 신라스테이모텔을 제가 잘못 본건가요 내 인생 최악의 접견입니다 어디다 이 화를 풀어야 할까요 신라스테이 홈페이지에는 고객의 소리를 듣는 곳도 없네요 직원들은 친절하고 좋았음 하지만 화장실에서 쫌 별로였음 세면대에서 손을 닦거나 양치질을 하거나 아무튼 세면대에서 물 사용을 하는데 사용한 물이 안 빠짐 박만 묵었고 내 몸이 힘들어서 조치를 취하진 않았지만 화장실세면대는 몇몇 호텔을 가봤지만 제일 별로였음 신라스테이라고 해서 조식을 먹어봤는데 다른건 그냥 그랬고 와플 맛있었음 와플은 진짜 여러번 가지고와서 먹음ㅎ 어쨌든 할인해서 간거라서 그렇지 돈 다 내고 갔음 쫌 억울했을듯 저 여행 진짜 많이 다니거든요 근데 이런 호텔 처음이었어요 일단 가격이 몹시 저렴했고 어메니티도 아베다에 혹해서 예약했죠 밤 늦게 들어가서 샤워하는데 욕실이 뭔가 싸했는데 다음날 아침 화장실 들어가니 정말 태어나서 한번도 안맡아본 냄새가 나는거예요 하수구 가스냄새도 아니고요 진짜 말도 안되는 냄새요 헛구역질 계속 하다 진짜 토할 것 같은데 그 화장실 들어가서 토를 못하겠더라고요 초인적인 힘으로 참고 참는데 그 냄새가 계속 떠올라서 그냥 아무 생각이 안나더라고요 처음엔 정말 이게 가능한 냄샌가 싶었는데 그날 약속 중요한게 있어서 일찍 일어난거였는데 약속 때문에 뭐라도 해야겠어서 직원 불렀고 직원이 확인한 뒤 시설 직원 불러주겠다 했습니다 시설 직원 한참 뒤에 나타났고 그 사이 약속 시간 다가오고 그러다 시간 걸리겠다고 다른 방에서 씻겠냐고 묻더라고요 그래서 옮기고 짐 옮기고 그냥 약속 늦었고요 역 가는데 왜이렇게 먼지 가는 길에도 헛구역질을 엄청나게 했습니다 약속 중에도요 정말 뭐였는지 확인이라도 하고 싶었는데 담당자가 주말이라 없다더군요 주중에 전화준다더니 오늘까지도 소식 없습니다 설명이라도 듣고 리뷰 올리고 싶었는데 그 냄새의 정체가 뭐였는지 아직도 확인 불가고욬ㅋㅋㅋ 위생 감이 오더라고요 수많은 호텔을 가봤고 불편 사항이 많았어요 그치만 매번 특급 호텔만 가는 것도 아니고 그냥 가성비 생각하며 넘겼고 리뷰도안달아봤지만 이번엔 정말 응대 직원은 괜찮았지만 관리자 태도도 화나고 리뷰 아주 아주 솔직하게 작성해요 호텔의 위치는 좋아서 교통편이 좋지만 사용감이 많은 만큼 벽지도 매우 지저분하고 변기도 상당히 더러워서 조금 놀랐습니다 가격대비 교통편이 최우선이 되어야 하는 분은 선택하시면 될 것 같습니다 위치가 생각보다 별로 화장실 냄새 올라와서 수건에까지 냄새나고 위생은 별로에요 변기 스위치도 고장나서 물도 안내려갔고 업그레이드 됐다고 하지만 룸이 많이 작았습니다 출입 카드에는 호실이 안적혀 있어서 기억해 두지 않으면 번거롭게 될 것입니다 전등 스위치도 강하게 누르지 않으면 잘 켜지지 않고요 여러모로 아쉬웠습니다 직원분들도 친절하고 침구도 편했어요 주변에 먹거리들도 있고 깔끔함 도로 앞이라 밤에 차 소리가 심해용 방음도 잘 안돼요 비즈니스 호텔로 편리하고 직원과 위생상태 편의시설 모두 만족 스러웠습니다 침대시트 구멍나있었어요 조식에 김치가 다 떨어졌다고 하고 기대 이하입니다 방도 청결하고 조식도 맛있었어요 히터를 틀었는데 온도가 다음날 올라가더라구요 그게 좀 불편했어요 룸안에 벽이 부서져있다던가 하는 등의 부분의 수리가 필요한듯 보였습니다 이런 부분 외에는 전체적으로는 만족했습니다 가격대가 조금 비싸다고 느낄 수 있으나 깨끗하고 편안합니다 위치나 뭐나머지 나무랄데가 없죠 가격대비 최고인듯 해요모든게편하고 좋아요 닥터자르트 행사도 좋았고 혼자서 조용히 잘 자고 갑니다 감사합니다 차분하고 고급스런 분위기 항상 만족 입니다 가격도 만족스럽고 위치도 좋습니다 룸상태도 좋았으나 옷장문이 안열려서 문의했는데 오셔서 잘 고쳐주셨습니다 다음에 이지역에 간다면 다시 이용할 계획입니다 조식도 먹을만 했습니다 위치가 어정쩡해서 주로 택시타고 이용했습니다 시설모두 만족했습니다 다만 추워서 라디에이터요구했지만 히터온도만 올리라는 답변을 받아 아쉬웠습니다 해도 온도가 안올라가 감기가걸렸어요 박했습니다만 박동안 침구 교체도 되지 않았고 화장실에 청소 걸래가 남아 있어 당황 했습니다 박때 방에서는 똥냄새가 났습니다 공항에서 오는 길이 교통체증이 너무 심해서 시간 분 이상이 걸렸다 친절하고 편하고 좋았어용 고급호텔에 어울리는 단정한 여자 직원 회사 근처라 기분내고싶을때 여기서 자는데 이번에도 넘 좋았네요 다음엔 조식도 같이먹으려구요 딱 신라스테이입니다 깨끗하고 너무 좋아요 정말 진심 좋습니다ㅎㅎ 침구가훌륭합니다 강남역 삼성역과 거리가 가까운 장점 단 차량 이용없이 갈만한 식당이나 놀거리가 없는 것은 단점 룸 컨디션 좋음 깨끗 비슷한 가격대에서 괜찮은 선택지 룸에 샤워부스  비데 방 따뜻  깔끔 조식간단 토스트 빵 샐러드 죽 쌀국수  개인적으로 도미인 서울 강남이 더 나으나 여기서는 쌀국수 제공 룸에 샤워부스  비데 방 따뜻  깔끔 조식간단 토스트 빵 샐러드 죽 쌀국수  개인적으로 도미인 서울 강남이 더 나으나 여기서는 쌀국수 제공 거리가걸어다니기엔 애매한거리들이였어요 앞에버스정류장이있긴해서 조금 편했던것같구 안에숙소는 깔끔 직원들이 바빠서 그런지 별로 친절하진않았음 만족했습니다 비즈니스 호텔로는 룸이 넓고 구조도 좋았습니다 어메니티도 아베다로 꽤 괜찮았구요 특히 조식 정말 짱 좋았습니다 조식 먹으러 또 가고 싶은 호텔입니다 아침 식사가 휼륭했어요 침대관리가 잘되어있데요 저는 자차를 이용해서 대중교통은 크게 상관은 없었는데요 차 없이 가는 분들은 조금 불편할 위치에요 지하철역이 걸어서 분정도 입니다 차로 가시는 분들은 지하주차장이 넉넉해서 주차문제는 걱정없습니다 그 외에는 룸컨디션도 다른지점 이용해봐서 변함없구요 신라스테이 항상 잘 이용하다 갑니당 ㄲㄲㄲㄲ 룸 컨디션 좋음 방 크기 적당함 작지만 소파가 있음 깔끔함 다만 대중교통 타기엔 위치가 약간 애매함 동 가격대 대비 괜찮은 선택 객실 관리가 아주 잘 되어있습니다 만족합니다 깔끔하고 강남권이라 편해요 주차시설 잘되어있고 근처 진입이 용이해서 좋았음 신라스테이 서초 주로 이용했는데 역삼점 주차장 넓어서 감탄 만원내외로 예약하면 리저너블 본인은 하루전에 갑자기 방잡아서 만원주고감 엘리베이터 프로그래밍을 좀 더 효율적으로 하면 좋을 거 같습니다 결혼식 전날 청담쪽으로 새벽에 메이크업 받으러 가야해서 하루 묵었어요 위치도 가깝고 적당히 조용하고 깔끔하니 괜찮았습니다 서울에서 병원 통원치료 할 일이 있어 묵었습니다 위치 좋고 룸컨디션도 좋습니다무엇보다 조식이 최고네요 위치도 좋고 조식도 룸컨디션도 최고 먼저 단점으로는 역에서 거리가 상당히 멀어요 그리고 룸에 먼지가 많다는 겁니다 그 외엔 직원들도 친절하고 그리 좁지 않은 룸에 조용하니 잘 쉬다 왔네요 조식도 맛있었고 층에 빌리엔젤과 편의점이 있어서 출출할 때 이용할 수 있어서 좋았습니다 우려했던거와는달리 호텔숙소는 깨끗한 편이었고 방이 생각보단 작았지만 하룻밤 묶기에는 괜찮았음 아침조식 깔끔하소 신선해서 만족함 명절이라서 주위에 먹거리가 거의 문을 닫아서 아쉬웠음 직원 응대와 친절도는 그렇다치자 그럴수 있다고 생각하고 이해해줄수 있다 룸 컨디션은 정말 최악이었다 화장실에서 시궁창냄새가 나 룸 교체 문제로 프론트에 연락했으나 받지않음 결국 데스크까지 내려가서 룸 교체함 방에 짐이많은지 물어보길래 많다고하니 알아서 짐을 옮기라고 함 객실청결 상태도 그냥 그럴수 있다고 치자 하지만 방에 사람이 있음에도 벨 누른후 청소 언제할건지 물어봄 엄연히 객실 청소해달라는 벨이 있음 그걸 누르지도 않은데 매번 그랬음 발수건이 있을때도 없을때도 있음 객실 바닥은 말하면 입만 아픔 박을 하면서 좋았던 기억이 한순간도없음 주말엔 결혼식 하객때문에 주차하기조차 힘듬 구분을 해주던가 안내를 하던가 신라스테이라는 브랜드를 믿었던 내 실수였음 신라스테이 해운대와는 전혀 상반된 직원태도에 맘 상함 처음에 욕조방 으로 달라고 말하고 확인까지 받고 올라갔는데 욕조 없는 방이었음 그래서 로비로 다시 내려가서 방 바꾸고 이틀 연박 했는데 주차도 하루만 등록 해 놔서 체크아웃때 주차비 청구됨 어이없어서 또 차 세워두고 다시 로비로 가서 얘기함 뭐 보상이라던지 죄송하다며 주는거 도없음 아 그리고 숙박중에는 카운터 아무리 전화해도 받지도 않음 죄송하다며 다음부터 잘하겠다고 했지만 다음엔 이용하지 않을것임 혼자 조용히 쉬는걸 좋아하는데 사실 은근 예민해서 잠자리 불편하면 잘 못자거든요 근데 여기 쉬던중 최고 가격대비 침대나 침구류도 너무 좋았고 조용해서 너무 잘자고 푹쉬었어요 물론 옆방에 어떤사람이 들어오냐에 따라 다르겠지만 멀리 가지 않아도 뷔페나 층 식당 카페 이용하면되니 그것도 너무 편했고 직원분들도 너무 친절하시고 감사합니다 덕분에 잘 쉬었어요 정말 오랜만에 신라스테이 투숙이라 설렘으로 방문 새벽에 체크인으로 이어서 한산하게 주차하고 층에 내렸는데 엄청 시끄러운 소리가 나길래  아 이시간에 체크인이 많나 하고 코너를 돌았는데 여직원 둘이 프론트에 앉아서 수다떨고 있더라고요 저를 발견하고 일어나더니 체크인 수속해주는데 프론트 안으로 보이는 테이블에 떡볶이 인지 뭐인지 모를 일회용 그릇에 담긴 음식들 아니 두명이면 교대로 먹던가 아님 백사이드에서 먹던가 요즘 벨 놓는 곳도 많던데 한시도 자리를 비우지 않도록 직원들 밥도 안먹이고 일시키나봐요 박일간 머물렀습니다 생긴지 얼마되지 않아 깨끗하고 객실은 그리 크지 않지만 둘이 머무르기에 그리 큰 불편함이 없었습니다 층에 머물렀는데 전망은 충현교회 반대편이라 그리 좋은 편은 아니고 바로 대로 앞이라 아침에는 차량소음으로 인해 숙면에 방해 되었습니다 방음처리가 그리 좋은 편은 아닌 것 같습니다 침대와 소파 데스크가 있어서 잠깐 이메일 업무를 보거나 차를 마실 수 있어 좋았고 바로 옆 건물에 아티제 커피샵과   바가 있어서 커피를 마시거나 위스키 한잔 하기에 편리합니다 매일 물도 병씩 채우주고 어메너티도 아베다 제품이라 잘 사용했습니다 하지만 위치가 역삼역에서 조금 걸어야 하는 거리라 지하철을 타기에는 불편합니다 저희의 목적지는 거의 근거리라 택시를 타고 다녔습니다 프론트 직원분들이 친절하고 추후 체크아웃 한 후에 컨시어지에 가방을 맡겨 놓을 수 있어 좋았습니다 박박박  추가 박을 묻는 내게 인터넷으로만 예약이 가능하다는 답을 하던 여직원 단 명의 퉁명스런 태도에 기분 상했지만 다른 모든 직원들의 태도는 이를 상쇄하고도 남을 만큼 친절하다 식사할인은 절대 없다는 그녀의 말과는 달리 인터넷 숙박예약시 식사도 할인이 있었다 현장식사할인은 없어도 인터넷 예약시 할인이 있을 수 있음을 알려주면 안되는 내부 규정이라도 있는 건지  여행숙박 사이트 마다 가격이 다르다 특별할인행사가 따로 있을때는 조금 더 싸더라 이 호텔은 여러 사이트들이 거의 같은 가격이었는데   그래서 첫 박은 만원 대 중간 박 만원 대 나중 박은 만원 대세금포함 결국 할인행사 중이라는 이 호텔사이트가 가장 비싼 경우였음  탈취제를 뿌렸음에도 불구하고 방안의 땀내 인내범벅된 냄새로 하루는 창문을 열고 자야했지만 다음날 방을 바꿔줘서 편히 지냇다 모두 합이 박이었고 총 개의 객실을 썼는데 침구와 방 욕실은 대체로 깨끗함 단 하나의 아쉬움은 욕실 수건이 새하얗지 않고 회색으로 진행 중 삶지 않고 세탁기로만 세탁하면 나타나는 한계치  위치는 조용하고 무난함 선릉역과 역삼역 중간 역까지 걸어서 분 전철역가는 중간에 버스 정류장 노선표를 참고하면 굳이 전철타지 않고 버스로 갈수 있는 경우도 있음 호텔 정문앞 버스 정류장 있음 전철역 가는 길 버스 정류장까지는 걸어서 분이내 호텔 정문 앞 뒤 택시 항시 대기  무료  그 외 컴퓨터  택배 퇴실후 짐 보관 무료주차 등 편의 서비스사용가능 운동시설 빼고 다 사용해 봄 서비스 만족  아침식사 한번 이용후 느낌  정갈하고 깔끔한 식당 내부 푸짐하지 않지만 비교적 다양한 음식종류 그럼에도 약간 비싸다는 느낌이 있음  비치된 물건 추가요금없이 사용 객실무료 생수와 다양한 티백도 즐길수 있어서 좋음  쇼핑을 위해서는 삼성역이나 강남역으로 가야하겟지만 근처 골목길과 테헤란로 대소 도로변에 소소한 볼거리 다양한 먹거리 있음  성 호텔 아닌 비지니스 호텔로 가격대비 만족함 교통 청결 서비스 새로지은 건물이기도 하고 청소 상태도 다른 비즈니스 호텔에 비해 매우 깔끔했습니다 보통 비즈니스호텔이라고 하고 모텔과 가까운 곳들이 많은데 이곳은 룸크기에 비해 넓은 책상과 여러가지 시설들이 비즈니스로 여행시 편리하게 갖추어져 있었습니다 전반적으로 조용한 호텔 분위기에 교통편이나 위치도 강남권에서 이동하기에 편리했습니다 앞으로 출장시 무조건 이 호텔로 예약할 것 같네요 기대 많이 하고 혼자 호캉스를 떠났는데 제 불찰이긴 하죠 확인을 안해 봤으니 스탠다드 룸에는 욕조가 없다고 합니다 호캉스의 묘미는 욕조에 입욕제 듬뿍넣고 버블배쓰 하는건데룸을 바꿀수 없냐고 물어보니 제가 이 룸을 예약 했기 때문에 어쩔 수 없다는 황당한 말그래서 못 바꾸냐니까 다른 룸도 다 예약이 이렇게나 많이 있다 하며 예약서 종이를 한 움큼 들어 저에게 보이더군요 순간 기분 나빴지만 제 휴가를 즐겁게 보내기 위해 아무소리 안하고 걍 잠만 푹 자다 왔습니다 기대 너무 많이 하지 마세요 직원도 예약이 정말 많다고 예약종이를 보여 줄 만큼 건방 터지는 호텔이니 그리고 그냥 비싼 모텔 수준 입니다 화장실만 깨끗하고 다른건 뭐 일반 호텔 수준이져아 그리고 좀 추워요 히터를 틀어도 춥더라구요 다신 안갑니다 아고다 기프트카드랑 이것저것 이용해서 디럭스룸에서 묵었습니다 욕조라던지 침대 바닥 복도 등 위생상태는 청결하고 방음이 안될거라 생각했는데 생각보다 조용하고 아늑해서 좋았습니다 호텔 옆동 커피케이바도 최고였고 조식도 베이커리가 훌륭했습니다 다만 아쉬운 점이 있다면 딱 비지니스 호텔답게 일반 여행객이 즐길만한 부대시설수영장이나 사우나 등이 부족한 점과 주변이 역삼역 부근 다른 호텔보다 맛집이라던가 크게 즐길거리가 없어 아쉬웠습니다 박 할거였고 룸은 아주 깨끗하고 침구도 푹신푹신해서 좋았습니다 다만 방이 너무 건조했고 옆방의 진동 소리가 계속 들릴 정도로 방음은 별로였어요 넘 좋았어요 강추강추 깨끗하고 편한게 잘 쉬다가 갑니다 좋아요 화장실 휴지통에 남이 쓰던 똥뭍은 휴지를 비우지않으셨습니다 늦은 체크인이라 그냥 넘어갔는데 굉장히 황당했습니다 주차는 편했는데 화장실에서 하수구냄새는 좀 나요 그치만 하루는 묵을만해요 위치가 애매해서 차가지고 가야 편할것 같아요 좁은건 미리 알고 있어서 막 좁다고 느끼진 않았고 한명이 머물기 좋은것 같아요 층에 바로 편의점이 있어서 좋았습니다 화장실은 청소가 좀 덜되있는것 같았어요 머리카락들이 있더군요 생각했던것보다 방크기나 티비가 작습니다 개별난방이 아닌지 온도를 높여놔도 따뜻하지않더라고요건조해서 가습기는 필수빨리 빌려야할것같습니다 위치 압박 빼고는 항상 좋음 가성비는 좋아서 자주 이용함 저렴할때 예약해서 만족합니다 조식 저는 좋았는데 대식가나 다양성을 추구하는 사람은 별로일듯 전반적으로 가격대비 만족스럽지만 갈때마다 편차가 심한것같더라구요 이번엔 다행히 괜찮았지만 아주 간혹 위아래층소음이 심한경우도있었습니다 방음이잘되는편은 아닌거같아요 또 객실예약시 어매니티요청을 미리 했는데 전달누락되어 약간의불펀을 겪었습니다 하지만 가격대비 훌륭합니다 조식이 특히 좋아요 말그대로 비추 침대사이즈가 엄청 작습니다 트윈룸이었는데 슈퍼싱글 정도 키 큰 분들 오시면 힘들것 같더군요 숙소위치도 애매합니다 비즈니스 출장 오신분들 타겟이라 그런지 역삼선릉 딱 중간이고 비탈길이라 캐리어 끌고오기 힘들었어요 가격은 쌌지만 여행으론 다시 오진 않을 듯 하네요 방은 좀 좁은 편이었지만 뷰가 탁 트여있어서 시원시원했고 위생상태도 아주 좋았어요 연말 시즌을 피했더라면 가격대비 만족도가 더 높았을 것 같아서 아쉬워요 위치는 역삼역과 선릉역 중간쯤이라 대중교통을 이용한다면 불편할 수도 있을 것 같습니다 직원분들은 모두 매우 친절하셨습니다 룸서비스 없음 룸까지 배달도 안 됨 보안을 위해서 엘리베이터에 키를 대야 층을 누를 수 있는 건 좋은데 룸키는 하나 한명이 나갔다가 들어오려면 한명은 불도 다 꺼진 방에 있어야함ㅋ 방음도 잘 안되서 옆방 소리가 다 들림 신라에서 운영했다기엔 좀 미흡하고 다른 호텔과 가격차이도 크지 않은데 너무 급이 떨어짐 신라계열이라고 해서 베딩이나 시설면을 걱정안했는데 두번은 안갈래요ㅠ 롯데 이랑 비교해서 금액도 비싸고 룸도 너무 싼티났어요 특히 벽걸이 티비 아래쪽 샤워룸도 타일 너무 지저분했어요 샤워기 헤드도 교체하셔야 할듯하네요 깔끔 정갈 가격은 쫌 비싼편인듯 조식종류다양 신라스테이 이름만 믿고 덜컥 예약했다가 완전 실망했어요 위치도 역에서 멀고 방에서 하수구냄새 올라오구 직원들도 계속 같은 상황인데 확인 또 확인서로 소통이 전혀 안되는 것 같았어요 그냥 묶으라고 해도 안갈거에요ㅜ 직원이 무척 불친절하네요 역삼역이나 선릉역 가까운줄 알았는데 제가 바보였습니다 역사이가 애매하고 멀어요 일찍 체크인했음에도 최저층 엘베 먼곳으로 배정받고 여러가지로 불편했음 녹색 걸레가 냉장고 선반위에 올려져있어 어이없었음 재방문의사 없음 비추천 위치는 좀 애매하지만 호텔 바로 앞에 버스는 있음 직원은 친절 조식 종류가 생각보다 없어서 놀랬고 위생상태는 나쁘지 않음 추석 성수기인점 감안하면 나쁘지 않으나 평소에 그 가격으로 이용하기엔 퀄리티 떨어짐 출장객이어서 회사가 근처라면 모르겠지만 여행객에게는 그리 좋은 위치는 아님 위생상테와 직원 태도 숙소편의는 그냥저냥 보통 조식이 맛있었습니다 조식너무좋았구요 잘쉬다 놀다 갔어요 글쎄요 그저 그런 비즈니스 호텔입니다 비즈니스 호텔이 뭐 그렇지 라고 생각하신다면 만족일텐데 호캉스 생각하시면 별로요 위치가 좋아요 위치는 지하철역과 좀 멀어서 좀 불편한데 그거말고는 다 만족 시설 및 깨끗해서 좋았어요 시설 위치 등 전제적으로 만족스러웠습니다 역쉬 신라 호텔 계열이라서 직원들이 너무 친절해요 다음 고국방문 및 출장시 다시 예약하고 싶게 하내요 깔끔하고 강남에 묵을 수 있는 적정한 가격대의 호텔 같아요 단점은 방크기가 다소작음 방음약함 그 외는 만족 깨끗 접근성 좋음 버드나무집아티제커피바모두이용했음 주변에 먹거리가 있어서 괜찮았습니다 대중 교통은 조금 불편하구요 자가용이나 택시 이용이 나을 것 같네요 다 좋은데 위치가 좀 애매하긴 합니다 선릉과 역삼 사이라 신라스테이 여느지점처럼 편안하고 좋았습니다 조식도 추가해서 이용했는데 참 좋았구요 약식 호캉스로 즐기기에도 좋았습니다 아고다에서 특가떴을 때 저렴하게 예약했습니다 가격대비 만족하구요 객실도 청결하고 편리했습니다 다만 방음이 잘되어 있지않아 옆방에서 나는 소리 문여닫는 소리 등이 크게 들려서 조금 불편했습니다 신라스테이 여러 지점을 방문해봤으나 출장으로는 역삼이 최고입니다 위치점 잇점이 있기도하고 스태프도 친절합니다 다른 지점에서 보이는 모텔용으로 오는 그런 커플들 보단 출장러가 많고 층 로비의 긴 테이블에서 회의하고 작업하기도 좋아요 딱히 엄청 좋다거나 엄청 별로라거나 그런건 아니고 그냥 가격대비그 가격위치가 역삼이랑 선릉 중간이긴한데 둘다 엉성하게 가깝지도 멀지도 않아서 위치가 딱히 좋다고 할 순 없고룸이 무척 좁아요 캐리어가 있으면 둘데가 없을거 같아요 깔끔 했지만 수건이 너무 오래 되서 아쉬웠어요 깨끗하고 깔끔하고 조용하고 아주 좋았음 만족합니다 시설도 좋고 깨긋하고 만족합니다 깨끗하고 시티뷰도 고층객실 배정 받아서 생각보다 너무 좋았네요 숙소위치가 역삼역과 선릉역 중간이라 좀 찾는데 헤맸지만 만족합니다  좋아요 교통요충지 그리고 객실도 괸찮음 대체적으로 가격대비 만족하는 편입니다 근데 가끔씩 룸컨디션 실망스러울때 몇번 있엇어요 귀찬아서 그냥 있긴햇지만 개선해주셨음 합니다 깔끔하고 위치상 좋은거 같네요 서울출장을 자주 가는편인데 금액대비 괜찬은거 같아요 근데 가끔 청소상태 별로 일때 있어서 기분상할때 몇번이나 있었어요 모든 부분에서 만족합니다 위치도 괜찮고 좋네요 위치적으로 강남에 방문하는 출장객들에게 최적의 장소이며 가격대비 룸 컨디션이 훌륭합니다 조식도 음식 가짓수는 적지만 나름 만족스럽고 모든게 가격대비 기대이상입니다 이 부근의 비즈니스 출장을 목적으로 하는 사람들에게는 더할 나위 없이 좋은 위치 입니다 걸어서 모든 곳을 방문할 수 있고 강남의 파이낸셜 디스트릭트를 피부로 느끼기에 최적의 장소 입니다 뒷편에 식당들도 많이 있으며 편의점도 가까워 모든게 편리했습니다 출장가는 사람들에게 위치적으로는 최고 입니다 호텔 뒷편에 로컬 식당들도 많고 인근에 편의점도 있으며 테헤란로에 접해 있어서 출장온 사람들에게는 모든게 만족스러운 곳입니다 출장을 자주가는 편인데 여기만큼 위치가 좋고 가격대비 깔끔한 곳을 찾기는 어려울 것 같습니다 지하철역이 멀긴 하지만 걸어서 왠만한 곳은 갈 수 있는 위치입니다 룸 컨디션도 좋은 편이고 모든 시설이 대부분 만족스럽네요 위치는 좋았는데 뒤동네가 약간 지저분한 느낌 수건을 좀 다른 호텔 처럼 더 품격있고 뽀송한 걸로 새걸로 사서 써주시면 안될까요 직원들도 친절하고 다 좋습니다 가성비 좋다고 생각하지만 수건이 펑크나거나 틑어진 것들이 자꾸 들어와서 기분 좋지 않았던 다른 건 비교적 괜찮았습니다 중심가와 가깝고 인천공항 리무진이 바로 앞에있어 편했습니다 다소 객실이 좁지만 깨끗하고 서비스도 뛰어납니다 다만 수건이 좀 더 깨끗했으면 합니다 비지니스 출장으로 숙박을 했는데 직원들의 친절함과 위생상태가 좋았습니다 세륜 방음 방음잘안대용 복도에서 얘기하는거 다들림 좋았음 일단 공항 리무진 및 시내 미팅 접근성도 좋고 방 상태도 상당히 좋습니다 직원분들 상당히 친절하시고 다만 뭔가를 찾으려 침대밑을 한번 봤는데 먼지 덩어리들이 굴러 다니던 것 빼고는 백점 만점인 호텔입니다 시설직원청결 여유객실있어서 무료로 룸 업그레이드도 해주시고 역삼역근처라 접근성도 좋구요 일단 새로 오픈한곳이라 깨끗하고 쾌적했어요 만족스럽습니다  좋은 호텔이었습니다 조식도 맛나고 위치도 나쁘진 않았습니다 다음에도 여기 호텔에서 묵을 생각입니다 좋은 전망 엄청 깔끔 심플 객실은 좁았지만 깔끔했구요 사용하기 불편한건 전혀 없었습니다 침구며 객실의 온도조절도 편안했구요직원분들도 친절하셨습니다그냥 도심에서 적절한 가격으로 이용하기 좋은 곳이라 생각됩니다 뷰나 객실의 크기침대의 넓이를 좀 포기한다면 깔끔하고 쾌적하게 이용하기 좋은 호텔입니다층 카페조식은 이용해보지 않았지만 호텔층과 주변 식당가에서 충분히 간단한 조식 즐기기에도 편리하고 역삼역이 근처에있어 접근성도 좋은편입니다 여행을 다니면서 비싼 값을 주더라도 깔끔하고 시설 좋은 숙소를 찾는 편인데 가격대비 항상 만족했던 신라스테이 입니다 다만 위치가 지하철역과 좀 멀어서 지하철을 이용하는 거라면 좀 많이 걸어야 합니다 이외에는 모든 서비스가 만족스러웠습니다 직원은 친절함 저층 대로변은 자동차 등 도로쪽 소음 때문에 매우 시끄러움 건너편 방들은 좀 더 조용할 수도 있음 옆방 티비소리 대화소리도 상당히 거슬릴 만큼 시끄러움 귀마개 하고 잠 고층 비싼 방은 조용할 지도 모르겠음 깔끔해요 말하지 않았는데 룸 업글 해주셔서 기분 좋게 묵었습니다 멀리서 보이는 롯데타워로 시티 뷰가 더 좋게 느껴졌구요 욕실은 좁았지만 욕조도 있어서 배쓰밤 챙겨가서 스파도 했어요 객실 구성은 실용적으로 잘 되어있는 것같았어요 조식이 일단매우 맛있어서 만족 했습니다 다음번에 또 이용할 의사 있음 잘 묵고왔습니당 깨끗하고 좋은데 호 변기물 내리면 물나오는곳 방향이 틀어졌는지 밖으로 좀 세요 샤워부스 타일 하나 빠져있구요 다른건 깨끗하고 좋네요 위치나 뭐 다 좋은데 밤에 차소리가 다 들려서 시끄럽고층 옆방이랑 방음도 그렇게 좋지 않아요 수압도 너무 약하구요 소음이랑 수압때문에 다시 갈 것 같지는 않습니다 시설도깔끔하고 쾌적했어요 난방이너무잘되서 답답하긴했지만 매우만족했어욥 화장실 냄새가 심해요 환풍기 제대로 돌아가는지 의문입니다 지하철역이 멀어서 버스이용하는게 더 편했어요 신라스테이 좋아하는데 역삼은 별로였습니다 선릉역 역삼역 언주역 가운데에 있어서 역에서는 좀 걸어야 합니다 호텔 전체적인 부분이나 방 컨디션 다 좋은데 방이 너무 건조했어요 아무래도 난방 때문이겠죠ㅠㅠ 그래도 만족합니다 조식이맛있엇어요조식이맛있엇어요 잘 묵었습니다 강남과 가까워서 좋았지만 대중교통 이용은 불편해 항상 택시를 타고 움직였습니다 그래도 호텔은 최고 신라스테이 다른지점들보다 조금더고급스러운 느낌이고 출장 및 커플여행에 적합합니다 조식과 어매니티가 좋아요 아주 기분좋은 마무리하고 왔어요 아침에 출근할때까지 너무만족하고왔습니다 일단 위치가 너무만족스러웠어요 교통도 편리하고 신축이라 깨끗해서 좋았어요 평일에는 저렴한 가격에 이용가능해서 좋았구요 다만 조명이 너무 약해서 화장할때 불편해요ㅠ 손거울 가져가면 좋을듯 여직원분이 불친절 합니다 냉무 대체적으로 나쁘지않고 좋았어요 아이들도 좋아하고 잘쉬고 여행할수있어 좋았습니다 다만 며칠전 롯데에서 사용한결과와 비교가 되는데 온가족 먼지 알러지가 있어서 바닥이 마루인점 좋았고 구석에 먼지가 청소가 안되어 있어서 별점 뺐어요 제가 물티슈청소했어요ㅜㅜ 목욕가운이 좀 낡아서인지 부드럽지가 않았어요 뽀얌도 덜하고 약간 아쉬운점이었네요 추가한 조식은 맛있게 먹었으나 방울토마토가 덜씻김있었는데 분명 거품이 묻어있어 직원에게 말하니 옆 방울토마토끼리 부딪혀 그런거라는 황당한 변명 기분상하기 싫어 안먹고 땡 침구가 포근하고 좋았습니다 방에 들어갔을 때 냄새가 좀 났지만 창문을 열 수 있어서 시간 가량 환기 시키니 괜찮네요 하지만 와인패키지를 선택했는데 레스토랑에서 직접 수량해야하고 마냥 기다리게 했으며 오프너가 없다고 그냥 열어서 올려보내더군요 와인 서비스를 하는거라면 오프너를 수량에 맞게 준비하는게 기본이 아닐까 생각합니다 숙박만은 추천그외 부대시설을 이용하는건 비추입니다 호텔이 회사 근처에 있어 해외 현지 직원을 위해 박을 예약을 하면서 결제까지 끝냈다 그런데 일정이 바뀌어 체크인을 하루 늦게 하고 체크아웃을 하루 일찍해 결국은 박만 하고 체크 아웃을 하고 나온 직원이 나에게 하는 말  체크인을 하루 늦게 해 노쇼라며 첫날 숙박료를 강요해 어쩔수 없이 결재를 하고 나오는 말도안되는 일이 일어나 호텔에 전화를 했더니 전화 받는 직원왈 자기네는 규정대로 한것이고 노쇼로 인해 추가로 발생된 비용은 아고다와 얘기 하라는 당황스런 얘기를 한다 해서 하루 일찍 체크아웃 한건 환불해 줄거냐며 따젔더니 이번엔 다른 사람이 넘겨 받더니 죄송하면 카드 승인난거 취소해준다는 어이없는 대답을 하며 전화를 끊더라 만약 이런 상황에 따지지 않았으면 호텔이 부당 이익을 취하는거 아닌가 우리 직원같은 출장온 사람들이나 관광객들에게 이런상황에서 호텔직원들이 우기면 꼼짝없어 당할수 밖에 없을것이다 샤워실엔 냄새 올라오구요 침구엔 구멍이 저렴한 가격에 깔끔한 비즈니스 호텔같아서 예약했는데 배정받은 방에 들어가자마자 화장실 악취가 나서 방 교체 요청했구요 다시 받은 방에는 곳곳에 먼지와 쓰레기들 전기포트는 세척 안하나봐요 안에 양배추 무 건더기 잔뜩있어서 진짜 놀랬습니다 화장실 어메니티 뜯겨져 있는거 그대로 있었구요 쥐 나올까봐 무서웠어요 숙소는 깔끔하고 만족스러운 비지니스 호텔이었습니다 하지만 자가용을 가져가지 않는이상 교통편이 너무 불편했어요ㅠㅠ 지하철역에서 굉장히 멀다는ㅜ 그 외엔 만족스럽습니다 말 그대로 강남에 위치 좋고 가격 대비 만족 스러운 숙소 딱히 흠잡을곳은 없지만 만원짜리는 아닌듯호텔침대라긴 매트리스가 허리아플정도였고 환기가 안되는지 공기가 매우답답했음만원정도였다면 만족할수도다만 침대퀄러티때문에 다시선택하진않을듯 다 괜찮았는데 수건이 별로 쓰고 나면 약간 묵은 냄새 서울시내여서 그런지 방도 작고 위치말고는 별로 추천할것이 없습니다 디럭스 더블 사용 들어가자마자 소파 밑에 있는 병뚜껑 발견했지만 참음 커튼 여는데 먼지가 너무 많음 누구 머리카락인지 확신할 수 없겠지만 눕기도 전에 베개 밑에서 긴 머리카락 발견 방음도 안되서 부시럭거리는 청소소리에 낮잠도 못잠 방음은 정말 안됨 화장실 문 너무 무거워요 ㅠ 방은 뭔가 좁고 답답함 다신 안갈듯 합니다 호텔같지 않네요  룸컨디션이 좋지 않습니다 방문이 안열려 프론트까지 여러번 왔다갔다함 직원 서비스 좋지 않음 청소상태불량 호텔 뒤로 먹을 곳은 많음 깔끔하고 괜찮습니다 면도기 등 기본적인 물품이 부족하고 직원이 별로 친절하지 않음 처음 들어갔을 때 드는 느낌은 매우 깨끗함 직원 친절도는 중간정도 으로 이동하는  속도 빠름 주변에 다들 라서 별로 있는게 없음 지하철 역도 제법 걸어가야 함 밤에 소음이 심해서 잠을못잤어요  생긴지얼마안된곳이라 침구도 시설도 깨끗한건좋았어요 비지니스호텔이라 추가서비스들은 조금 일반호텔만큼은 아니었지만 괜찮았구요 다만 생각보다 방이좁았어요 그러나 가격대비위치대비괜찮았어요 아침 조식은 부실한 편이었지만 방과 침구는 청결하고 좋았네요 가격 청결 위치 위치침구류비품들은 좋다고 생각이 됩니다 전체적인 서비스나 비품들은 나무랄때가 없습니다 특히나 침구류가 아주 마음에 들었습니다 하지만 방크기가 에러네요 혼자서 쓰기에는 문제가 없으나 명이상 이방에서 묶기에는 무리가 있다고 봅니다 거리 근접 깨끗 조용 위치 청결 경제성 생각했던 것보다 방이 너무 작아 여자친구에게 미안하더라구요 신라호텔의 이름만 믿고 예약했던 것이 조금 후회가 되었습니다 그 가격에 몇만원만 더 주면 성급 호텔에서 투숙 할 수가 있었는데 신라스테이는 해외 혹은 지방 인 출장자들이 잠깐 머물기 좋은 호텔입니다 그 이상 그 이하도 아님 공항환승이 편리하다 조용하다 주변에 음식점이 많다 신라의 이미지에 기대 이하였고 특히 욕실의 목욕 타올에 분홍색 립스틱 자국이 선명한 것이 세탁하지 않은 것을 그냥 접어놓은 것에 대한 불쾌감 직원의 그럴리가 없다는 변명식 답변 역시 불쾌했음 없음 생긴지 얼마안되서 그런지 몰라도 청결상태 빼고는 전체적으로 별로였다 입구도 잘 보이지 않게 되어 있고 여러가지로 불편하게 되어있다 날씨만 좋았다면 딱 좋은데 더운 여름날 호텔앞엔 버스거의없고 대로변 걸어나가다 돌아버릴뻔 그래도 그것만빼면 가성비대비 좋았음 조식이 마음에 들었어요 룸컨디션은 좋습니다 직원분들의 친절에 많이많이 감사드립니다 잠만 자야할듯요 조식 정말 별루예요 샤워가운을 개봉하면 먼지가 심하게 나옵니다 먼지가 방에 돌아다녀 목이 아픕니다 착용하신 옷에 따라 먼지가 많이 붙을 수 있으니 착용을 주의 하시길 바랍니다 총괄 책임자 분이 오셔서 직원교육용으로 쓰시겠다며 사진을 찍어가셨습니다 다만 총괄책임자 분이 너무 친절하셔서 연신 사과를 하셨습니다 좁긴했지만 하루 쉬기 좋았습니다 물론 시설서비스는 정말좋았어요 층 한식집 진짜 맛있어요 화장실 약간 지져분해요 비슷한 가격대의 다른 호텔보다 좁고 화장실 청소상태가 별로임 냄새도 나고 비추천 신라스테이 무난하게 좋은 것 다 알지만 역삼은 조금 아쉽습니다 화장실 샤워실에 물도 빠지지않고 군데군데 먼지가 뭉쳐있고 조금 전체적으로 청결도가 아쉬워서 이번달 말 신라스테이 해운대 묵을 예정인데 조금 걱정 될 정도네요  적절한 가격에 강남 비즈니스 호텔을 이용했다고 생각합니다 방에 다리미도 있더라고요 단지 청소가 책상 아래 구석이나 쇼파 뒤쪽까지는 안되어 있어서 아쉽습니다 선릉역에서 분은 걸어야합니다 도로변 쪽 방에 배정받았는데 샷시가 저렴한것인지 도로 소음 외풍 심했습니다 어매니티는 좋았고 이불도 좋았어요 안전한 분위기를 중요시해서 선택했는데 이외의 이유라면 비추입니다 지난 여름 더위를 피해 이용했지만 역에서 너무 먼거리 때문에 불편했네요 시설적인 면에서는 모두 만족하고 특히 조식이 만족스러웠습니다 룸도 깔끔하고 좋았습니다 조식도 기대를 안해서 그런지 먹을만했습니다 주변엔 거의 회식하는 분위기의 식당들이라 가족 커플끼리 조용하게 먹을 수 있는 곳은 없어서 아쉬웠습니다 생각보다 객실이 넓고 깨끗함 선릉역에서 좀 걸어야 함 다시 묵을 의향은 있음 겨울도 아닌데 쌀쌀해서 난방에 대해서 여쭤봤더니 밖의 온도가 그리 낮지가 않아서 아직 난방을 틀지 않는다네요 라디에이터는 부족해서 담요 갖다주셨어요 근데 라디에이터가 모자르다는 뜻은 다른 투숙객들도 다 춥다고 느꼈기때문이 아닐까요 이 점이 조금 아쉬웠습니다 일단 뷰가 너무 좋고요 욕조 사이즈와 간단한 헬스장의 구비 덕에 여유로운 호캉스를 보냈습니다 역삼동 대로변에 위치한 좋은위치 깨끗한 룸 친절한 스태프 조용한 주변환경과 주차도 좋았습니다 강남권역에서 이만한 가격에 이런 호텔 가성비 최고라 생각합니다 매우 만족 수준이었습니다 감사합니다 강남에서 가격대비 만족도가 높은 호텔 룸컨디션은 좋아용 근데 지하철까지 걸어가긴 멀어서 ㅜㅠ 쏘카존도 좀 걸어야하구 고런거 빼면 괜찮았어요 씨티뷰였고 탁 트인 야경에 스텐드아래 책읽는시간이좋앗습니다 침대도포근하고 부족하지않은 층 디럭스였습니다 위치가 지하철역과 좀 떨어져 있어서 아쉬웠고 바닥에 머리카락 뭉터기가 굴러다녔던거 말고는 다른부분들은 만족합니다 여름휴가보내려고 방문했어요 코엑스롯데월드타워 가깝고 주변이 회사들이라 저녁에 조용해서 좋았어요 건물에 세븐일레븐 아띠제 빵집있어서 좋았고 조식신청해서 먹었는데 사람이 엄청 붐비고 음식이 비어있는게 많아서 조식은 좀 실망이였어요

In [223]:
from konlpy.tag import Okt                                  ## 다른 형태소를 클래스를 가져온다. 
okt = Okt()
hotelnoun = okt.nouns(hotelstr)
print(hotelnoun[:50])

['대중교통', '이용', '면', '역', '거리', '시설', '어메니티', '위치', '가격', '대비', '방이', '청결', '직원', '응대', '강남', '가격', '그냥', '것', '위치', '개', '역', '중간', '즈음', '짐', '날씨', '함', '화장실', '하수', '냄새', '후기', '약시', '냄새', '안나', '방', '요청', '체크', '인시', '더블체크', '함', '막상', '사용', '냄새', '화장실', '쪽', '자꾸', '소리', '남', '방', '환풍기', '소리']

In [225]:
hotelRDD = spark.sparkContext.parallelize(hotelnoun)

In [226]:
wc = hotelRDD.flatMap(lambda x: x.split(' ')) \
                  .map(lambda x: (x, 1)) \
                  .reduceByKey(lambda x1, x2: x1 + x2) \
                  .map(lambda x: (x[1], x[0])) \
                  .sortByKey(ascending=False).collect()

for (count, word) in wc[:30]:
    print("{} : {}".format(word, count))

위치 : 149
호텔 : 138
직원 : 104
가격 : 98
이용 : 81
조식 : 74
신라 : 67
시설 : 66
방 : 62
좀 : 61
룸 : 61
것 : 59
대비 : 50
스테이 : 49
조금 : 46
생각 : 46
상태 : 45
다만 : 42
때 : 41
곳 : 41
객실 : 40
숙소 : 39
소리 : 37
출장 : 37
층 : 37
더 : 34
냄새 : 34
청결 : 33
청소 : 33
화장실 : 31

### Spark를 활용하여 product_click_new.log 파일로 날짜 데이터에 대한 전처리를 처리해보자~

In [227]:
click = spark.read.csv("data/product_click_new.log", sep=" ", inferSchema=True)

In [228]:
click.show(5)

+------------+----+
|         _c0| _c1|
+------------+----+
|201612120944|p001|
|201612120944|p003|
|201612120944|p003|
|201612120945|p008|
|201612121052|p008|
+------------+----+
only showing top 5 rows

In [229]:
click = click.withColumnRenamed("_c0", "clicktime")\
       .withColumnRenamed("_c1", "pid")
click.show(5)

+------------+----+
|   clicktime| pid|
+------------+----+
|201612120944|p001|
|201612120944|p003|
|201612120944|p003|
|201612120945|p008|
|201612121052|p008|
+------------+----+
only showing top 5 rows

In [230]:
click.printSchema()

root
 |-- clicktime: long (nullable = true)
 |-- pid: string (nullable = true)

In [231]:
from pyspark.sql.functions import col
from pyspark.sql.functions import StringType
click = click.withColumn("clicktime",col("clicktime").cast(StringType()))

In [232]:
click.printSchema()

root
 |-- clicktime: string (nullable = true)
 |-- pid: string (nullable = true)

In [233]:
import pyspark.sql.functions as f
click = click.withColumn('year',f.year(f.to_timestamp('clicktime', 'yyyyMMddhhmm')))
click = click.withColumn("month",f.month(f.to_timestamp('clicktime', 'yyyyMMddhhmm')))
click = click.withColumn("day",f.dayofmonth(f.to_timestamp('clicktime', 'yyyyMMddhhmm')))
click = click.withColumn("hour",f.hour(f.to_timestamp('clicktime', 'yyyyMMddhhmm')))
click = click.withColumn("minute",f.minute(f.to_timestamp('clicktime', 'yyyyMMddhhmm')))

In [234]:
click.show(5)

+------------+----+----+-----+---+----+------+
|   clicktime| pid|year|month|day|hour|minute|
+------------+----+----+-----+---+----+------+
|201612120944|p001|2016|   12| 12|   9|    44|
|201612120944|p003|2016|   12| 12|   9|    44|
|201612120944|p003|2016|   12| 12|   9|    44|
|201612120945|p008|2016|   12| 12|   9|    45|
|201612121052|p008|2016|   12| 12|  10|    52|
+------------+----+----+-----+---+----+------+
only showing top 5 rows

In [235]:
click.groupby("hour").count().show()

+----+-----+
|hour|count|
+----+-----+
|   9|  110|
|  10|   80|
|  11|  120|
+----+-----+

In [236]:
click.select(f.hour(f.to_timestamp(click.clicktime, 'yyyyMMddhhmm')).alias('dt')).groupby('dt').count().show()

+---+-----+
| dt|count|
+---+-----+
|  9|  110|
| 10|   80|
| 11|  120|
+---+-----+

## 타이타닉 데이터셋을 활용한 EDA,전처리 그리고 분석을 스파크로 해봅시다요

In [ ]:
from pyspark.sql import SparkSession
from pyspark.sql.functions import mean,col,split, col, regexp_extract, when, lit
from pyspark.ml.feature import StringIndexer
from pyspark.ml import Pipeline

In [ ]:
titanic_df = spark.read.csv("data/train.csv",header = 'True',inferSchema='True')

In [ ]:
passengers_count = titanic_df.count()

In [ ]:
print(passengers_count)

In [ ]:
titanic_df.show(5)

In [ ]:
titanic_df.describe().show()

In [ ]:
titanic_df.printSchema()

In [ ]:
titanic_df.select("Survived","Pclass","Embarked").show()

## 자~ EDA(Exploratory Data Analysis)를 해봅시다요.

In [ ]:
titanic_df.groupBy("Survived").count().show()

In [ ]:
titanic_df.groupBy("Sex","Survived").count().show()

In [ ]:
titanic_df.groupBy("Pclass","Survived").count().show()

In [ ]:
# This function use to print feature with null values and null count 
def null_value_count(df):
  null_columns_counts = []
  numRows = df.count()
  for k in df.columns:
    nullRows = df.where(col(k).isNull()).count()
    if(nullRows > 0):
      temp = k,nullRows
      null_columns_counts.append(temp)
  return(null_columns_counts)

In [ ]:
null_columns_count_list = null_value_count(titanic_df)

In [ ]:
null_columns_count_list

In [ ]:
spark.createDataFrame(null_columns_count_list, ['Column_With_Null_Value', 'Null_Values_Count']).show()

In [ ]:
mean_age = titanic_df.select(mean('Age')).collect()[0][0]
print(mean_age)

In [ ]:
titanic_df = titanic_df.withColumn("Initial",regexp_extract(col("Name"),"([A-Za-z]+)\.",1))

In [ ]:
df = spark.createDataFrame([('100-200',)], ['str'])
df.select(regexp_extract('str', r'(\d+)-(\d+)', 0).alias('d')).collect()

In [ ]:
titanic_df.show()

In [ ]:
titanic_df.select("Initial").distinct().show()

In [ ]:
titanic_df = titanic_df.replace(['Mlle','Mme', 'Ms', 'Dr','Major','Lady','Countess','Jonkheer','Col','Rev','Capt','Sir','Don'],
               ['Miss','Miss','Miss','Mr','Mr',  'Mrs',  'Mrs',  'Other',  'Other','Other','Mr','Mr','Mr'])

In [ ]:
titanic_df.show()

In [ ]:
titanic_df.select("Initial").distinct().show()

In [ ]:
titanic_df.groupby('Initial').avg('Age').collect()

In [ ]:
titanic_df.filter(titanic_df.Age==46).select("Initial").show()

In [ ]:
titanic_df.select("Age").show()

In [ ]:
titanic_df = titanic_df.withColumn("Age",when((titanic_df["Initial"] == "Miss") & (titanic_df["Age"].isNull()), 22).otherwise(titanic_df["Age"]))
titanic_df = titanic_df.withColumn("Age",when((titanic_df["Initial"] == "Other") & (titanic_df["Age"].isNull()), 46).otherwise(titanic_df["Age"]))
titanic_df = titanic_df.withColumn("Age",when((titanic_df["Initial"] == "Master") & (titanic_df["Age"].isNull()), 5).otherwise(titanic_df["Age"]))
titanic_df = titanic_df.withColumn("Age",when((titanic_df["Initial"] == "Mr") & (titanic_df["Age"].isNull()), 33).otherwise(titanic_df["Age"]))
titanic_df = titanic_df.withColumn("Age",when((titanic_df["Initial"] == "Mrs") & (titanic_df["Age"].isNull()), 36).otherwise(titanic_df["Age"]))

In [ ]:
titanic_df.groupBy("Embarked").count().show()

In [ ]:
titanic_df = titanic_df.na.fill({"Embarked" : 'S'})

In [ ]:
titanic_df = titanic_df.drop("Cabin")

In [ ]:
titanic_df.printSchema()

In [ ]:
titanic_df = titanic_df.withColumn("Family_Size",col('SibSp')+col('Parch'))

In [ ]:
titanic_df.show()

In [ ]:
titanic_df.groupBy("Family_Size").count().show()

In [ ]:
titanic_df = titanic_df.withColumn('Alone',lit(0))

In [ ]:
titanic_df = titanic_df.withColumn("Alone",when(titanic_df["Family_Size"] == 0, 1).otherwise(titanic_df["Alone"]))

In [ ]:
titanic_df.columns

In [ ]:
indexers = [StringIndexer(inputCol=column, outputCol=column+"_index").fit(titanic_df) for column in ["Sex","Embarked","Initial"]]
pipeline = Pipeline(stages=indexers)
titanic_df = pipeline.fit(titanic_df).transform(titanic_df)

In [ ]:
titanic_df.show()

In [ ]:
titanic_df.printSchema()

In [ ]:
titanic_df = titanic_df.drop("PassengerId","Name","Ticket","Cabin","Embarked","Sex","Initial")

In [ ]:
titanic_df.show()

## pyspark.ml 모듈의 분석 함수들은 데이터셋에 features 가 있어야 학습을 진행함
### pyspark.ml.VectorAssember를 사용해서 feature로 사용하여 컬럼들에 대한 리스트를 지정하고 features 열을 추가한다.

In [ ]:
from pyspark.ml.feature import VectorAssembler
feature = VectorAssembler(inputCols=titanic_df.columns[1:],outputCol="features")
feature_vector= feature.transform(titanic_df)

## 훈련데이터와 검증 데이터를 8:2로 나눈다.

In [ ]:
(trainingData, testData) = feature_vector.randomSplit([0.8, 0.2],seed = 11)

In [ ]:
trainingData.show()

## 모델링
### Spark ML에서 제공하는 분류 분석

### LogisticRegression

### DecisionTreeClassifier

### RandomForestClassifier

### Support Vector Machine

In [ ]:
from pyspark.ml.evaluation import MulticlassClassificationEvaluator

## LogisticRegression
### 로지스틱 회귀(Logistic Regression)는 회귀를 사용하여 데이터가 어떤 범주에 속할 확률에서 0 에서 1 사이의 값으로 예측하고 
### 그 확률에 따라 가능성이 더 높은 범주에 속하는 것으로 분류해주는 지도 학습 알고리즘이다

In [ ]:
from pyspark.ml.classification import LogisticRegression
lr = LogisticRegression(labelCol="Survived", featuresCol="features")
#Training algo
lrModel = lr.fit(trainingData)
lr_prediction = lrModel.transform(testData)
lr_prediction.select("prediction", "Survived", "features").show()
evaluator = MulticlassClassificationEvaluator(labelCol="Survived", predictionCol="prediction", metricName="accuracy")

### 평가

In [ ]:
lr_accuracy = evaluator.evaluate(lr_prediction)
print("Accuracy of LogisticRegression is = %g"% (lr_accuracy))
print("Test Error of LogisticRegression = %g " % (1.0 - lr_accuracy))

## DecisionTreeClassifier

### 스무고개를 연상케하는 알고리즘
### 트리구조를 사용하고 각 분기점(NODE)에는 분석 대상의 속성이 위치함
### 가장 높은 정보 획득량(information gain)을 제공하는 속성을 우선적으로 선택하여 분류를 시작함
### 다른 모델들과는 다르게 결과물이 시각적으로 읽히기 쉬운형태로 나타나는 것이 장점

In [ ]:
from pyspark.ml.classification import DecisionTreeClassifier
dt = DecisionTreeClassifier(labelCol="Survived", featuresCol="features")
dt_model = dt.fit(trainingData)
dt_prediction = dt_model.transform(testData)
dt_prediction.select("prediction", "Survived", "features").show()

### 평가

In [ ]:
dt_accuracy = evaluator.evaluate(dt_prediction)
print("Accuracy of DecisionTreeClassifier is = %g"% (dt_accuracy))
print("Test Error of DecisionTreeClassifier = %g " % (1.0 - dt_accuracy))

### RandomForestClassifier

### 의사결정 트리의 오버피팅 한계를 극복하기 위한 전략
### 랜덤 포레스트는 훈련을 통해 구성해놓은 다수의 나무들로부터 분류 결과를 취합해서 결론을 얻는 방식

In [ ]:
from pyspark.ml.classification import RandomForestClassifier
rf = DecisionTreeClassifier(labelCol="Survived", featuresCol="features")
rf_model = rf.fit(trainingData)
rf_prediction = rf_model.transform(testData)
rf_prediction.select("prediction", "Survived", "features").show()

### 평가

In [ ]:
rf_accuracy = evaluator.evaluate(rf_prediction)
print("Accuracy of RandomForestClassifier is = %g"% (rf_accuracy))
print("Test Error of RandomForestClassifier  = %g " % (1.0 - rf_accuracy))

## Support Vector Machine

### 주어진 데이터가 어느 카테고리에 속할지 판단하는 이진 선형 분류 모델
### 데이터군으로 부터 최대의 마진을 갖도록 결정 경계를 찾아서 분류함

In [ ]:
from pyspark.ml.classification import LinearSVC
svm = LinearSVC(labelCol="Survived", featuresCol="features")
svm_model = svm.fit(trainingData)
svm_prediction = svm_model.transform(testData)
svm_prediction.select("prediction", "Survived", "features").show()

### 평가

In [ ]:
svm_accuracy = evaluator.evaluate(svm_prediction)
print("Accuracy of Support Vector Machine is = %g"% (svm_accuracy))
print("Test Error of Support Vector Machine = %g " % (1.0 - svm_accuracy))

https://www.kaggle.com/rmn420/titanicdata-pyspark